{"input": "Write the following triples as fluent English text.\n\nTriples:\nDallas | partsType | List_of_counties_in_Texas", "output": ["Dallas is a county in Texas."], "id": "Id45"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\n11th_Mississippi_Infantry_Monument | location | Adams_County,_Pennsylvania\n11th_Mississippi_Infantry_Monument | municipality | Gettysburg,_Pennsylvania", "output": ["The 11th Mississippi Infantry Monument is in the municipality of Gettysburg, PA in Adams County.", "The 11th Mississippi Infantry Monument is in the municipality of Gettysburg, Adams County, in Pennsylvania.", "The municipality for the 11th Mississippi Infantry Monument is Gettysburg, Adams County, Pennsylvania.", "The 11th Mississippi Infantry Monument is found in Adams County, Gettysburg, Pennsylvania.", "The 11th Mississippi Infantry Monument is located in Adams County, in Gettysburg, Pennsylvania."], "id": "Id6"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\nA_Glastonbury_Romance | followedBy | Weymouth_Sands\nWeymouth_Sands | author | John_Cowper_Powys", "output": ["'A Glastonbury Romance' was followed by 'Weymouth Sands' which was authored by John Cowper Powys.", "The book \"A Glastonbury Romance\" was followed by \"Weymouth Sands\" the author of which is John Cowper Powys.", "\"A Glastonbury Romance\" was followed by \"Weymouth Sands\" written by John Cowper Powys."], "id": "Id67"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\nBacon_sandwich | dishVariation | BLT\nBacon_sandwich | mainIngredient | \"Bread and bacon, with a condiment, often ketchup or brown sauce\"\nBacon_sandwich | country | United_Kingdom\nBacon_sandwich | alternativeName | \"Bacon butty, bacon sarnie, rasher sandwich, bacon sanger, piece 'n bacon, bacon cob, bacon barm, bacon muffin\"\nBacon_sandwich | ingredient | Bacon", "output": ["A variation of the BLT is a bacon sandwich which is popular in the UK. The main ingredients in a Bacon sandwich are bread and bacon with ketchup or brown sauce as a condiment. This sandwich can also be known as a bacon butty, bacon sarnie, rasher sandwich, bacon sanger, piece 'n bacon, bacon cob, bacon barm, or bacon muffin.", "The United Kingdom is home to the bacon sandwich which has the main ingredients bread and bacon and a condiment, often ketchup or brown sauce. A variation of the bacon sandwich, which is also known as bacon butty, bacon sarnie, rasher sandwich, bacon sanger, piece 'n bacon, bacon cob, bacon barm and bacon muffin is the BLT.", "The bacon sandwich goes by the names: bacon butty, bacon sarnie, rasher sandwich, BLT, bacon sanger, piece n' bacon, bacon cob, bacon barm or bacon muffin. It includes bacon, bread and ketchup or brown sauce and is popular in the UK."], "id": "Id82"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\nHip_hop_music | stylisticOrigin | Disco\nAllen_Forrest | genre | Hip_hop_music\nAllen_Forrest | background | \"solo_singer\"\nHip_hop_music | stylisticOrigin | Funk\nHip_hop_music | derivative | Drum_and_bass", "output": ["Allen Forrest is a solo hip hop music singer. Hip hop has origins in disco and funk and drum and bass is derived from it.", "Hip Hop musician Allen Forrest is a singer. Hip hop originates from disco and funk while being the influence on Drum & bass.", "Allen Forrest is a Hip hop singer. Hip hop gives itself as the origin of drum and bass while its origins are in Funk and disco."], "id": "Id197"}
