{"input": "Write the following triples as fluent English text.\n\nTriples:\nBattle_of_Gettysburg | isPartOfMilitaryConflict | American_Civil_War\nAmerican_Civil_War | commander | Robert_E._Lee\nAaron_S._Daggett | battle | Battle_of_Gettysburg", "output": ["The Battle of Gettysburg, where Aaron S Daggett fought, was part of the American Civil War conflict, where Robert E Lee was a commander.", "Aaron S. Daggett fought at the Battle of Gettysburg during the American Civil War which had Robert E. Lee as one of its commanders.", "Aaron S Daggett fought at the Battle of Gettysburg, part of the American Civil War conflict, one of the commaders of which, was Robert E. Lee."], "id": "Id236"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\nBinignit | country | Philippines", "output": ["The country Binignit comes from is the Philippines.", "The binignit dish can be found in the Philippines."], "id": "Id153"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\n200_Public_Square | location | Cleveland\n200_Public_Square | floorCount | 45\nCleveland | isPartOf | Cuyahoga_County,_Ohio\nCleveland | isPartOf | Ohio\nCleveland | country | United_States", "output": ["200 Public Square is in Cleveland, Ohio (part of Cuyahoga County) in the U.S. It has 45 floors.", "200 Public Square, which has 45 floors is located in Cleveland, Cuyahoga County, Ohio, United States."], "id": "Id12"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\nAIP_Advances | editor | A.T._Charlie_Johnson\nAIP_Advances | abbreviation | \"AIP Adv.\"\nA.T._Charlie_Johnson | almaMater | Stanford_University", "output": ["The editor of AIP Advances (abbreviated to AIP Adv.) is A.T. Charlie Johnson, who went to Stanford University.", "AIP Advances, AIP Adv., was edited by A T Charlie Johnson from Stanford University.", "A T Charlie Johnson from Stanford University is the editor of AIP Advances, or AIP Adv."], "id": "Id59"}
{"input": "Write the following triples as fluent English text.\n\nTriples:\nChinabank | numberOfLocations | 295\nChinabank | foundationPlace | Manila\nChinabank | type | Public_company", "output": ["Chinabank is a public company that was founded in Manila with 295 branches.", "Chinabank, founded in Manila, is a publicly traded company with 295 locations.", "Chinabank, a publicly traded company founded in Manila, has 295 banking centers."], "id": "Id26"}
