{"input": "According to Parfit, both Taurek and Lewis assume that for there to be a “sum of pain,” it must be:\n(A) all felt at a single time.\n(B) all felt by a single person.\n(C) all be caused by a single source.\n(D) all of the above.", "output": "(B)"}
{"input": "Leo Tolstoy says that art is _____.\n(A) expression\n(B) form\n(C) representation\n(D) abstract", "output": "(A)"}
{"input": "Hume defines virtue as:\n(A) a tendency to maximize happiness.\n(B) a tendency to pursue justice.\n(C) whatever mental action or quality gives a spectator a sentiment of approbation.\n(D) whatever mental action or quality brings about the best consequences for all.", "output": "(C)"}
{"input": "According to Hume, justice:\n(A) has no value.\n(B) has value in part because it is useful to society.\n(C) has value solely because it is useful to society.\n(D) has value solely because it is useful to the agent.", "output": "(C)"}
{"input": "According to Kant, moral laws are:\n(A) necessary and apply to all rational beings.\n(B) contingent and apply only to human beings.\n(C) culturally relative.\n(D) grounded in God’s commands.", "output": "(A)"}
{"input": "Baier argues that moral rules:\n(A) always must be applied to everyone alike.\n(B) must applied to everyone alike in the absence of morally relevant differences.\n(C) only apply to some members of a group.\n(D) are the same in every society.", "output": "(B)"}
{"input": "According to Rawls, behind the veil of ignorance, the principles of justice are _____.\n(A) the result of coercion\n(B) impractical\n(C) chosen arbitrarily\n(D) the result of a fair agreement or bargain", "output": "(D)"}
{"input": "According to Anscombe, “moral obligation” currently signifies:\n(A) the norms of a society.\n(B) the feelings of an individual.\n(C) the commands of God.\n(D) no real concept at all.", "output": "(D)"}
{"input": "How does Stevenson respond to the objection that his theory does not account for the kind of goodness that is objective and is known a priori?\n(A) He claims to have proven that such a property does not exist.\n(B) He claims to have offered an account of just such a property.\n(C) He claims he does not understand such a property.\n(D) None of the above.", "output": "(C)"}
{"input": "According to Butler, the degree to which one acts compassionately depends on:\n(A) the strength of his affection of compassion.\n(B) the strength of his other affections besides compassion.\n(C) both a and b.\n(D) neither a nor b.", "output": "(C)"}
{"input": "Moore defines the naturalistic fallacy as the view that:\n(A) everything that is natural is good.\n(B) everything that is good is natural.\n(C) good is identical to a natural property.\n(D) all of the above.", "output": "(C)"}
{"input": "Wolf argues that the unattractiveness of the moral saint:\n(A) gives us reason to abandon utilitarianism.\n(B) gives us reason to abandon Kantianism.\n(C) both a and b.\n(D) neither a nor b.", "output": "(D)"}
{"input": "In Book II of the Republic, Glaucon claims that justice originates from:\n(A) a social agreement.\n(B) nature.\n(C) the gods.\n(D) the powerful.", "output": "(A)"}
{"input": "Moore claims that there is no meaning in saying that pleasure is good, unless:\n(A) goodness and pleasure are the same thing.\n(B) good is something different than pleasure.\n(C) all good things are pleasant.\n(D) all pleasant things are good.", "output": "(B)"}
{"input": "According to Ross, we should construct a moral theory by:\n(A) constructing logical proofs for moral principles.\n(B) consulting social conventions.\n(C) reflecting on what we really think.\n(D) consulting scripture.", "output": "(C)"}
{"input": "To argue that he is obliged to obey the laws of Athens, Socrates compares the city to:\n(A) an employer.\n(B) a parent.\n(C) a friend.\n(D) a spouse.", "output": "(B)"}
{"input": "In Butler’s view, acting virtuously consists of acting in accordance with:\n(A) our strongest inward principle.\n(B) our highest inward principle.\n(C) all of our inward principles.\n(D) the commands of God.", "output": "(B)"}
{"input": "Aquinas says that the first efficient cause of everything is _____.\n(A) the universe\n(B) God\n(C) nature\n(D) an infinite series", "output": "(B)"}
{"input": "In response to the argument that famine relief is counterproductive because it leads to overpopulation, Singer claims that:\n(A) this has empirically been shown to be false.\n(B) this is true, but should not be of moral concern to us.\n(C) this is a reason to give money to population control efforts.\n(D) there is no such thing as “overpopulation.”", "output": "(C)"}
{"input": "A prima facie duty is a characteristic of an act in virtue of which the act:\n(A) seems to be right, although this might be illusory.\n(B) tends to be right, although this might be outweighed by other considerations.\n(C) is right.\n(D) is the first thing that an agent ought to do, above all else.", "output": "(B)"}
