{"input": "Depreciation of the dollar is most likely to\n(A) increase imports\n(B) increase travel abroad\n(C) increase exports\n(D) decrease a trade surplus", "output": "(C)"}
{"input": "What is the main contrast between the short-run and long-run Phillips curve?\n(A) In the short run there is a positive relationship between inflation and unemployment and in the long run the relationship is negative.\n(B) In the short run there is a positive relationship between inflation and unemployment and in the long run the relationship is constant.\n(C) In the short run there is a negative relationship between inflation and unemployment and in the long run the relationship is positive.\n(D) In the short run there is a negative relationship between inflation and unemployment and in the long run the relationship is constant.", "output": "(D)"}
{"input": "Economic growth is\n(A) measured by the number of businesses in the economy.\n(B) shared equally among the population.\n(C) critical in determining the standard of living in a nation.\n(D) measured by the amount of government spending.", "output": "(C)"}
{"input": "Suppose that the unemployment rate falls from 6 percent to 5 percent and the inflation rate falls from 3 percent to 2 percent. Which of the following best explains these trends?\n(A) An increase in aggregate demand.\n(B) A decrease in both aggregate demand and aggregate supply.\n(C) An increase in both aggregate demand and aggregate supply.\n(D) An increase in aggregate supply.", "output": "(D)"}
{"input": "Which of the following fiscal policies is likely to be most effective when the economy is experiencing an inflationary gap?\n(A) The government decreases taxes and keeps spending unchanged.\n(B) The government increases spending and keeps taxes unchanged.\n(C) The government increases spending matched with an increase in taxes.\n(D) The government increases taxes and decreases spending.", "output": "(D)"}
{"input": "If 200 computers with a retail value of $100000 are domestically produced in 2005 but not sold until 2006 then GDP in 2005 is\n(A) $100000 higher because of the computers.\n(B) 200 higher because of the computers.\n(C) unaffected until 2006 when the computers are sold and the figure for GDP in 2005 is revised.\n(D) higher by the wholesale value of the computers.", "output": "(A)"}
{"input": "The economy is currently operating at full employment. Assuming flexible wages and prices how would a decline in aggregate demand affect GDP and the price level in the short run and GDP and the price level in the long run? SHORT-RUN GDP     SHORT-RUN PRICE LEVEL     LONG-RUN GDP     LONG-RUN PRICE LEVEL\n(A) Falls     Falls     No change     Falls\n(B) Falls     Falls     Falls     Falls\n(C) No change     Falls     No change     No change\n(D) Falls     Falls     No change     No change", "output": "(A)"}
{"input": "According to monetarist analysis a decrease in the money supply would\n(A) raise the price level and output in the economy.\n(B) lower the price level and output in the economy.\n(C) raise the price level in the economy.\n(D) lower the price level in the economy.", "output": "(B)"}
{"input": "Which of the following insures the value of the U.S. dollar?\n(A) The euro and other foreign currencies held by the Federal Reserve\n(B) Gold bars in secure locations like Fort Knox\n(C) The promise of the U.S. government to maintain its value\n(D) The value of the actual paper on which it is printed.", "output": "(C)"}
{"input": "When a bank's balance sheet shows that the bank has excess reserves\n(A) the bank’s reserves exceed the bank’s assets\n(B) the bank can make additional loans\n(C) the bank’s actual reserves are less than its required reserves\n(D) the bank is required to change its interest rate", "output": "(B)"}
{"input": "Which of the following best describes a key difference between the short-run and long-run aggregate supply curve?\n(A) Short-run aggregate supply is upward sloping as nominal wages quickly respond to price level changes.\n(B) Long-run aggregate supply is upward sloping as nominal wages quickly respond to price level changes.\n(C) Short-run aggregate supply is vertical as nominal wages quickly respond to price level changes.\n(D) Short-run aggregate supply is upward sloping as nominal wages do not quickly respond to price level changes.", "output": "(D)"}
{"input": "If technology makes production less expensive and at the same time exports decrease which of the following will result with certainty?\n(A) Real GDP will increase.\n(B) Real GDP will decrease.\n(C) The price level will increase.\n(D) The price level will decrease.", "output": "(D)"}
{"input": "Which of the following would NOT shift the aggregate demand curve?\n(A) A change in consumer confidence.\n(B) A change in technology.\n(C) A change in the money supply.\n(D) A change in spending by state governments.", "output": "(B)"}
{"input": "The appropriate fiscal policy to remedy a recession is to\n(A) increase government spending and taxes.\n(B) reduce government spending and taxes.\n(C) increase government spending and reduce taxes.\n(D) decrease government spending and increase taxes.", "output": "(C)"}
{"input": "Stagflation most likely results from\n(A) increasing AD with constant SRAS.\n(B) decreasing SRAS with constant AD.\n(C) decreasing AD with constant SRAS.\n(D) a decrease in both AD and SRAS.", "output": "(B)"}
{"input": "If real GDP per capita was $20000 in 1980 and $21000 in 1990 then we conclude that the standard of living has increased\n(A) 0.5 percent.\n(B) 5.0 percent.\n(C) 50 percent.\n(D) 3.3 percent.", "output": "(B)"}
{"input": "Which of the following statements is true of production possibility curves and trade between nations?\n(A) Nations specialize and trade based on absolute advantage in production.\n(B) Free trade allows each nation to consume beyond the production possibility curve.\n(C) The flow of goods and services is based on the principle of absolute advantage.\n(D) Nations can consume at points beyond the production possibility curve by protecting domestic industries from free trade.", "output": "(B)"}
{"input": "Kevin wants shoes and grows turnips. Lisa wants turnips and makes sheet metal. Bob wants sheet metal and makes shoes. Which function of money will cater most directly to the situation at hand?\n(A) Store of value\n(B) Unit of account\n(C) Medium of exchange\n(D) Means of deferred payment", "output": "(C)"}
{"input": "If $1000 is deposited into a checking account and excess reserves increase by $700 the reserve ratio must be:\n(A) 70%.\n(B) 30%.\n(C) 40%.\n(D) 90%.", "output": "(B)"}
{"input": "Which of the following will promote economic growth?\n(A) An increase in the amount of capital.\n(B) Lower wages.\n(C) Price controls that keep prices low.\n(D) Increased government spending.", "output": "(A)"}
