{"input": "Firms maximize their profits by producing a level of output at which\n(A) MC = AFC.\n(B) MC = MR.\n(C) P = ATC.\n(D) MR= AVC.", "output": "(B)"}
{"input": "The owner of a competitive firm making zero economic profit\n(A) should consider shutting down because she could make more elsewhere\n(B) is making less than normal profits\n(C) is making exactly what she would make in her next best alternative job\n(D) will most likely make more profits in the long run", "output": "(C)"}
{"input": "The primary focus of microeconomics is\n(A) families and how they make money.\n(B) firms and how they make profits.\n(C) individual units within the overall economy.\n(D) government.", "output": "(C)"}
{"input": "Land refers to\n(A) all productive resources.\n(B) all natural resources.\n(C) farmland only.\n(D) real estate.", "output": "(B)"}
{"input": "Price times quantity measures\n(A) the international trade gap.\n(B) the budget deficit.\n(C) total revenue.\n(D) price elasticity of demand.", "output": "(C)"}
{"input": "In the absence of intervention, imperfect competition, externalities, public goods, and imperfect information all result in which of the following?\n(A) Demand curves that should be added vertically\n(B) Market failure\n(C) Prices that are too low\n(D) Quantities of output that are too high", "output": "(B)"}
{"input": "A small business estimates price elasticity of demand for the product to be 3. To raise total revenue, owners should\n(A) decrease price as demand is elastic.\n(B) decrease price as demand is inelastic.\n(C) increase price as demand is elastic.\n(D) increase price as demand is inelastic.", "output": "(A)"}
{"input": "The market for denim jeans is in equilibrium, and the price of polyester pants, a substitute good, rises. In the jean market\n(A) supply falls, increasing the price and decreasing the quantity.\n(B) supply falls, increasing the price and increasing the quantity.\n(C) demand falls, increasing the price and decreasing the quantity.\n(D) demand rises, increasing the price and increasing the quantity.", "output": "(D)"}
{"input": "Which of the following was not a landmark antitrust act?\n(A) The Wagner Act\n(B) The Sherman Act\n(C) The Clayton Act\n(D) The Robinson-Patman Act", "output": "(A)"}
{"input": "The market structures of perfect competition and monopolistic competition share which of the following characteristics?\n(A) Ease of entry and exit in the long run\n(B) Homogenous products\n(C) Perfectly elastic demand for the firm's product\n(D) Long-run positive profits", "output": "(A)"}
{"input": "The market demand curve for labor will shift to the right when\n(A) the number of firms increases\n(B) the price of output decreases\n(C) the labor supply curve shifts to the right\n(D) the labor supply curve shifts to the left", "output": "(A)"}
{"input": "If firms are entering an industry that is monopolistically competitive, we would expect\n(A) the demand for existing firms to shift rightward.\n(B) the market price of the product to increase.\n(C) the demand for existing firms to become more inelastic.\n(D) the demand for existing firms to shift leftward.", "output": "(D)"}
{"input": "Which of the following is NOT a characteristic of perfectly competitive industry?\n(A) Free entry into the industry.\n(B) Product differentiation.\n(C) Perfectly elastic demand curve.\n(D) Homogeneous products.", "output": "(B)"}
{"input": "When the opportunity for price discrimination arises,\n(A) market segments with relatively elastic demand pay higher prices\n(B) market segments with relatively inelastic demand pay lower prices\n(C) consumer surplus decreases\n(D) demand is horizontal", "output": "(C)"}
{"input": "Which of the following certainly lowers the equilibrium price of a good exchanged in a competitive market?\n(A) The demand curve shifts to the right.\n(B) The supply curve shifts to the left.\n(C) The demand curve shifts to the left, and the supply curve shifts to the right.\n(D) The demand curve shifts to the right, and the supply curve shifts to the left.", "output": "(C)"}
{"input": "The sales tax that you pay at the grocery store is commonly labeled a\n(A) progressive tax.\n(B) regressive tax.\n(C) proportional tax.\n(D) excise tax.", "output": "(B)"}
{"input": "Which of the following tax systems is designed to redistribute income from the wealthy to the poor?\n(A) A progressive tax system\n(B) A regressive tax system\n(C) A proportional tax system\n(D) An excise tax system", "output": "(A)"}
{"input": "Good X is exchanged in a competitive market. Which of the following is true if an excise tax is now imposed on the production of good X?\n(A) If the demand curve is perfectly elastic, the price rises by the amount of the tax.\n(B) The consumer's burden of the tax rises as the demand curve is more elastic.\n(C) Consumer surplus rises as a result of the tax.\n(D) The consumer's burden of the tax rises as the demand curve is less elastic.", "output": "(D)"}
{"input": "The relationship between the marginal revenue curve and the demand curve for a monopoly is most similar to the relationship between the marginal factor cost curve and what curve for a monopsony?\n(A) Labor demand\n(B) Labor supply\n(C) Marginal external cost\n(D) Total cost", "output": "(B)"}
{"input": "Which of the following is NOT a source of wage differentials?\n(A) Differences in human capital stock.\n(B) Racial or gender discrimination.\n(C) Immobility of workers.\n(D) Decrease in the birth rate.", "output": "(D)"}
