{"input": "Which of one of the following statements about the postnatal growth of the maxilla is correct?\n(A) Pneumatisation by enlargement of the developing maxillary sinus ceases at puberty\n(B) Space is created for the eruption of the permanent molars by resorption of the maxillary tuberosity\n(C) The zygomaticomaxillary sutures contribute to increase in height and length of the maxilla\n(D) The intermaxillary suture closes about eight years postnatally", "output": "(C)"}
{"input": "Blood flows from the right ventricle of the heart into which of the following structures?\n(A) Inferior vena cava\n(B) Left ventricle\n(C) Pulmonary arteries\n(D) Pulmonary veins", "output": "(C)"}
{"input": "Which orbital wall is most likely to collapse in a 'blow out' fracture?\n(A) The roof\n(B) The floor\n(C) The lateral wall\n(D) The medial wall", "output": "(B)"}
{"input": "Male hormones are produced by which of the following?\n(A) Glans penis\n(B) Prepuce\n(C) Prostate\n(D) Testes", "output": "(D)"}
{"input": "If you run your finger down the anterior midline of a patient's extended neck from chin to sternal notch, you should be able to palpate, in order, the\n(A) hyoid bone, cricoid cartilage, thyroid cartilage.\n(B) thyroid cartilage, cricoid cartilage, hyoid bone.\n(C) hyoid bone, thyroid cartilage, cricoid cartilage.\n(D) thyroid cartilage, hyoid bone, cricoids cartilage.", "output": "(C)"}
{"input": "Which of the following best describes the process whereby the stomach muscles contract to propel food through the digestive tract?\n(A) Absorption\n(B) Emulsion\n(C) Peristalsis\n(D) Regurgitation", "output": "(C)"}
{"input": "A possible effect of damage to the third cranial nerve by trauma to the orbit is\n(A) a convergent strabismus.\n(B) ptosis.\n(C) pupillary contriction.\n(D) bitemporal hemianopia.", "output": "(B)"}
{"input": "Which of the following cavities are separated by the diaphragm?\n(A) Abdominal and pelvic\n(B) Cranial and spinal\n(C) Thoracic and abdominal\n(D) Pericardial and pleural", "output": "(C)"}
{"input": "Fertilization of an ovum by a spermatozoon occurs in which of the following structures?\n(A) Cervix\n(B) Fallopian tube\n(C) Ovary\n(D) Uterus", "output": "(B)"}
{"input": "The spheno-occipital synchondrosis\n(A) is a secondary growth cartilage.\n(B) influences the position of the viscerocranium.\n(C) ceases activity at 7 years of age.\n(D) can be reactivated in patients affected by acromegaly.", "output": "(B)"}
{"input": "In relation to the rib, the corresponding intercostal nerve lies\n(A) deep to its superior border.\n(B) superficial to its superior border.\n(C) deep to its inferior border.\n(D) superficial to its inferior border.", "output": "(C)"}
{"input": "Cerebrospinal fluid circulates around the brain between the\n(A) skull and dura mater.\n(B) dura mater and arachnoid mater.\n(C) arachnoid and pia maters.\n(D) pia mater and brain surface.", "output": "(C)"}
{"input": "Which of the following is the master gland of the endocrine system?\n(A) Adrenal\n(B) Pancreas\n(C) Pineal\n(D) Pituitary", "output": "(D)"}
{"input": "Which of the following cranial nerves is related to the sense of smell?\n(A) Abducens\n(B) Hypoglossal\n(C) Olfactory\n(D) Trochlear", "output": "(C)"}
{"input": "A patient sustains severe blunt trauma to the left upper abdomen and requires surgery. Which one of the following organs is most likely to be involved?\n(A) Appendix\n(B) Gallbladder\n(C) Spleen\n(D) Urinary bladder", "output": "(C)"}
{"input": "Calcium, potassium, and sodium are classified as which of the following?\n(A) Androgens\n(B) Catecholamines\n(C) Electrolytes\n(D) Estrogens", "output": "(C)"}
{"input": "A patient cuts a peripheral motor nerve in their wrist when they fall through a plate glass window. If the nerve does not regenerate, after about 6 months the muscles it normally innervates will show signs of which of the four options below?\n(A) spastic paralysis\n(B) flaccid paralysis\n(C) atrophy\n(D) contracture", "output": "(C)"}
{"input": "At which of the following locations does bile enter the digestive tract?\n(A) Gastroesophageal sphincter\n(B) Duodenum\n(C) Ileocecum\n(D) Jejunum", "output": "(B)"}
{"input": "The anatomic location of the spinal canal is\n(A) caudal\n(B) dorsal\n(C) frontal\n(D) transverse", "output": "(B)"}
{"input": "Examination of a patient indicates that they have a medially directed strabismus (squint). This could be due to damage to the\n(A) oculomotor nerve.\n(B) trochlear nerve.\n(C) ophthalmic trigeminal nerve.\n(D) abducens nerve.", "output": "(D)"}
