{"input": "A large node of office and commercial land use outside the central city with more jobs than residents is a(n)\n(A) suburb.\n(B) primate city.\n(C) town.\n(D) edge city.", "output": "(D)"}
{"input": "Spanish colonial architecture, uneven economic development, and rural-to-urban migration flows are most commonly found in which of the following?\n(A) Southeast Asia\n(B) Sub-Saharan Africa\n(C) North America\n(D) Latin America", "output": "(D)"}
{"input": "Which group enacted the first effective settlement in the eastern United States?\n(A) French\n(B) British (English, Scotch-Irish, Welsh, Scottish)\n(C) Russian\n(D) Chinese", "output": "(B)"}
{"input": "Change in any culture is introduced through all the following processes EXCEPT\n(A) innovation.\n(B) diffusion.\n(C) acculturation.\n(D) gravity.", "output": "(D)"}
{"input": "National sports teams, flags, national anthems, and national holidays all promote\n(A) nationalism.\n(B) sectarianism.\n(C) political unrest.\n(D) functional disputes.", "output": "(A)"}
{"input": "Which one of the following statements best describes an application of the S-curve?\n(A) Graph of the Bantu migration\n(B) Graph of the growth of human populations since their first appearance on Earth\n(C) The chart showing how cities associate with one another based on their population sizes\n(D) A model showing the decrease in population growth for several countries after they industrialize", "output": "(D)"}
{"input": "The tendency for migration to decrease with distance is called\n(A) push factors.\n(B) pull factors.\n(C) distance decay.\n(D) migration selectivity.", "output": "(C)"}
{"input": "The majority of Kurds are found in which country?\n(A) Iran\n(B) Iraq\n(C) Turkey\n(D) Egypt", "output": "(C)"}
{"input": "The influence of neo-Malthusianism can be seen in\n(A) government programs for birth control and planning.\n(B) famine relief.\n(C) increased spending in social welfare programs.\n(D) increased total fertility rates.", "output": "(A)"}
{"input": "Which of the following statements does NOT describe a factor that contributed to suburbanization in the United States?\n(A) A shorter workweek made time for a commute possible.\n(B) Changes in the housing mortgage regulations made home ownership easier.\n(C) Fixed-route public transit routes increased in importance.\n(D) Improved automobiles made transportation easier and less limited.", "output": "(C)"}
{"input": "Which of the following is NOT a characteristic of a city in the developing world?\n(A) Contains modern centers of commerce\n(B) Has a well-developed infrastructure\n(C) Experiences large in-migrations of rural people into the city\n(D) Produces a large share of its country's GDI", "output": "(B)"}
{"input": "Which one of the following is NOT a centripetal force in a state?\n(A) A high level of confidence in central government\n(B) The existence of strong separatist groups\n(C) The existence of national transportation networks\n(D) The national anthem", "output": "(B)"}
{"input": "The Rhine River is an example of which type of boundary?\n(A) Geometric\n(B) Artificial\n(C) Natural\n(D) Relict", "output": "(C)"}
{"input": "In which of the following Asian countries would one find special economic zones (SEZs)?\n(A) Japan\n(B) South Korea\n(C) China\n(D) Vietnam", "output": "(C)"}
{"input": "What type of countries generally possesses a greater variety of climates and resources than other countries?\n(A) Perforated states\n(B) Fragmented states\n(C) Elongated states\n(D) Prorupt states", "output": "(C)"}
{"input": "Which one of the statements below is characteristic of most African cities?\n(A) They have thriving, clean residential areas.\n(B) There are jobs for most rural-to-urban migrants.\n(C) They have three separate business districts.\n(D) They have a well-developed infrastructure.", "output": "(C)"}
{"input": "Ralph purchases garden fertilizer at the nearby garden shop rather than drive 50 miles to the neighboring town for the same product. This reflects which type of spatial interaction?\n(A) Transferability\n(B) Complementarity\n(C) Intervening opportunity\n(D) Territoriality", "output": "(C)"}
{"input": "The theory that cities grow outward from a core utilizing several nodes of growth was proposed by\n(A) Rostow.\n(B) Ravenstein.\n(C) von Thünen.\n(D) Harris and Ullmann.", "output": "(D)"}
{"input": "If you wanted to find the global distribution of coal, you would use a\n(A) reference map.\n(B) topographic map.\n(C) thematic map.\n(D) location map.", "output": "(C)"}
{"input": "Which type of economic activity is most closely tied to the physical environment?\n(A) Primary\n(B) Secondary\n(C) Tertiary\n(D) Quaternary", "output": "(A)"}
