{"input": "Let f(x) be a function whose graph passes through the origin. If f(2n) = n^2 + f[2(n - 1)] for every integer n, what is the value of f(8)?\n(A) 24\n(B) 30\n(C) 32\n(D) 36", "output": "(B)"}
{"input": "Let x and y be positive integers such that 3x + 7y is divisible by 11. Which of the following must also be divisible by 11?\n(A) 4x + 6y\n(B) x + y + 5\n(C) 9x + 4y\n(D) 4x - 9y", "output": "(D)"}
{"input": "If A is the 2 by 2 matrix whose (i, j) entry is equal to i + j, and B is the 3 by 3 matrix whose (i, j) entry is equal to i + j, find the value of the sum detA + detB.\n(A) -2\n(B) -1\n(C) 0\n(D) 2", "output": "(B)"}
{"input": "The region bounded by the x-axis and the function f(x) = x/(1 + x^3) is rotated about the x-axis. What is the volume of the solid generated?\n(A) π/3\n(B) π/4\n(C) π\n(D) 2π", "output": "(A)"}
{"input": "For which value of n are there exactly two abelian groups of order n up to isomorphism?\n(A) 4\n(B) 7\n(C) 8\n(D) 12", "output": "(A)"}
{"input": "If f(z) is an analytic function that maps the entire finite complex plane into the real axis, then the imaginary axis must be mapped onto\n(A) the entire real axis\n(B) a point\n(C) a ray\n(D) an open finite interval", "output": "(B)"}
{"input": "Let K be a nonempty subset of R^n, where n > 1. Which of the following statements must be true?\nI. If K is compact, then every continuous real-valued function defined on K is bounded.\nII. If every continuous real-valued function defined on K is bounded, then K is compact.\nIII. If K is compact, then K is connected.\n(A) I only\n(B) II only\n(C) III only\n(D) I and II only", "output": "(D)"}
{"input": "Let x_1 = 1 and x_(n+1) = sqrt(3+2x_n) for all positive integers n. If it is assumed that {x_n} converges, then lim x_n =\n(A) 3\n(B) e\n(C) sqrt(5)\n(D) 0", "output": "(A)"}
{"input": "Which of the following is not always true for x, y, z ∈ R^k?\n(A) |x| ≥ 0\n(B) |x · y| ≤ |x||y|\n(C) |x| = 0 if and only if x = 0\n(D) |x + y| = |x| + |y|", "output": "(D)"}
{"input": "Suppose A is a 3 × 3 matrix such that det(A − λI) = −λ^3 + 3λ^2 + λ − 3, where I is the 3 × 3 identity matrix. Which of the following are TRUE of A?\nI. The trace of A is 3.\nII. The determinate of A is −3.\nIII. The matrix A has eigenvalues −3 and 1.\n(A) I only\n(B) II only\n(C) III only\n(D) I and II only", "output": "(D)"}
{"input": "Suppose X is a discrete random variable on the set of positive integers such that for each positive integer n, the probability that X = n is 1/2^n. If Y is a random variable with the same probability distribution and X and Y are independent, what is the probability that the value of at least one of the variables X and Y is greater than 3 ?\n(A) 1/64\n(B) 15/64\n(C) 1/4\n(D) 3/8", "output": "(B)"}
{"input": "Sofia and Tess will each randomly choose one of the 10 integers from 1 to 10. What is the probability that neither integer chosen will be the square of the other?\n(A) 0.64\n(B) 0.72\n(C) 0.81\n(D) 0.95", "output": "(D)"}
{"input": "Which of the following is true?\n(A) Every compact space is complete\n(B) Every complete space is compact\n(C) Neither (a) nor (b).\n(D)  Both (a) and (b).", "output": "(A)"}
{"input": "A large class is to be divided into teams and each student must be a member of exactly one team. However, each student dislikes three of their classmates. Dislike between students need not be mutual. If the teams do not need to be equally sized, how many must be created so that no student is the teammate of someone they dislike?\n(A) 4\n(B) 7\n(C) 10\n(D) 13", "output": "(B)"}
{"input": "If v is an eigenvector of an invertible matrix A, then which of the following is I are necessarily\ntrue?\nI. v is also an eigenvector of 2A.\nII. v is also an eigenvector of A^2.\nIII. v is also an eigenvector of A^(-1).\n(A) I only\n(B) II only\n(C) III only\n(D) I, II, and III", "output": "(D)"}
{"input": "(1+i)^10 =\n(A) 1\n(B) i\n(C) 32\n(D) 32i", "output": "(D)"}
{"input": "There are 25 suitcases, 5 of which are damaged. Three suitcases are selected at random. What is the probability that exactly 2 are damaged?\n(A) 2/69\n(B) 1/30\n(C) 2/23\n(D) 12/125", "output": "(C)"}
{"input": "The curves y = (sin x + cos x)^4 and y = (sin x - cos x)^4 intersect at x = 0. If a is the smallest positive value of x at which these curves next intersect, determine the area between these curves from x = 0 to x = a.\n(A) 2\n(B) π\n(C) 4\n(D) 3π/2", "output": "(C)"}
{"input": "Let V be the vector space, under the usual operations, of real polynomials that are of degree at most 3. Let W be the subspace of all polynomials p (x) in V such that p (0) = p(1) = p(-1) = 0. Then dim V + dim W is\n(A) 4\n(B) 5\n(C) 6\n(D) 7", "output": "(B)"}
{"input": "For which of the following rings is it possible for the product of two nonzero elements to be zero?\n(A) The ring of complex numbers\n(B) The ring of integers modulo 11\n(C) The ring of continuous real-valued functions on [0, 1]\n(D) The ring {a + b * sqrt(2) : a and b are rational numbers}", "output": "(C)"}
