{"input": "Which of the following is a frameshift mutation?\n(A) CAT HAS HIS → CAT HAS HIT\n(B) CAT HAS HIS → CAT HSH ISA\n(C) CAT HAS HIS → CAT HIS HAT\n(D) CAT HAS HIS → CAT WAS HIT", "output": "(B)"}
{"input": "The fluidity of the plasma membrane can vary in response to temperature changes. For bacteria and yeast cells, which of the following would be a viable strategy to maintain homeostasis of the plasma membrane in a temperature-varying environment?\n(A) Increase the concentration of solutes in the cytosol.\n(B) Change the ratio of phospholipids with double covalent bonds in their tails to those without double covalent bonds in their tails.\n(C) Replace phospholipids with glucose molecules.\n(D) Exchange phospholipids from one side of the plasma membrane to the other.", "output": "(B)"}
{"input": "ADH is a hormone secreted by the kidneys that reduces the amount of water excreted in the urine. ADH is released in times of dehydration. This is an example of\n(A) innate behavior.\n(B) maintaining homeostasis.\n(C) failure to respond to the environment.\n(D) positive feedback.", "output": "(B)"}
{"input": "The theory of evolution is most accurately described as\n(A) an educated guess about how species originate.\n(B) one possible explanation, among several scientific alternatives, about how species have come into existence.\n(C) an opinion that some scientists hold about how living things change over time.\n(D) an overarching explanation, supported by much evidence, for how populations change over time.", "output": "(D)"}
{"input": "A gas phase is generally absent from which of the following biogeochemical cycles?\n(A) Water\n(B) Carbon\n(C) Sulfur\n(D) Phosphorus", "output": "(D)"}
{"input": "Which of the events described below agrees with the idea of catastrophism?\n(A) The gradual uplift of the Himalayas by the collision of the Australian crustal plate with the Eurasian crustal plate\n(B) The formation of the Grand Canyon by the Colorado River over millions of years\n(C) The gradual deposition of sediments many kilometers thick on the floors of seas and oceans\n(D) The sudden demise of the dinosaurs, and various other groups, by the impact of a large extraterrestrial body with Earth", "output": "(D)"}
{"input": "A change in a neuron membrane potential from +50 millivolts to -70 millivolts is considered\n(A) depolarization\n(B) repolarization\n(C) hyperpolarization\n(D) an action potential", "output": "(B)"}
{"input": "You observe a species that gives birth to only one offspring at a time and has a relatively long life-span for its body size. Which of the following is probably also true of this organism?\n(A) It lives in a newly colonized habitat.\n(B) It is an aquatic organism.\n(C) It requires relatively high parental care of offspring.\n(D) The age at which the offspring themselves can give birth is relatively young.", "output": "(C)"}
{"input": "Which of the following statements about the immune system is NOT correct?\n(A) Innate immunity, also known as the adaptive immune response, relies on circulating phagocytes engulfing foreign substances.\n(B) Adaptive immunity is a slower response than innate immunity.\n(C) Innate immunity activates a humoral response.\n(D) Dendritic cells are antigen presenting cells.", "output": "(A)"}
{"input": "In modern terminology, diversity is understood to be a result of genetic variation. Sources of variation for evolution include all of the following except\n(A) mistakes in translation of structural genes.\n(B) mistakes in DNA replication.\n(C) translocations and mistakes in meiosis.\n(D) recombination at fertilization.", "output": "(A)"}
{"input": "Which is a true statement concerning genetic variation?\n(A) It is created by the direct action of natural selection.\n(B) It arises in response to changes in the environment.\n(C) It must be present in a population before natural selection can act upon the population.\n(D) It tends to be reduced by the processes involved when diploid organisms produce gametes.", "output": "(C)"}
{"input": "The higher the proportion of loci that are \"fixed\" in a population, the lower is that population's\n(A) nucleotide variability.\n(B) genetic polyploidy.\n(C) average heterozygosity.\n(D) A and C only", "output": "(D)"}
{"input": "Heterozygote advantage should be most closely linked to which of the following?\n(A) sexual selection\n(B) stabilizing selection\n(C) random selection\n(D) directional selection", "output": "(B)"}
{"input": "The sequence of amino acids in hemoglobin molecules of humans is more similar to the hemoglobin of chimpanzees than it is to the hemoglobin of dogs. This similarity suggests that\n(A) humans and dogs are more closely related than humans and chimpanzees\n(B) humans and chimpanzees are more closely related than humans and dogs\n(C) humans are related to chimpanzees but not to dogs\n(D) humans and chimpanzees are closely analogous", "output": "(B)"}
{"input": "In cells, which of the following can catalyze reactions involving hydrogen peroxide, provide cellular energy, and make proteins, in that order?\n(A) Peroxisomes, mitochondria, and ribosomes\n(B) Peroxisomes, mitochondria, and lysosomes\n(C) Peroxisomes, mitochondria, and Golgi apparatus\n(D) Lysosomes, chloroplasts, and ribosomes", "output": "(A)"}
{"input": "The development of an egg without fertilization is known as\n(A) meiosis\n(B) parthenogenesis\n(C) embryogenesis\n(D) vegetative propagation", "output": "(B)"}
{"input": "All of the following are modes of asexual reproduction EXCEPT\n(A) sporulation\n(B) fission\n(C) budding\n(D) meiosis", "output": "(D)"}
{"input": "Each of the following has a better chance of influencing gene frequencies in small populations than in large populations, but which one most consistently requires a small population as a precondition for its occurrence?\n(A) Mutation\n(B) Non-random mating\n(C) Genetic drift\n(D) Natural selection", "output": "(C)"}
{"input": "Refer to question 15 for details on the squirrel population. Which of the following conditions is required to keep this population in Hardy-Weinberg equilibrium?\n(A) Random mating\n(B) Genetic drift\n(C) Mutation\n(D) Gene flow", "output": "(A)"}
{"input": "All of the following statements are true EXCEPT\n(A) thyroxine increases the rate of metabolism\n(B) insulin decreases storage of glycogen\n(C) vasopressin stimulates water reabsorption in the kidney\n(D) epinephrine increases blood sugar levels and heart rate", "output": "(B)"}
