{"input": "Which situation could be represented by the expression 6 x 2?\n(A) Rocco hiked six miles each day for two days.\n(B) Rocco had six baseballs and gave away two of them.\n(C) Rocco had a total of six tennis balls in two cans.\n(D) Rocco biked six miles and then continued for two more miles.", "output": "(A)"}
{"input": "Two whole numbers have a least common multiple of 60. Each number is less than or equal to 12. The greatest common factor of the two numbersis 2. What are the two numbers?\n(A) 6 and 10\n(B) 5 and 12\n(C) 10 and 12\n(D) 12 and 15", "output": "(C)"}
{"input": "Which ratio can form a proportion with 3 over 8?\n(A) 18 over 40\n(B) 18 over 56\n(C) 24 over 64\n(D) 15 over 48", "output": "(C)"}
{"input": "Which ratio CANNOT form a proportion with 8 over 18?\n(A) 46 over 108\n(B) 12 over 27\n(C) 60 over 135\n(D) 4 over 9", "output": "(A)"}
{"input": "Kerri ran the same distance in four different races. Her times were 18.04 seconds, 21.39 seconds, 12.99 seconds, and 14.14 seconds. If the individual times are rounded to the nearest one-tenth of a second, what is the estimate of Kerri's total time for all four races?\n(A) 66.6 seconds\n(B) 66.5 seconds\n(C) 66 seconds\n(D) 65.5 seconds", "output": "(B)"}
{"input": "Find the quotient of −40 ÷ (−8).\n(A) 1 over 5\n(B) −5\n(C) −1 over 5\n(D) 5", "output": "(D)"}
{"input": "Ms. Fisher used the expression (6 × 8) × 12 to find the total number of markers needed for her students’ art project. Which expression is equal to the one used by Ms. Fisher?\n(A) 6 + (8 + 12)\n(B) 6 + (8 × 12)\n(C) 6 × (8 + 12)\n(D) 6 × (8 × 12)", "output": "(D)"}
{"input": "Umi created the number pattern that follows by adding the same amount each time to get the next number. 20, 40, 60, 80, ... What will be the eighth number in the pattern?\n(A) 160\n(B) 240\n(C) 320\n(D) 640", "output": "(A)"}
{"input": "You walked your dog 7 over 9 mi in the morning and 5 over 12 mi in the afternoon. How much farther did you walk your dog in the morning than in the afternoon?\n(A) 13 over 36\n(B) 12 over 21\n(C) 2 over 3\n(D) 35 over 108", "output": "(A)"}
{"input": "Compute 52 + 6 * 2.\n(A) 116\n(B) 64\n(C) 62\n(D) 118", "output": "(B)"}
{"input": "Last year Carl baked a total of 18 pies. He baked 6 pies for his family and p pies for each of the 4 school fund-raisers. Which number sentence can be used to find the number of pies, p, Carl baked for each of the school fund-raisers?\n(A) 6 × p – 18 = 4\n(B) 18 – 6 × p = 4\n(C) 4+6 × p = 18\n(D) 6+4 × p = 18", "output": "(D)"}
{"input": "Find the median of the set of data 13, 35, 26, 8, 24, 10, 22, 10, 32.\n(A) 23\n(B) 20\n(C) 22\n(D) 27", "output": "(C)"}
{"input": "A team of volunteers collected a total of $5,144 selling T-shirts at a charity concert. Each T-shirt was sold for $8. What was the total number of T-shirts the volunteers sold?\n(A) 632\n(B) 643\n(C) 655\n(D) 668", "output": "(B)"}
{"input": "Cat food costs $.47/lb. How much does a 6-lb bag cost?\n(A) $2.82 \n(B) $2.97 \n(C) $6.47 \n(D) $12.77 ", "output": "(A)"}
{"input": "A shelf has four books on it. The weight, in pounds, of each of the four books on the shelf is 2.5, 3.2, 2.7, 2.3 Which inequality represents the weight, w, of any book chosen from the shelf?\n(A) w > 2.3\n(B) w < 2.4\n(C) w > 3.2\n(D) w < 3.3", "output": "(D)"}
{"input": "John has 4 cookies. Sara has 2 more cookies than John. Darius has 3 times as many cookies as Sara. How many cookies does Darius have?\n(A) 9\n(B) 14\n(C) 18\n(D) 24", "output": "(C)"}
{"input": "Which expression is equivalent to 5(4x + 3) — 2x?\n(A) 18x+15\n(B) 18x+3\n(C) 7x+8\n(D) 2x+8", "output": "(A)"}
{"input": "A zoo has 15 toucans and 60 parrots. What is the ratio of the number of toucans to the number of parrots at the zoo?\n(A) 1:04\n(B) 1:05\n(C) 4:01\n(D) 4:05", "output": "(A)"}
{"input": "Jess scored 18 points during her last basketball game. Each basket she made was worth 2 points. How many baskets did she make?\n(A) 20\n(B) 16\n(C) 9\n(D) 8", "output": "(C)"}
{"input": "Maddie will ride her bike a total of 56 miles over 7 days. She will ride the same number of miles each day. What is the total number of miles Maddie will ride each day?\n(A) 8\n(B) 9\n(C) 49\n(D) 63", "output": "(A)"}
