{"input": "The following types of research findings provide strong evidence for an association between diet and skeletal health:\n\n(A) Long-term intervention studies that have a large sample size with fracture as an endpoint\n(B) Experimental studies which measure bone remodelling through biochemical markers\n(C) Experimental studies which have a one-off measure of bone mineral density and bone mineral content\n(D) Case reports from individual patients", "output": "(A)"}
{"input": "Facial flushing is seen in approximately 50% of East Asians and is thought to be due to a deficiency of?\n\n(A) ALDH1\n(B) ALDH2\n(C) ALDH3\n(D) ALDH4", "output": "(B)"}
{"input": "Which one of the following is a definition of glycaemic index?\n\n(A) The increase in blood glucose concentration after consuming the food.\n(B) The increase in blood glucose concentration after consuming the food compared with that after consuming an equivalent amount of white bread.\n(C) The increase in blood insulin concentration after consuming the food.\n(D) The increase in blood insulin concentration after consuming the food compared with that after consuming an equivalent amount of white bread.", "output": "(B)"}
{"input": "Which of these factors increases the risk for cancer of the stomach?\n\n(A) Obesity\n(B) Sugar\n(C) Salt and salt-preserved foods\n(D) Dietary fibre", "output": "(C)"}
{"input": "What are histones?\n\n(A) Lipids\n(B) Carbohydrates\n(C) Nucleotides\n(D) Proteins", "output": "(D)"}
{"input": "When epidemiologists judge the evidence to establish possible causes of a health outcome, they consider\n\n(A) The estimated strength of the association between an exposure and the outcome.\n(B) Evidence that the exposure of interest has appeared before the outcome.\n(C) Evidence showing that reductions in the exposure level will reverse the risk of the outcome.\n(D) All of the options given.", "output": "(D)"}
{"input": "The two most common causes of foodborne illness in the United States and Europe are:\n\n(A) Salmonella and Campylobacter\n(B) Listeria and Salmonella\n(C) Shigella and Staphlococcus\n(D) E. coli STECs and non-STEC subtypes", "output": "(A)"}
{"input": "The daily amount of protein oxidized in the body of a person spending 24 hours in a respiratory chamber can be determined from his/her:\n\n(A) O2 consumption alone\n(B) CO2 production alone\n(C) Breath collection\n(D) Total urinary nitrogen excretion alone", "output": "(D)"}
{"input": "More and more detrimental effects of malnutrition during childhood and adult life have been identified. The effects of over nutrition e.g. overweight and obesity are less well known. Overweight and obesity are associated with which of the following\n\n(A) Cardiovascular disease\n(B) Breast cancer\n(C) Type 2 diabetes (maturity onset)\n(D) all of the options given are correct", "output": "(D)"}
{"input": "What are focus areas of nutritional epidemiology?\n\n(A) The role of nutritional factors in causing disease in a population.\n(B) How changes in food intake in the population can promote good health.\n(C) Both of the options given are correct.\n(D) None of the options given is correct.", "output": "(C)"}
{"input": "Which of the following statements about the protein requirement is correct\n\n(A) The protein requirement is equal to the demand multiplied by the efficiency of utilization.\n(B) The protein requirement is equal to the demand divided by the efficiency of utilization.\n(C) The protein requirement can be less than the demand.\n(D) The protein requirement is always the same as the demand.", "output": "(B)"}
{"input": "Which of the following vitamins is required for fatty acid b-oxidation?\n\n(A) Niacin\n(B) Riboflavin\n(C) Thiamin\n(D) Vitamin C", "output": "(B)"}
{"input": "Eosinophilic oesophagitis\n\n(A) Leads to oesophageal diverticular\n(B) May cause oesopgageal obstruction\n(C) Is not due to allergy\n(D) Benefits from antacid therapy", "output": "(B)"}
{"input": "How is iron transported in the circulation from the intestine to the sites of metabolism in the body?\n\n(A) As simple Fe2+ in the serum\n(B) Bound to albumin\n(C) Bound to ferritin\n(D) Bound to transferrin", "output": "(D)"}
{"input": "Alcohol is a major risk factor for cancer development. Which alcohol metabolite plays a prominent role in cancer development?\n\n(A) fatty acid ethyl esters (FAEE)\n(B) acetate\n(C) acetaldehyde\n(D) alcohol", "output": "(C)"}
{"input": "The body mass index (BMI) of vegetarians differs on average from meat-eaters by how much?\n\n(A) 3 units of BMI\n(B) 0.5 units of BMI\n(C) 1 unit of BMI\n(D) 2 units of BMI", "output": "(C)"}
{"input": "Severe acute malnutrition in young children is defined as:\n\n(A) Weight-for-age Z score <-3\n(B) Height-for-age Z score <-3 and oedema\n(C) Height-for-age Z score <-3 or weight-for-height Z score <-3 or oedema\n(D) Height-for-age Z score <-3 or weight-for-age Z score <-3 or oedema", "output": "(C)"}
{"input": "Which of the following has not at one point in the past few decades been considered as a cause of the oedema of kwashiorkor?\n\n(A) Altered composition of intestinal bacteria\n(B) Low intake of antioxidant nutrients\n(C) Sudden weaning from the breast\n(D) Iron deficiency", "output": "(D)"}
{"input": "In an epidemiological context, what is the population at risk?\n\n(A) The proportion of a population that engage in risky behaviours.\n(B) The group of people that may experience the outcome we want to study.\n(C) A group of people participating in a study that may be harmful to them.\n(D) The population group with the highest relative risk of disease.", "output": "(B)"}
{"input": "Which vitamin is a major lipid-soluble antioxidant in cell membranes?\n\n(A) Vitamin A\n(B) Vitamin D\n(C) Vitamin E\n(D) Vitamin K", "output": "(C)"}
