{"input": "Experimental studies of the relation between level of motivation and level of performance have shown that\n(A) the higher the intensity or degree of motivation, the better the level of performance\n(B) for a given task, there is an optimal level of motivation\n(C) motivation is important to learning but not to performance\n(D) optimal performance is obtained relatively more often by internalizers than by externalizers", "output": "(B)"}
{"input": "According to the DSM-5, patients who meet some but not all of the criteria for a particular diagnosis can still be assigned that diagnosis. This reflects the fact that:\n(A) The DSM-5 relies on a dimensional rather than a categorical approach to diagnosis\n(B) The DSM-5 relies on a categorical rather than a dimensional approach to diagnosis\n(C) The DSM-5 integrates aspects of categorical and dimensional diagnosis\n(D) The DSM-5’s approach to diagnostic classification is not valid", "output": "(C)"}
{"input": "The main reason addictive behaviors are so difficult to treat is that they\n(A) involve intermittent reinforcement\n(B) are physiologically complex\n(C) provide variable ratio reinforcement\n(D) are self-reinforcing", "output": "(D)"}
{"input": "An organizational psychologist finds that his newly developed selection test has different validity coefficients for male and female applicants and that the difference is statistically significant. This suggests that the test has:\n(A) incremental validity.\n(B) discriminant validity.\n(C) differential validity.\n(D) convergent validity.", "output": "(C)"}
{"input": "\"An organizational psychologist has been hired by a manufacturing company to develop a selection battery that will help the company answer the following question: \"\"What group (assembly-line workers or clerical workers) does the job applicant most closely resemble?\"\" Which of the following multivariate techniques would be useful for this purpose?\"\n(A) discriminant analysis\n(B) multiple regression\n(C) factor analysis\n(D) path analysis", "output": "(A)"}
