{"input": "Carol and Jim are experiencing marital difficulties. They have two school-aged children, a boy and a gid. According to meta-analysis of research on the relationship between marital discord and child behavior problems, it would be expected that\n(A) neither child is more likely to manifest an immediate behavior problem than are children of stable marriages\n(B) the girl is more likely than the boy to manifest an immediate behavior problem\n(C) the boy is more likely than the girl to manifest an immediate behavior problem\n(D) both children ore equally likely to manifest an immediate behavior problem", "output": "(C)"}
{"input": "An individual’s genotype is ___________.\n(A) The 23 pairs of chromosomes one inherits from one’s parents\n(B) One’s environmental context\n(C) One’s observable appearance and characteristics\n(D) One’s physical attributes", "output": "(A)"}
{"input": "Vicarious liability is most likely to be an issue when a psychologist is acting in which of the following capacities?\n(A) faculty member\n(B) supervisor\n(C) mentor\n(D) therapist", "output": "(B)"}
{"input": "Three types of prevention have been identified in community mental health. Secondary prevention attempts to\n(A) deal with problems before they occur\n(B) prevent relapses of problems\n(C) reduce the severity of problems\n(D) prevent community disintegration", "output": "(C)"}
{"input": "Providing education and job training to adolescents and young adults who have recently been released from a drug treatment program is an example of:\n(A) primary prevention.\n(B) secondary prevention.\n(C) tertiary prevention.\n(D) social intervention.", "output": "(C)"}
{"input": "A 15-year-old consistency engaging in unprotected sexual intercourse and denying the possibility of pregnancy and/or contracting sexually transmitted diseases is an example of\n(A) formal operational thought\n(B) adolescent egocentrism\n(C) early sociocentrism\n(D) identity foreclosure", "output": "(B)"}
{"input": "A child with an insecure/anxious-avoidant pattern of attachment:\n(A) is very distressed when separated from his/her mother and continues to be highly anxious when she returns.\n(B) is more anxious when his/her mother is present than absent and resists contact with her when she returns following separation.\n(C) is very distressed when separated from his/her mother but pulls away from her when she returns.\n(D) shows little distress when separated from his/her mother and turns away from her when she returns.", "output": "(D)"}
{"input": "A person in the pseudoindependent stage of White racial identity is currently ___________.\n(A) Developing an awareness of the role of Whites in perpetrating racism\n(B) Unaware of race and racism\n(C) Exploring what it means to be White and confronting own biases\n(D) Attempting to resolve moral dilemmas associated with an awareness of race and racism", "output": "(A)"}
{"input": "An employee is receiving counseling from a psychologist through his company's employee assistance program. In this situation, the psychologist can let the employee's supervisor know that the employee is receiving treatment:\n(A) under no circumstance.\n(B) only if the employee was referred to the program by the supervisor.\n(C) only if the supervisor has signed a waiver.\n(D) as long as no other information about the treatment is given to the supervisor.", "output": "(B)"}
{"input": "When performing a(n) ________ task, group members select a solution offered by one of the group members as the group’s solution.\n(A) compensatory\n(B) disjunctive\n(C) conjunctive\n(D) additive", "output": "(B)"}
{"input": "You regularly waive the co-payment for your low-income clients who are covered by insurance and believe this is acceptable since you normally bill your clients on a sliding fee scale. This is:\n(A) a common and ethical practice.\n(B) ethical as long as you don't bill the insurance company for an increased hourly fee in order to collect your full fee.\n(C) ethical as long as the insurance company does not explicitly prohibit such arrangements.\n(D) ethical only if the insurance company is aware of the arrangement.", "output": "(D)"}
{"input": "Prochaska and DiClemente’s (1982) stages of change (transtheoretical) model predicts that a person in the ________ stage plans to take action within the next six months that will alter his/her problematic behavior.\n(A) action\n(B) contemplation\n(C) preparation\n(D) precontemplation", "output": "(B)"}
{"input": "A student who is chronically depressed is most likely to attribute the low score she received on her final exam to:\n(A) her lack of ability.\n(B) the lack of time she had to study.\n(C) the difficulty of some exam items.\n(D) the instructor's ineptitude.", "output": "(A)"}
{"input": "Which of the following assessment measures is not used to assess symptom validity or malingering?\n(A) Test of Memory Malingering\n(B) The Differential Aptitude Test–5\n(C) Recognition Memory Test\n(D) Personality Assessment Inventory", "output": "(B)"}
{"input": "Unlike play activities for adults, play activities for children\n(A) serve to relieve stress\n(B) are more structured\n(C) serve mostly for entertainment\n(D) aid in mastering the environment", "output": "(D)"}
{"input": "In general, it can be said that job satisfaction\n(A) is not highly correlated with job performance\n(B) seems to increase considerably with an increase in wages\n(C) is higher in groups that do not have to assume responsibility\n(D) tends to decrease steadily as tenure on a job increases", "output": "(A)"}
{"input": "In terms of training program evaluation, Kirkpatrick (1976) contends that _______ criteria are the most important criteria to evaluate but are often the most difficult to develop and, therefore, the most infrequently used.\n(A) learning\n(B) behavioral\n(C) reaction\n(D) results", "output": "(D)"}
{"input": "The major difference between job enrichment and job enlargements thar job enrichment\n(A) provides management with tighter control of work activities\n(B) appeals mostly to workers in mass-production-type jobs\n(C) gives workers quasi-managerial tasks to perform\n(D) lengthens the work cycle", "output": "(C)"}
{"input": "A psychologist who already has an established therapeutic relationship with a child is asked to act as an expert witness in a divorce proceeding involving custody of the child. The psychologist's best course of action would be to:\n(A) decline the request to testify.\n(B) agree to testify only if she obtains consent from both parents.\n(C) agree to testify only if she can evaluate all of the involved parties.\n(D) agree to testify only if her familiarity with the child won''t bias her testimony.", "output": "(A)"}
{"input": "Teddy Roosevelt was weak and ill as a child but grew up to be a robust adult and coined the term “rugged individualism.” He also became associated with the slogan “speak softly but carry a big stick.” This outcome is predicted by _________ theory of personality.\n(A) Adler’s\n(B) Rogers’s\n(C) Perls’s\n(D) Jung’s", "output": "(A)"}
