{"input": "This question refers to the following information.\n\"The economic ills we suffer have come upon us over several decades. They will not go away in days, weeks, or months, but they will go away. They will go away because we as Americans have the capacity now, as we've had in the past, to do whatever needs to be done to preserve this last and greatest bastion of freedom. In this present crisis, government is not the solution to our problem; government is the problem. . . .\n\"It is my intention to curb the size and influence of the Federal establishment and to demand recognition of the distinction between the powers granted to the Federal Government and those reserved to the States or to the people. All of us need to be reminded that the Federal Government did not create the States; the States created the Federal Government.\"\n—Ronald Reagan, First Inaugural Address, January 21, 1981\nOne way in which President Reagan acted on his rhetoric in the passage was to\n(A) increase the military budget.\n(B) work with Congress to cut taxes and government spending.\n(C) eliminate the Department of Housing and Urban Development.\n(D) prohibit pay increases for government workers.", "output": "(B)"}
{"input": "This question refers to the following information.\n\"I know that whenever the subject has occurred in conversation where I have been present, it has appeared to be the opinion of every one that we could not be taxed by a Parliament wherein we were not represented. But the payment of duties laid by an act of Parliament as regulations of commerce was never disputed. . . . An external tax is a duty laid on commodities imported; that duty is added to the first cost and other charges on the commodity, and, when it is offered for sale, makes a part of the price. If the people do not like it at that price, they refuse it; they are not obliged to pay it. But an internal tax is forced from the people without their consent if not laid by their own representatives. The Stamp Act says we shall have no commerce, make no exchange of property with each other, neither purchase nor grant, nor recover debts; we shall neither marry nor make our wills, unless we pay such and such sums; and thus it is intended to extort our money from us or ruin us by the consequence of refusing to pay it.\"\n—Benjamin Franklin, Examination before Parliament, 1766\nWhich author was most critical of the policy being described here by President Jackson?\n(A) Rachel Carson in Silent Spring.\n(B) Ralph Ellison in Invisible Man.\n(C) Helen Hunt Jackson in A Century of Dishonor.\n(D) William Lloyd Garrison in The Liberator.", "output": "(C)"}
{"input": "This question refers to the following information.\n\"Is there no danger to our liberty and independence in a bank that in its nature has so little to bind it to our country? The president of the bank has told us that most of the State banks exist by its forbearance. Should its influence become concentrated, as it may under the operation of such an act as this, in the hands of a self-elected directory whose interests are identified with those of the foreign stockholders, will there not be cause to tremble for the purity of our elections in peace and for the independence of our country in war? Their power would be great whenever they might choose to exert it; but if this monopoly were regularly renewed every fifteen or twenty years on terms proposed by themselves, they might seldom in peace put forth their strength to influence elections or control the affairs of the nation. But if any private citizen or public functionary should interpose to curtail its powers or prevent a renewal of its privileges, it cannot be doubted that he would be made to feel its influence.\"\nPresident Andrew Jackson, Veto of the Bank of the United States, 1832\nThe debate over the First Bank of the United States was significant because it raised the issue of\n(A) whether the new government should issue paper currency\n(B) how strictly the Constitution should be interpreted\n(C) whether the United States should pay back its war debt to France\n(D) whether the president had the power to act unilaterally on important economic issues", "output": "(B)"}
{"input": "This question refers to the following information.\nOn Being Brought from Africa to America\n'Twas mercy brought me from my Pagan land,\nTaught my benighted soul to understand\nThat there's a God, that there's a Saviour too;\nOnce I redemption neither sought nor knew.\nSome view our sable race with scornful eye,\n\"Their colour is a diabolic die.\"\nRemember, Christians, Negroes, black as Cain,\nMay be refin'd, and join th' angelic train.\n—Phillis Wheatley, Poems on Various Subjects, Religious and Moral, 1773\nThe literary success of Phillis Wheatley led most directly to questions about which of the following?\n(A) The granting of political rights to women\n(B) The harsh treatment of pro-British Loyalists\n(C) The moral justification of slavery\n(D) The legitimacy of established churches in the states", "output": "(C)"}
{"input": "This question refers to the following information.\n\"Is there no danger to our liberty and independence in a bank that in its nature has so little to bind it to our country? The president of the bank has told us that most of the State banks exist by its forbearance. Should its influence become concentrated, as it may under the operation of such an act as this, in the hands of a self-elected directory whose interests are identified with those of the foreign stockholders, will there not be cause to tremble for the purity of our elections in peace and for the independence of our country in war? Their power would be great whenever they might choose to exert it; but if this monopoly were regularly renewed every fifteen or twenty years on terms proposed by themselves, they might seldom in peace put forth their strength to influence elections or control the affairs of the nation. But if any private citizen or public functionary should interpose to curtail its powers or prevent a renewal of its privileges, it cannot be doubted that he would be made to feel its influence.\"\nPresident Andrew Jackson, Veto of the Bank of the United States, 1832\nIn the excerpt above, which quote best explains why Jackson chose to veto the re-charter of the Second Bank?\n(A) but if any private citizen\n(B) the president of the bank\n(C) this monopoly\n(D) interests are identified with those of foreign stockholders", "output": "(D)"}
