{"input": "A 25-year-old man with Down syndrome and mild mental retardation is brought to the office by his parents. He is their only child, and they are concerned that his current lifestyle is increasing his risk for coronary artery disease and stroke. The patient has a systolic murmur and also underwent surgical repair of an atrial septal defect at 1 year of age. He has smoked one pack of cigarettes daily for 5 years. He lives in a group home and works about 25 hours each week in a fast-food restaurant. He has a few friends and is romantically involved with a woman from his church group. The patient is 157 cm (5 ft 2 in) tall and weighs 91 kg (200 lb); BMI is 36 kg/m2 . Vital signs are normal. A grade 2/6 systolic murmur is heard best at the apex. The parents would like him to stop smoking and follow a healthier diet, and they feel the only way to monitor and control his behavior is for him to move back into their home. They request your assistance in obtaining legal guardianship of their son. Which of the following is the most appropriate initial recommendation?\n(A) Advise the parents not to influence their son's decision in this matter\n(B) Arrange for evaluation of their son's competency\n(C) Enroll their son in a smoking cessation program\n(D) Initiate a family meeting to discuss the parents' concerns with their son", "output": "(D)"}
{"input": "A 24-year-old woman comes to the office for a routine health maintenance examination. She has been generally healthy for the past year. She is 155 cm (5 ft 1 in) tall and weighs 68 kg (150 lb); BMI is 28 kg/m2 . Vital signs are temperature 37.0°C (98.6°F), pulse 60/min, respirations 18/min, and blood pressure 118/54 mm Hg. Physical examination shows several small (<1 cm), smooth, slightly irregular, mobile, mildly tender lymph nodes palpable in her left groin just below the inguinal ligament. The most likely source of this lymphadenopathy will be found in which of the following?\n(A) Bone marrow\n(B) Lateral thigh\n(C) Lower abdomen\n(D) Vulva", "output": "(D)"}
{"input": "A 14-year-old girl with a 9-year history of type 1 diabetes mellitus is brought to the physician by her mother for a follow-up examination. She has been admitted to the hospital twice in the past 3 months because of diabetic ketoacidosis. She previously had been compliant with monitoring her blood glucose concentration and with her diet and insulin regimen. She acknowledges that, when she is with her peers, she eats whatever she wants and does not check her blood glucose concentration. She adds, \"I'm embarrassed to inject myself in front of them.\" The physician is having a great deal of difficulty with her 15-year-old son who has been truant from school and sneaking out of the house. She says to the patient, \"You should be ashamed for not taking care of yourself. We've all worked so hard to keep you healthy.\" Which of the following terms best describes the physician's reaction to the patient?\n(A) Countertransference\n(B) Identification with the aggressor\n(C) Projection\n(D) Splitting", "output": "(A)"}
{"input": "A 72-year-old woman comes to the physician because of a 3-day history of fever, shortness of breath, difficulty swallowing, chest pain, and cough. She is frail. Physical examination shows tachypnea and equal pulses bilaterally. Percussion of the chest shows dullness over the right lower lung field. Laboratory studies show arterial hypoxemia and decreased PCO2. A chest x-ray shows an area of opacification in the lower region of the right lung. Which of the following is the most likely cause of this patient's condition?\n(A) Alveolar proteinosis\n(B) Aspiration\n(C) Cigarette smoking\n(D) Emphysema", "output": "(B)"}
{"input": "A 19-year-old woman noticed a mass in her left breast 2 weeks ago while doing monthly breast self-examination. Her mother died of metastatic breast cancer at the age of 40 years. Examination shows large dense breasts; a 2-cm, firm, mobile mass is palpated in the upper outer quadrant of the left breast. There are no changes in the skin or nipple, and there is no palpable axillary adenopathy. Which of the following is the most likely diagnosis?\n(A) Fibroadenoma\n(B) Fibrocystic changes of the breast\n(C) Infiltrating ductal carcinoma\n(D) Intraductal papilloma", "output": "(A)"}
