{"input": "You are visiting an 86-year-old woman in her home at the request of the patient's daughter because of worsening shortness of breath at rest for the past 2 days. The patient is confined to her home because of severe chronic obstructive pulmonary disease with cor pulmonale. She was discharged 1 week ago from the hospital following 3 weeks of treatment for pneumonia that required intubation; her hospital stay was complicated by sepsis. She had a prolonged weaning program from intubation. Prior to discharge, the patient and her daughter met with you to review the patient's advance directive. During the discussion, the patient said, \"I'd rather die than be intubated again.\" At that time, both the patient and her daughter signed an addendum to that effect on the patient's advance directive. Today, the patient is dyspneic and is unable to complete a sentence. Vital signs are temperature 37.8°C (100.0°F), pulse 88/min, respirations 35/min, and blood pressure 100/70 mm Hg. Pulse oximetry shows an oxygen saturation of 84% while the patient is breathing 4 L of oxygen. You ask the patient if she wishes to return to the hospital. She says, \"No, I want to die at home.\" Her daughter takes you aside and says, \"My mother doesn't know what she's saying. I insist that she be admitted to the hospital.\" After further discussion with the daughter regarding support available at home, which of the following is the most appropriate step?\n(A) Admit the patient to the hospital\n(B) Arrange for consultation with a home hospice team\n(C) Consult with the hospital ethics committee\n(D) Order a home continuous positive airway pressure machine and instruct the daughter in its use", "output": "(B)"}
{"input": "Over 1 year, a study is conducted to assess the antileukemic activity of a new tyrosine kinase inhibitor in patients with chronic myeloid leukemia in blast crisis. All patients enrolled in the study are informed that they would be treated with the tyrosine kinase inhibitor. They are assigned to successive dose cohorts of 300 to 1000 mg/day of the drug. Six to eight patients are assigned to each dose. Treatment efficacy is determined based on the results of complete blood counts and bone marrow assessments conducted regularly throughout the study. This study is best described as which of the following?\n(A) Case-control study\n(B) Crossover study\n(C) Open-labeled clinical trial\n(D) Randomized clinical trial", "output": "(C)"}
{"input": "A 40-year-old man comes to the office for a preemployment physical examination. The patient has been generally healthy. Medical history is unremarkable and he takes no routine medications. Vital signs are normal. Physical examination shows a palpable nodule in the right lobe of the thyroid gland. Serum thyroid-stimulating hormone concentration is within the reference range. Ultrasonography of the thyroid gland confirms a solid, 1-cm nodule. Which of the following is the most appropriate next step in evaluation?\n(A) CT scan of the neck\n(B) Fine-needle aspiration of the nodule\n(C) Radionuclide thyroid scan\n(D) Thyroidectomy", "output": "(B)"}
{"input": "A 29-year-old male presents to the office with the complaints of a pounding heart, poor sleep, and a generalized feeling of restlessness. He relocated 2 months ago to take a promotion and has found himself unable to concentrate on his new duties. He worries about his ability to adapt to his increase in responsibility at work and states that he has called in sick 3 days within the past 2 weeks. The most likely diagnosis is\n(A) adjustment disorder with anxious mood\n(B) generalized anxiety disorder\n(C) major depressive disorder, single episode, moderate\n(D) obsessive-compulsive personality disorder", "output": "(A)"}
{"input": "A 19-year-old woman who is a regular patient comes to the office for her annual physical examination and cervical cytology. She tells you that she has not had a menstrual period for the past 6 months. She is a college student who is in good health, has not had any medical illnesses or surgery, and has never been pregnant. She is currently sexually active and uses barrier contraception. She reports that during the past year her menses had become very irregular prior to complete cessation 6 months ago. She also notes that she has gained about 9 kg (20 lb) in the past 6 months and has had an increasing problem with acne and a troublesome growth of hair on her thighs and abdomen. She has been somewhat depressed about this, and her grades have declined. She reports that one of her sisters also had this problem prior to getting married. Physical examination shows a mildly obese young woman who has scattered facial acne, mild male pattern hair growth on the abdomen, and an essentially normal pelvic examination except for slight enlargement of the uterus and both ovaries. This patient's history is most consistent with which of the following?\n(A) Androgen-producing ovarian tumor\n(B) Cushing syndrome\n(C) Hypothyroidism\n(D) Polycystic ovarian syndrome", "output": "(D)"}
{"input": "A 52-year-old woman comes to the emergency department because of a 1-week history of low-grade fever and increasing abdominal cramps that are exacerbated by bowel movements. She began a course of amoxicillin-clavulanate and metronidazole 2 days ago but has had no relief of her symptoms. She has had intermittent constipation for the past 12 years. She has not had nausea, vomiting, urinary symptoms, or bloody stools. She has a 3-year history of hypertension. She underwent total abdominal hysterectomy and bilateral salpingo-oophorectomy 5 years ago because of leiomyomata uteri. She is 165 cm (5 ft 5 in) tall and weighs 86 kg (190 lb); BMI is 32 kg/m2 . Her temperature is 38.1°C (100.6°F), pulse is 75/min, and blood pressure is 150/80 mm Hg. The lungs are clear to auscultation. Cardiac examination shows no abnormalities. The abdomen is soft, and there is tenderness to palpation of the left lower quadrant with guarding but no rebound. Bowel sounds are normal. The stool is brown, and test for occult blood is negative. Her hemoglobin concentration is 14.5 g/dL, leukocyte count is 15,000/mm3 , and platelet count is 280,000/mm3 ; serum studies and urinalysis show no abnormalities. Which of the following is the most appropriate next step in diagnosis?\n(A) Test of the stool for Clostridium difficile toxin\n(B) Endoscopic retrograde cholangiopancreatography\n(C) Pelvic ultrasonography\n(D) CT scan of the abdomen with contrast", "output": "(D)"}
{"input": "A 51-year-old man comes to the office because of a 6-month history of a lump on his tongue that is interfering with his speech and eating; he also has had a 6.8-kg (15-lb) weight loss during this period. He has smoked 1 pack of cigarettes daily and has consumed six 12-oz bottles of beer on weekend nights during the past 30 years. His vital signs are within normal limits. Physical examination shows a 1.5-cm mass on the apex of the tongue. Further evaluation of the mass confirms squamous cell carcinoma. It is most appropriate to evaluate which of the following lymph nodes first for evidence of metastasis in this patient?\n(A) Inferior deep cervical\n(B) Parotid\n(C) Retropharyngeal\n(D) Submental", "output": "(D)"}
{"input": "A 42-year-old man comes to the physician because of malaise, muscle and joint pain, and temperatures to 38.4°C (101.1°F) for 3 days. Three months ago, he underwent cadaveric renal transplantation resulting in immediate kidney function. At the time of discharge, his serum creatinine concentration was 0.8 mg/dL. He is receiving cyclosporine and corticosteroids. Examination shows no abnormalities. His leukocyte count is 2700/mm3 , and serum creatinine concentration is 1.6 mg/dL; serum cyclosporine concentration is in the therapeutic range. A biopsy of the transplanted kidney shows intracellular inclusion bodies. Which of the following is the most appropriate next step in management?\n(A) Increase the dosage of corticosteroids\n(B) Increase the dosage of cyclosporine\n(C) Begin amphotericin therapy\n(D) Begin ganciclovir therapy", "output": "(D)"}
{"input": "Six healthy subjects participate in a study of muscle metabolism during which hyperglycemia and hyperinsulinemia is induced. Muscle biopsy specimens obtained from the subjects during the resting state show significantly increased concentrations of malonyl-CoA. The increased malonyl-CoA concentration most likely directly inhibits which of the following processes in these subjects?\n(A) Fatty acid oxidation\n(B) Fatty acid synthesis\n(C) Gluconeogenesis\n(D) Glycogenolysis", "output": "(A)"}
{"input": "A 26-year-old woman with HIV infection comes to the office because of a 4-day history of pain and redness of her left lower leg. She says the symptoms began after she tripped over a tree branch in her yard and scraped her left leg. Current medications include antiretroviral therapy and ibuprofen as needed. Vital signs are temperature 38.3°C (100.9°F), pulse 86/min, respirations 14/min, and blood pressure 138/70 mm Hg. There is a 5×8-cm area on the anterior surface of her left lower extremity that is swollen, erythematous, and tender. She previously has developed a rash after taking erythromycin, and she has had an anaphylactic response to penicillin. Which of the following antibiotic therapies is most appropriate for this patient?\n(A) Amoxicillin\n(B) Ciprofloxacin\n(C) Clarithromycin\n(D) Clindamycin", "output": "(D)"}
{"input": "Three days after hospitalization for diabetic ketoacidosis, an 87-year-old woman refuses insulin injections. She says that her medical condition has declined so much that she no longer wishes to go on living; she is nearly blind and will likely require bilateral leg amputations. She reports that she has always been an active person and does not see how her life will be of value anymore. She has no family and most of her friends are sick or deceased. On mental status examination, she is alert and cooperative. She accurately describes her medical history and understands the consequences of refusing insulin. There is no evidence of depression. She dismisses any attempts by the physician to change her mind, saying that the physician is too young to understand her situation. She says, \"I know I will die, and this is what I want.\" Which of the following is the most appropriate next step in management?\n(A) Discharge the patient after she has signed an \"against medical advice\" form\n(B) Seek a court order to appoint a legal guardian\n(C) Offer insulin but allow the patient to refuse it\n(D) Admit to the psychiatric unit", "output": "(C)"}
{"input": "A 25-year-old man is brought to the emergency department because of a 6-day history of fever, severe muscle pain, and diffuse, painful swelling of his neck, underarms, and groin area. The symptoms began after returning from a camping trip in New Mexico. He appears ill and lethargic and can barely answer questions. His temperature is 39.2°C (102.5°F), pulse is 120/min, respirations are 22/min, and blood pressure is 110/70 mm Hg. Physical examination shows generalized scattered black maculae. Examination of the right upper extremity shows an erythematous, solid, tender mass on the underside of the upper extremity just above the elbow; the mass is draining blood and necrotic material. The most effective antibiotic for this patient’s disorder will interfere with which of the following cellular processes or enzymes?\n(A) DNA helicase\n(B) Glucuronosyltransferase\n(C) Proteasomal degradation\n(D) Ribosomal assembly", "output": "(D)"}
{"input": "A 63-year-old woman is in the hospital recovery room 4 hours after elective left hemicolectomy for colon carcinoma at the splenic flexure. She has a preoperative written directive for no blood products through transfusion for religious reasons. Medical history is significant for hypertension and coronary artery disease. The nurse tells you the patient's blood pressure has progressively declined since the operation. Vital signs now are temperature 35.8°C (96.4°F), pulse 130/min, respirations 20/min, and blood pressure 80/50 mm Hg. Physical examination discloses a slightly distended abdomen with an intact incision. ECG shows sinus tachycardia. Urine output has been 10 mL during the past 2 hours. Hematocrit is 30%; preoperative hematocrit was 41%. The patient has received 4 L of intravenous crystalloid in the recovery room. Reported operative blood loss was 200 mL. Drainage from the nasogastric tube is clear. Damage to which of the following structures is most likely responsible for these findings?\n(A) Epigastric artery\n(B) Liver\n(C) Middle colic artery\n(D) Spleen", "output": "(D)"}
{"input": "A 37-year-old man comes to the physician because of nonradiating low back pain for 3 days. The pain began after he worked in his yard. He has not had any change in bowel movements or urination. He had one similar episode 3 years ago that resolved spontaneously. Vital signs are within normal limits. Examination of the back shows bilateral paravertebral muscle spasm. Range of motion is limited by pain. Straight-leg raising is negative. In addition to analgesia, which of the following is the most appropriate next step in management?\n(A) Bed rest\n(B) Regular activity\n(C) X-rays of the spine\n(D) MRI of the spine", "output": "(B)"}
{"input": "A 9-year-old boy is brought to the office by his parents for a well-child examination. The patient and his family immigrated to the United States 2 months ago and he has not been evaluated by a physician in 4 years. He has been generally healthy. Medical history is significant for pneumonia at age 3 years. He takes no medications. He is at the 25th percentile for height, weight, and BMI. Vital signs are temperature 37.0°C (98.6°F), pulse 82/min, respirations 20/min, and blood pressure 112/74 mm Hg. Cardiac examination discloses a grade 3/6 systolic murmur audible along the left sternal border at the third and fourth intercostal spaces. Femoral pulses are weak and brachial pulses are strong; there is a radiofemoral delay. Chest xray discloses mild cardiomegaly with left ventricular prominence. ECG shows left ventricular hypertrophy. This patient is at greatest risk for which of the following complications?\n(A) Atrial fibrillation\n(B) Cor pulmonale\n(C) Systemic hypertension\n(D) Tricuspid valve regurgitation", "output": "(C)"}
{"input": "A 19-year-old Asian female college student comes to the university health center because of a 1-week history of nasal stuffiness, occasional clear rhinorrhea, and a mild sore throat. Two days ago, she began to feel hot, but she has not taken her temperature. Medical history is unremarkable and her only medication is an oral contraceptive. She has no history of allergies. She does not smoke cigarettes. BMI is 22 kg/m2 . Vital signs are temperature 38.1°C (100.6°F), pulse 88/min, respirations 16/min, and blood pressure 116/74 mm Hg. Physical examination discloses tenderness over the left maxillary sinus without purulent drainage. There is clear fluid behind the left tympanic membrane, enlarged tonsils bilaterally, and pain with tapping of the left upper incisors. Left frontal sinus does not transilluminate. Cardiopulmonary examination discloses no abnormalities. Which of the following is the most likely underlying mechanism of this patient's sinusitis?\n(A) Eustachian tube dysfunction\n(B) Mucosal edema\n(C) Nasal polyps\n(D) Oral contraceptive use", "output": "(B)"}
{"input": "A previously healthy 15-year-old boy is brought to the emergency department in August 1 hour after the onset of headache, dizziness, nausea, and one episode of vomiting. His symptoms began during the first hour of full-contact football practice in full uniform. He reported feeling weak and faint but did not lose consciousness. He vomited once after drinking water. On arrival, he is diaphoretic. He is not oriented to person, place, or time. His temperature is 39.5°C (103.1°F), pulse is 120/min, respirations are 40/min, and blood pressure is 90/65 mm Hg. Examination, including neurologic examination, shows no other abnormalities. Which of the following is the most appropriate next step in management?\n(A) Obtain a CT scan of the head\n(B) Administer sodium chloride tablets\n(C) Administer intravenous fluids\n(D) Immerse the patient in an ice water bath", "output": "(C)"}
{"input": "A 64-year-old woman comes to the physician because of a 5-month history of increasing shortness of breath, sore throat, and a cough productive of a small amount of white phlegm. Over the past week, she has had nausea related to excess coughing. Over the past year, she has had a 3.2-kg (7-lb) weight loss. She has asthma treated with theophylline and inhaled β-adrenergic agonists and corticosteroids. She has smoked one pack of cigarettes daily for 44 years and drinks one alcoholic beverage daily. She appears thin. Examination shows a 2-cm, nontender lymph node in the right supraclavicular area. Examination shows no other abnormalities. An x-ray of the chest shows a large right lower lobe density. A CT scan of the chest shows a 7.5 x 7.5 x 6-cm right lower lobe mass with some scattered calcifications. The lesion abuts the posterior chest wall without clear invasion. There are right lower peritracheal, precarinal, right hilar, and subcarinal lymph nodes. There is a 1.5-cm mass in the right adrenal gland. A biopsy specimen of the lung mass is most likely to show which of the following?\n(A) Mesothelioma\n(B) Metastatic adenocarcinoma of the breast\n(C) Multiple endocrine neoplasia\n(D) Non-small cell lung carcinoma", "output": "(D)"}
{"input": "A 77-year-old man is brought to the physician because of a 12-hour history of word-finding difficulty and weakness and sensory loss of the right arm and leg. He has no history of similar symptoms. He has type 2 diabetes mellitus, hypertension, and atrial fibrillation. Current medications include metformin, lisinopril, and aspirin. He is alert. His pulse is 80/min and irregular, respirations are 16/min, and blood pressure is 170/90 mm Hg. He follows commands but has nonfluent aphasia. There is moderate weakness and decreased sensation of the right upper and lower extremities. Deep tendon reflexes are 2+ bilaterally. Babinski sign is present on the right. His serum glucose concentration is 162 mg/dL. Which of the following is the most appropriate next step in diagnosis?\n(A) Carotid duplex ultrasonography\n(B) CT scan of the head\n(C) EEG\n(D) Lumbar puncture", "output": "(B)"}
{"input": "During a study of renal glomeruli, a healthy animal kidney is kept in a vascular bath preparation at a constant afferent arterial pressure of 100 mm Hg. If the efferent arteriole is constricted with a vascular clamp, which of the following Starling forces is most likely to change in the glomeruli?\n(A) Decreased filtration coefficient (Kf)\n(B) Decreased hydrostatic pressure\n(C) Decreased oncotic pressure\n(D) Increased hydrostatic pressure", "output": "(D)"}
