{"input": "A PO3- radical produces a pair of lines separated by 280 MHz with giso = 2.005. Calculate the expected resonant field positions of both lines in the X-band EPR spectrum (ν = 9.5 GHz).\n(A) Bres for mI = -½ = 325.0 mT; Bres for mI = +½ = 335.0 mT\n(B) Bres for mI = -½ = 123.5 mT; Bres for mI = +½ = 124.5 mT.\n(C) Bres for mI = -½ = 333.5 mT; Bres for mI = +½ = 343.5 mT.\n(D) Bres for mI = -½ = 0.218 mT; Bres for mI = +½ = 0.418 mT.", "output": "(D)"}
{"input": "Infrared (IR) spectroscopy is useful for determining certain aspects of the structure of organic molecules because\n(A) all molecular bonds absorb IR radiation\n(B) IR peak intensities are related to molecular mass\n(C) most organic functional groups absorb in a characteristic region of the IR spectrum\n(D) each element absorbs at a characteristic wavelength", "output": "(C)"}
{"input": "Of the following atoms, which has the lowest electron affinity?\n(A) F\n(B) Si\n(C) O\n(D) Ca", "output": "(D)"}
{"input": "Which of the following is the most common naturally-occurring form in which silicon is found?\n(A) Metallic element\n(B) Sulfide\n(C) Fluoride\n(D) Oxide", "output": "(D)"}
{"input": "Of the following compounds, which has the lowest melting point?\n(A) HCl\n(B) AgCl\n(C) CaCl2\n(D) CCl4", "output": "(A)"}
{"input": "When the Heisenberg uncertainty principle is applied to a quantum mechanical particle in the lowest energy level of a one-dimensional box, which of the following is true?\n(A) Momentum is known exactly, but no information about position can be known.\n(B) Position is known exactly, but no information about momentum can be known.\n(C) No information about either position or momentum can be known.\n(D) Neither position nor momentum can be known exactly.", "output": "(D)"}
{"input": "A substance that is NOT generally considered to be a toxic pollutant in water is\n(A) carbonic acid\n(B) a halogenated hydrocarbon\n(C) lead\n(D) mercury", "output": "(A)"}
{"input": "Which of the following statements is not a reason why tetramethylsilane is used as a 1H chemical shift reference.\n(A) Its 1H spectrum is a singlet.\n(B) Its protons are quite strongly shielded.\n(C) It dissolves in most organic solvents.\n(D) Most organic compounds do not contain silicon atoms.", "output": "(D)"}
{"input": "The equilibrium populations of the 1H energy levels of a molecule are nα = nαeq and nβ = nβeq. What are the populations after a 5.0 μs pulse when B1 = 4.697 mT?\n(A) nα = nβeq and nβ = nαeq\n(B) nα = nαeq and nβ = nβeq\n(C) nα = ½(nαeq + nβeq) and nβ = ½(nαeq + nβeq)\n(D) nα = nαeq + nβeq and nβ = nαeq + nβeq", "output": "(A)"}
{"input": "Which of the following statements most accurately explains why the T1 of a nucleus is sometimes longer than its T2?\n(A) T1, unlike T2, is sensitive to very low-frequency molecular motions.\n(B) T2, unlike T1, is sensitive to very low-frequency molecular motions.\n(C) T1, unlike T2, is sensitive to molecular motions at the Larmor frequency.\n(D) T2, unlike T1, is sensitive to molecular motions at the Larmor frequency.", "output": "(D)"}
{"input": "Which of the following types of spectroscopy is a light-scattering technique?\n(A) Nuclear magnetic resonance\n(B) Infrared\n(C) Raman\n(D) Ultraviolet-visible", "output": "(C)"}
{"input": "The X-band (9.5 GHz) EPR spectrum of a matrix isolated Na atom reveals four hyperfine lines with resonant field positions of 3074 G, 3174 G, 3274 G and 3374 G. Calculate the g value of the atom.\n(A) g = 2.002\n(B) g = 1.950\n(C) g = 2.250\n(D) g = 2.005", "output": "(A)"}
{"input": "Of the following compounds, which is LEAST likely to behave as a Lewis acid?\n(A) BeCl2\n(B) MgCl2\n(C) ZnCl2\n(D) SCl2", "output": "(D)"}
{"input": "Elements with partially filled 4f or 5f orbitals include all of the following EXCEPT\n(A) Cu\n(B) Gd\n(C) Eu\n(D) Am", "output": "(A)"}
{"input": "What is the orbital angular momentum quantum number, l, of the electron that is most easily removed when ground-state aluminum is ionized?\n(A) 3\n(B) 2\n(C) 1\n(D) 0", "output": "(C)"}
{"input": "The 1H spectrum of a mixture of dimethylsulphoxide (DMSO) and acetonitrile (AN) contains lines with relative intensities α and 3α, respectively. What is the ratio of the two concentrations, [DMSO]:[AN]?\n(A) 1:1\n(B) 1:3\n(C) 1:6\n(D) 2:3", "output": "(C)"}
{"input": "Which of the following statements most accurately explains why the 1H spectrum of 12CHCl3 is a singlet?\n(A) Both 35Cl and 37Cl have I = 0.\n(B) The hydrogen atom undergoes rapid intermolecular exchange.\n(C) The molecule is not rigid.\n(D) Both 35Cl and 37Cl have electric quadrupole moments.", "output": "(D)"}
{"input": "The molecular geometry of thionyl chloride, SOCl2, is best described as\n(A) trigonal planar\n(B) T-shaped\n(C) tetrahedral\n(D) trigonal pyramidal", "output": "(D)"}
{"input": "Which of the following is a true statement about optical isomerism of complexes containing achiral ligands?\n(A) Square planar complexes can display optical isomerism only if all four ligands are identical.\n(B) Tetrahedral complexes never display optical isomerism.\n(C) Linear complexes can display optical isomerism when both ligands are different.\n(D) Octahedral complexes of monodentate ligands can display optical isomerism only when they have at least three different ligands.", "output": "(D)"}
{"input": "A Cu(II) metal ion (giso = 2.12) produces four lines with a separation of 500 MHz between each line. Express the hyperfine splitting in field units of mT and the hyperfine coupling in units of wavenumbers.\n(A) 500 MHz = 0.185 mT = 0.29842 cm-1\n(B) 500 MHz = 16.850 mT = 0.01667 cm-1\n(C) 500 MHz = 32.953 mT = 0.76298 cm-1\n(D) 500 MHz = 45.672 mT = 2.86329 cm-1", "output": "(C)"}
