{"input": "As seen from Earth, the Moon goes through a series of phases due to changes in which of the following?\n(A) The amount of the Moon's surface that is in Earth's shadow\n(B) The amount of the illuminated side of the Moon that can be seen from Earth\n(C) The part of the Moon that faces Earth as the Moon rotates on its axis\n(D) The tilt of the Moon on its axis", "output": "(B)"}
{"input": "Paper will burn at approximately what temperature in Fahrenheit?\n(A) 986 degrees\n(B) 2125 degrees\n(C) 3985 degrees\n(D) 451 degrees", "output": "(D)"}
{"input": "Who led the 1831 slave insurrection in SouthamptonVirginia?\n(A) John Brown\n(B) Dred Scott\n(C) Nat Turner\n(D) Harriet Tubman", "output": "(C)"}
{"input": "Which of the following would be provided in the marketing segment of a business plan?\n(A) How the products and services will be priced\n(B) The organizational structure of the business\n(C) Any factors that could affect employee retention\n(D) The details of the budget plan", "output": "(A)"}
{"input": "The labor force primarily consists of all\n(A) employed workers under the age of 16\n(B) persons classified as unemployed or employed\n(C) persons who are employed as full-time workers\n(D) unemployed, employed, and discouraged workers", "output": "(B)"}
{"input": "Of the following objectives, which is most appropriate for a technology education program that has a goal of enabling students to develop creative technical solutions to present and future societal problems?\n(A) Design and construct a threedimensional model of a low-income, multifamily dwelling unit\n(B) Describe several construction careers that are related to home building\n(C) Categorize the components of a technical system\n(D) Identify the major tools and equipment used in highway construction", "output": "(A)"}
{"input": "What type of meat is on a traditional Reuben sandwich?\n(A) turkey\n(B) bologna\n(C) corned beef\n(D) pepperoni", "output": "(C)"}
{"input": "What was the average life expectancy of white males born in the U.S. just before the Civil War?\n(A) 40 years\n(B) 50 years\n(C) 60 years\n(D) 70 years", "output": "(A)"}
{"input": "What country does Bordeaux wine come from?\n(A) France\n(B) Spain\n(C) Australia\n(D) United States", "output": "(A)"}
{"input": "In which layer of Earth is the geomagnetic field generated?\n(A) Outer core\n(B) Crust\n(C) Mantle\n(D) Inner core", "output": "(A)"}
{"input": "Which of the following terms refers to the process of using thick applications of paint?\n(A) Scumbling\n(B) Alla prima\n(C) Impasto\n(D) Frottage", "output": "(C)"}
{"input": "What is called a 'lorry' in Britain?\n(A) a toaster\n(B) a truck\n(C) a babysitter\n(D) an elevator", "output": "(B)"}
{"input": "If the tax rate for a single person with $25,000 in taxable income is 24 percent, and the tax rate for a single person with $20,000 in taxable income is 20 percent, the tax rate over this income range is\n(A) regressive\n(B) progressive\n(C) proportional\n(D) revenue-neutral", "output": "(B)"}
{"input": "What French city is home to a famous international film festival each spring?\n(A) Cannes\n(B) Marseille\n(C) Dijon\n(D) Lyon", "output": "(A)"}
{"input": "In the 1976 remake of the classic film 'KingKong' what New York landmark does the giant ape climb?\n(A) Statue of Liberty\n(B) Empire State Building\n(C) World Trade Center\n(D) Chrysler Building", "output": "(C)"}
{"input": "Which of the following words cannot be decoded through knowledge of letter-sound relationships?\n(A) Flight\n(B) Said\n(C) Things\n(D) Lamp", "output": "(B)"}
{"input": "In the children's game what color is 'Rover'?\n(A) Green\n(B) black\n(C) red\n(D) blue", "output": "(C)"}
{"input": "Which of the following best helps explain why volcanoes tend to form along subduction zones?\n(A) Rock material carried deep below Earth's surface results in material melting and rising to the surface.\n(B) Two plates pull away from each other, and magma oozes out.\n(C) The friction resulting from the collision of two continents causes rock to melt.\n(D) There is a row of hot spots at these boundaries.", "output": "(A)"}
{"input": "Old-fashioned steam engines were powered by coal transferred from the tender to the engine by human stokers using a shovel. What is the maximum power such an engine could attain?\n(A) 6*10^3 W\n(B) 6*10^5 W\n(C) 6*10^7 W\n(D) 6*10^11 W", "output": "(B)"}
{"input": "According to legend if you give someone the 'evil eye' what are you doing?\n(A) cursing them\n(B) blessing a child\n(C) counting money\n(D) passing time", "output": "(A)"}
