{"input": "What did Charles Krauthammer mean by a 'unipolar moment' when describing the post-Cold War system?\n(A) The chance for the United States to share power with other countries in the world\n(B) An opportunity to use to collapse of the Soviet Union to extend US power\n(C) An international system that didn't face any threats\n(D) The never-ending domination of the United States", "output": "(B)"}
{"input": "Which of the following points supports the argument for American unilateralism?\n(A) Benevolent hegemony\n(B) Ineffectiveness of multilateralism\n(C) American power\n(D) All of the above", "output": "(D)"}
{"input": "What was the Clinton Administration's policy on the Russian economy?\n(A) The US inhibited the marketization of the Russian economy\n(B) The US promoted the marketization of the Russian economy\n(C) The US supported public ownership of natural resources\n(D) None, the US was only concerned with security issues", "output": "(B)"}
{"input": "According to Rosenau, which factor is important to consider in explaining the foreign policy behavior of the United States?\n(A) The external environment of the international system\n(B) Domestic environment, government and bureaucracy\n(C) The President's individual personality.\n(D) All of the above", "output": "(D)"}
{"input": "What was the significance of the Gulf of Tonkin resolution?\n(A) It allowed the US to intensify its involvement in Vietnam\n(B) It illustrated the influence of public opinion on US foreign policy\n(C) It enhanced Congressional control over the Vietnam War\n(D) It curtailed US involvement in Vietnam", "output": "(A)"}
{"input": "Why did Lincoln oppose the southward expansion of the US?\n(A) It would have drained the US economically\n(B) It would have involved compromising opposition to slavery\n(C) It would have increased immigration to the US\n(D) None of the above", "output": "(B)"}
{"input": "What tend to be the effects of oil and other natural resource trade on developing states?\n(A) It democratizes countries\n(B) It has no real effect\n(C) It encourages stability of the regime\n(D) It changes the nature of the investor", "output": "(C)"}
{"input": "Which of the following are possible constraints on US foreign policy decision making?\n(A) Foreign policies of other states\n(B) International law\n(C) Intergovernmental organizations\n(D) All of the above", "output": "(D)"}
{"input": "Which of these is not a component of the 'American Creed'?\n(A) Liberty\n(B) Equality\n(C) Autocracy\n(D) Individualism", "output": "(C)"}
{"input": "In general, how do conservatives and liberals differ when it comes to defense spending?\n(A) Conservatives are skeptical of increases in defense spending; liberals advocate increases in defense spending.\n(B) Conservatives favor social spending over defense spending; liberals favor defense spending over social spending.\n(C) Conservatives advocate increases in defense spending; liberals are generally skeptical of increases in defense spending.\n(D) Conservatives emphasize strong economies; liberals emphasize strong military readiness.", "output": "(C)"}
{"input": "What did the Moscow Treaty on Strategic Offensive Reductions do?\n(A) Required the United States and Russia to demobilize their armies\n(B) Required the United States and Russia to dismantle a significant number of their nuclear weapons\n(C) Prohibited the acquisition of new military bases\n(D) Prohibited short-range nuclear weapons", "output": "(B)"}
{"input": "Why might American exceptionalism lead to opposition to world government?\n(A) Its general anti-statism opposes centralized government\n(B) It views world government as impractical\n(C) It views the UN as a sufficient form of global governance\n(D) None of the above", "output": "(A)"}
{"input": "What was the 'New Populism'?\n(A) A strand of neo-isolationist sentiment\n(B) A strand of internationalist sentiment\n(C) An expression of American cultural superiority\n(D) Increased incorporation of public opinion in foreign policy making", "output": "(A)"}
{"input": "The largest increase in peacetime defense spending in American history occurred under which president?\n(A) Jimmy Carter\n(B) Ronald Reagan\n(C) Bill Clinton\n(D) Dwight Eisenhower", "output": "(B)"}
{"input": "Global and regional international trade agreements work by using which of the following mechanisms?\n(A) Reciprocity across multiple issues\n(B) Reputational concerns of the actors\n(C) Side payments for adjusting to the organization (such as the Common Agricultural Policy in the EU)\n(D) ALL of the above", "output": "(D)"}
{"input": "What policies are part of a grand strategy of Offshore Balancing?\n(A) Maintaining a balance between the United States and other countries and not entering into alliances\n(B) Investing equally in domestic and international security with balanced protection against terrorism and other states\n(C) Embrace multi-polarity, show greater restraint internationally and require other states to meet their own security burdens.\n(D) Isolate the US from the international system and not seek global power", "output": "(C)"}
{"input": "What were the implications of the Cold War for American exceptionalism?\n(A) It ended the influence of American exceptionalism entirely\n(B) Exceptionalism was enhanced by America's status as the 'leader of the free world'\n(C) The extension of American power globally challenged core assumptions of exceptionalism\n(D) Both b and c", "output": "(D)"}
{"input": "Why might the 'Philadelphian System' be linked to the idea of American exceptionalism?\n(A) It encouraged greater involvement in European politics\n(B) It was designed as the antithesis of European politics\n(C) It created a large standing army\n(D) It encouraged the centralization of political power in the US", "output": "(B)"}
{"input": "The Strategic Arms Reduction Treaty was the first accord\n(A) on nuclear weapons signed between the United States and the Soviet Union.\n(B) cutting conventional arms in Europe.\n(C) to be rejected by the U.S. Senate.\n(D) mandating the elimination of many long-range nuclear missiles.", "output": "(D)"}
{"input": "How do Ideational approaches to US foreign policy during the Cold War differ from Realist accounts of the same period?\n(A) They place greater emphasis on economic factors\n(B) They place greater emphasis on material interests and power\n(C) They place greater emphasis on ideology and beliefs\n(D) They place greater emphasis on geopolitics", "output": "(C)"}
