{"input": "This question refers to the following information.\nRead the following excerpt.\nThe revolutionary seed had penetrated into every country and spread more or less. It was greatly developed under the régime of the military despotism of Bonaparte. His conquests displaced a number of laws, institutions, and customs; broke through bonds sacred among all nations, strong enough to resist time itself; which is more than can be said of certain benefits conferred by these innovators.\nThe monarchs will fulfil the duties imposed upon them by Him who, by entrusting them with power, has charged them to watch over the maintenance of justice, and the rights of all, to avoid the paths of error, and tread firmly in the way of truth. Placed beyond the passions which agitate society, it is in days of trial chiefly that they are called upon to despoil realities of their false appearances, and to show themselves as they are, fathers invested with the authority belonging by right to the heads of families, to prove that, in days of mourning, they know how to be just, wise, and therefore strong, and that they will not abandon the people whom they ought to govern to be the sport of factions, to error and its consequences, which must involve the loss of society.\nUnion between the monarchs is the basis of the policy which must now be followed to save society from total ruin. . . .\nLet them not confound concessions made to parties with the good they ought to do for their people, in modifying, according to their recognized needs, such branches of the administration as require it.\nLet them be just, but strong; beneficent, but strict.\nLet them maintain religious principles in all their purity, and not allow the faith to be attacked and morality interpreted according to the social contract or the visions of foolish sectarians.\nLet them suppress Secret Societies; that gangrene of society.\n—Klemens von Metternich, Political Confession of Faith, 1820\nWhich of the following is the best description of the goals of the new ideology of conservatism as it was explained by Metternich?\n(A) The suppression of all new ideas in every field to prevent any changes to society.\n(B) The suppression of nationalist and liberal revolutions that called for democratic and economic reforms.\n(C) The suppression of secret societies in hopes of spreading democracy to the masses.\n(D) The suppression of political change only while allowing economic and social change.", "output": "(B)"}
{"input": "This question refers to the following information.\n\"In 1500 that work appeared which Erasmus had written after his misfortune at Dover, and had dedicated to Mountjoy, the Adagiorum Collectanea. It was a collection of about eight hundred proverbial sayings drawn from the Latin authors of antiquity and elucidated for the use of those who aspired to write an elegant Latin style. In the dedication Erasmus pointed out the profit an author may derive, both in ornamenting his style and in strengthening his argumentation, from having at his disposal a good supply of sentences hallowed by their antiquity. He proposes to offer such a help to his readers. What he actually gave was much more. He familiarized a much wider circle than the earlier humanists had reached with the spirit of antiquity.\nUntil this time the humanists had, to some extent, monopolized the treasures of classic culture, in order to parade their knowledge of which the multitude remained destitute, and so to become strange prodigies of learning and elegance. With his irresistible need of teaching and his sincere love for humanity and its general culture, Erasmus introduced the classic spirit, in so far as it could be reflected in the soul of a sixteenth-century Christian, among the people. Not he alone; but none more extensively and more effectively. Not among all the people, it is true, for by writing in Latin he limited his direct influence to the educated classes, which in those days were the upper classes.\nErasmus made current the classic spirit. Humanism ceased to be the exclusive privilege of a few. According to Beatus Rhenanus he had been reproached by some humanists, when about to publish the Adagia, for divulging the mysteries of their craft. But he desired that the book of antiquity should be open to all.\"\nJohan Huizinga, twentieth-century Dutch philosopher, Erasmus and the Age of Reformation, 1924\nBased on Huizinga's description of Erasmus's career, the contributions of Erasmus are most similar to those of\n(A) Johannes Gutenberg\n(B) Martin Luther\n(C) Francesco Petrarch\n(D) Christine de Pisan", "output": "(C)"}
{"input": "This question refers to the following information.\nThe following entries are in the diary of Napoleon Bonaparte.\nParis has a short memory. If I remain longer doing nothing, I am lost. In this great Babylon one reputation quickly succeeds another. After I have been seen three times at the theatre, I shall not be looked at again. I shall therefore not go very frequently. (diary, 1798)\nIf the press is not bridled, I shall not remain three days in power. (diary, 1799)\nThe presence of a general is necessary; he is the head, he is the all in all of an army. It was not the Roman army that conquered Gaul, it was Caesar, it was not the Carthaginians that made the armies of the Roman republic tremble at the very gates of Rome, it was Hannibal. (diary, 1801)\nMy power proceeds from my reputation, and my reputation from the victories I have won. My power would fall if I were not to support it with more glory and more victories. Conquest has made me what I am; only conquest can maintain me. (diary, 1802)\nThe revolution in France is over and now there is only one party in France and I shall never allow the newspapers to say anything contrary to my interests. They may publish a few little articles with just a bit of poison in them, but one fine day I shall shut their mouths forever. (diary, 1805)\nNapoleon instituted the Continental System to accomplish which of the following?\n(A) Unify Italy with his brother as king\n(B) Punish Russia for his ill-fated invasion\n(C) Defeat England through economic war\n(D) Create a united Europe under the leadership of France", "output": "(C)"}
{"input": "This question refers to the following information.\nThe passage below is written by John Calvin.\nIf we need to be recalled to the origin of election, to prove that we obtain salvation from no other source than the mere goodness of God, they who desire to extinguish this principle, do all they can to obscure what ought to be magnificently and loudly celebrated, and to pluck up humility by the roots. In ascribing the salvation of the remnant of the people to the election of grace, Paul clearly testifies, that it is then only known that God saves whom upon which there can be no claim. They who shut the gates to prevent anyone from presuming to approach and taste this doctrine, do no less injury to man than to God; for nothing else will be sufficient to produce in us suitable humility, or to impress us with a due sense of our great obligations to God. Nor is there any other basis for solid confidence, even according to the authority of Christ, who, to deliver us from all fear, and render us invincible amidst so many dangers, snares, and deadly conflicts, promises to preserve in safety all whom the Father has committed to His care.\n—John Calvin, Institutes of the Christian Religion, 1559\nWhich of the following was NOT an abuse of the Catholic Church that Calvin and other religious leaders criticized?\n(A) Papal wealth\n(B) Pluralism\n(C) Nepotism\n(D) Indulgences", "output": "(A)"}
{"input": "This question refers to the following information.\nThe following account of the Paris Exposition of 1889.\n\"The opportunities to study the natural history of man in Paris during the Exposition, and especially in August, when the great Congresses and the French Association held their sessions, were unparalleled in the history of anthropology. At any time the French capital affords rare advantages to the anthropologist. The Musée and Laboratoire Broca, the anthropometric operations of Bertillon in the Palais de Justice, the courses of lectures in the école d'Anthropologie, the collections in the Jardin de Plantes, the facilities for original work in the écoles de Medicine, and the hospitals give to the comparative anatomist and biologist abundant employment.\"\nOtis T. Mason, American ethnologist and curator, 1889\nThe opportunities described in the text can be attributed to\n(A) the stability brought to France by the Third Republic\n(B) France's preparation for the upcoming Franco-Prussian War during the Second Empire\n(C) the labor friendly policies of the Second Republic\n(D) financial power of the bourgeoisie during the Bourbon Restoration", "output": "(A)"}
