{"input": "Why is Saturn almost as big as Jupiter despite its smaller mass?\n(A) Jupiter's greater mass compresses it more thus increasing its density.\n(B) Saturn has a larger proportion of hydrogen and helium than Jupiter and is therefore less dense.\n(C) Saturn is further from the Sun thus cooler and therefore less compact.\n(D) Saturn's rings make the planet look bigger.", "output": "(A)"}
{"input": "By locating the north celestial pole (NCP) in the sky how can you determine your latitude?\n(A) The azimuth of the NCP is the angular distance from the North Pole.\n(B) The azimuth of the NCP is the same as your latitude.\n(C) The altitude of the NCP is the same as your latitude.\n(D) The altitude of the NCP is your angular distance from the North Pole.", "output": "(C)"}
{"input": "Venus shows evidence of which of the following surface processes?\n(A) Impacts\n(B) Erosion\n(C) Volcanism\n(D) A B and C", "output": "(D)"}
{"input": "The sky is blue because\n(A) the Sun mainly emits blue light.\n(B) the atmosphere absorbs mostly blue light.\n(C) molecules scatter red light more effectively than blue light.\n(D) molecules scatter blue light more effectively than red light.", "output": "(D)"}
{"input": "Which of the following is/are NOT caused by orbital resonance?\n(A) 2:3 periodic ratio of Neptune:Pluto\n(B) Kirkwood Gaps.\n(C) Gaps in Saturn's rings.\n(D) Breaking of small Jovian moons to form ring materials.", "output": "(D)"}
{"input": "Why does Earth have the strongest magnetic field among the terrestrial worlds?\n(A) It is by far the largest terrestrial world.\n(B) It is the most volcanically active world.\n(C) It is the only one that has both a partially molten metallic core and reasonably rapid rotation.\n(D) It rotates much faster than any other terrestrial world.", "output": "(C)"}
{"input": "Some of Mars'water is frozen in the soil and the ice caps and some was lost due to solar wind stripping but much of the original water is thought to have been lost through another mechanism. What happened to this \"lost\"water?\n(A) it was stripped away by the magnetic field when it rapidly decreased in strength\n(B) it was broken into hydrogen and oxygen by ultraviolet light and the hydrogen was lost through thermal escape\n(C) it was consumed by a civilization of thirsty Martians\n(D) it was vaporized during a period of intense volcanism and was lost to space through thermal escape", "output": "(B)"}
{"input": "Approximately how old is the surface of Venus?\n(A) 750 million years.\n(B) 2 billion years.\n(C) 3 billion years.\n(D) 4.5 billion years.", "output": "(A)"}
{"input": "How do we think the \"hot Jupiters\" around other stars were formed?\n(A) They where formed when their stars flung material out into the system in a process similar to planetary fission.\n(B) They formed as gas giants beyond the frost line and then migrated inwards.\n(C) They formed as dense rocky planets close to the star in the same orbits that they are seen today.\n(D) They formed as gas giants close to the star in the same orbits that they are seen today.", "output": "(B)"}
{"input": "Why are the season's in Mars' southern hemisphere so extreme?\n(A) because Mars is farther from the sun than the Earth\n(B) because Mars has more carbon dioxide in its atmosphere than the Earth\n(C) because Mars has a more eccentric orbit than the Earth\n(D) because Mars' axis is more tilted than the Earth's", "output": "(C)"}
{"input": "The Pleiades is an open star cluster that plays a role in many ancient stories and is well-known for containing ... bright stars.\n(A) 5\n(B) 7\n(C) 9\n(D) 12", "output": "(B)"}
{"input": "Which of the following is/are common feature(s) of all fresh (i.e. not eroded) impact craters formed on solid surfaces:\n(A) ejecta\n(B) raised rims\n(C) central peaks\n(D) A and B only", "output": "(D)"}
{"input": "Planet X orbits its sun once every 100 Earth days and rotates in the prograde direction around its axis with a sidereal day of 100 Earth days. How long is a solar day on Planet X?\n(A) About 10 earth days\n(B) About 100 earth days\n(C) About 200 earth days\n(D) There is no solar day Planet X is tidally locked", "output": "(D)"}
{"input": "From laboratory measurements we know that a particular spectral line formed by hydrogen appears at a wavelength of 486.1 nanometers (nm). The spectrum of a particular star shows the same hydrogen line appearing at a wavelength of 485.9 nm. What can we conclude?\n(A) The star is getting hotter.\n(B) The star is getting colder.\n(C) The star is moving toward us.\n(D) The star is moving away from us.", "output": "(C)"}
{"input": "Pluto's extremely cold (~40 K) surface is composed of:\n(A) mainly water ice which always remains frozen\n(B) nitrogen methane and carbon monoxide ices which sublimate into an atmosphere near perihelion\n(C) nitrogen methane and carbon monoxide ices which always remain frozen\n(D) roughly half ices and half rocky materials", "output": "(B)"}
{"input": "Mars has an atmospheric pressure of 600 pascals. If the acceleration due to gravity on Mars is (roughly) 4 m/s2 and the surface area of Mars is about 145000000 square km what is the approximate mass of the martian atmosphere?\n(A) 2.2x1011 kg\n(B) 2.2x1014kg\n(C) 2.2x1020kg\n(D) 2.2x1016 kg", "output": "(D)"}
{"input": "Why do we see essentially the same face of the Moon at all times?\n(A) because the Moon has a nearly circular orbit around the Earth\n(B) because the Moon does not rotate\n(C) because the other face points toward us only at new moon when we can't see the Moon\n(D) because the Moon's rotational and orbital periods are equal", "output": "(D)"}
{"input": "Life on Earth originated from\n(A) We don't know for sure.\n(B) aliens (panspermia).\n(C) comets.\n(D) the Earth's oceans.", "output": "(A)"}
{"input": "You've made a scientific theory that there is a force between all objects. This forcce has both a dark and light side. When will your theory be proven correct?\n(A) When you and many other Jedi have tested the hypothesis\n(B) Jean-Luc Skywalker drops Yoda during the day and he falls to the ground proving your theory.\n(C) You can never prove your theory to be correct only \"yet to be proven wrong.\"\n(D) After you've repeated your experiment many times", "output": "(C)"}
{"input": "Why did Ptolemy have the planets orbiting Earth on ‘circles upon circles’ in his model of the universe?\n(A) To explain why more distant planets take longer to make a circuit through the constellations of the zodiac.\n(B) To explain the fact that planets sometimes appear to move westward rather than eastward relative to the stars in our sky.\n(C) To explain why the Greeks were unable to detect stellar paralax.\n(D) To properly account for the varying distances of the planets from Earth.", "output": "(B)"}
