{"input": "Amy's therapist shakes her head affirmatively and says, \"Yes, uh huh,\" as Amy talks about her problems. Which of the following treatments did she experience?\n(A) psychoanalysis\n(B) behavior therapy\n(C) humanistic therapy\n(D) cognitive therapy", "output": "(C)"}
{"input": "Which of the following is true regarding lifelong learning and ongoing professional development of school psychologists?\n(A) A formal professional development plan should be made and updated annually.\n(B) Textbooks from graduate school should be reread annually.\n(C) A degree in another field should be pursued.\n(D) A graduate education program should offer adequate preparation for professional practice, so no further training will be needed.", "output": "(A)"}
{"input": "A medication prescribed by a psychiatrist for major depressive disorder would most likely influence the balance of which of the following neurotransmitters?\n(A) serotonin\n(B) dopamine\n(C) acetylcholine\n(D) thorazine", "output": "(A)"}
{"input": "Which of the following refers to the benefit of having an emotional release to reduce aggressive tendencies?\n(A) James-Lange theory of emotion\n(B) Counterconditioning\n(C) Catharsis hypothesis\n(D) Transference", "output": "(C)"}
{"input": "Detection of a just-noticeable difference (JND) depends on the\n(A) presence of a \"no stimulus\" control and the sensitivity of the signal-detection equipment\n(B) initial determination of the absolute threshold and the variation of the difference threshold\n(C) frequency of the existing stimulus and the presence of one or more sensory modalities\n(D) intensity of the new stimulus and that of the stimulus already present", "output": "(D)"}
{"input": "After she used address stickers sent by a charity in the mail, Brittany felt obligated to mail a donation to the organization that sent the stickers. Brittany's behavior illustrates\n(A) stereotyping\n(B) the fundamental attribution error\n(C) the mere exposure effect\n(D) the reciprocity norm", "output": "(D)"}
{"input": "In the nature versus nurture debate, nature is most closely associated with\n(A) environment.\n(B) culture.\n(C) learning.\n(D) temperament.", "output": "(D)"}
{"input": "If a distribution of scores includes one or more outliers, which of the following measures of central tendency should be used?\n(A) standard deviation\n(B) range\n(C) median\n(D) mean", "output": "(C)"}
{"input": "The superintendent of a large school district asks the school psychologist to predict students' grade point averages (GPAs) for the first year of high school. The school psychologist has included achievement and aptitude scores as predictor variables for firstyear high school GPA in a regression analysis and is considering whether to also administer a school interest inventory and include those scores. The major concern of the school psychologist when making this decision should be which of the following?\n(A) The intercorrelation of the aptitude and achievement test scores\n(B) The degree to which the school interest inventory score raises the multiple correlation when it is included as a predictor variable of first-year high school GPA\n(C) The zero-order correlation of first-year high school GPA and the school interest inventory score\n(D) The difference in the correlations of the school interest inventory scores with first-year high school GPA and the aptitude and achievement test scores with first-year high school GPA", "output": "(B)"}
{"input": "Turning up the volume on a music player changes which aspect of sound?\n(A) amplitude of the wave\n(B) frequency of the wave\n(C) pitch of the tone\n(D) transduction of the tone", "output": "(A)"}
{"input": "Sigmund Freud was the founder of which of the following perspectives in psychology?\n(A) Biological\n(B) Behavioral\n(C) Cognitive\n(D) Psychoanalytic", "output": "(D)"}
{"input": "Psychogenic amnesia is an indication of which kind of psychological disorder?\n(A) schizophrenic\n(B) anxiety\n(C) mood\n(D) dissociative", "output": "(D)"}
{"input": "Each of the following is a step taken by a therapist who is employing systematic desensitization EXCEPT\n(A) helping the client experience the desired state of relaxation through hypnosis\n(B) teaching the client to relax through techniques such as deep breathing\n(C) constructing a hierarchy of feared images\n(D) instructing the client to picture each fearful image while maintaining a relaxed state", "output": "(A)"}
{"input": "Which of the following is a key difference between the experimental method and naturalistic observation?\n(A) Experiments yield qualitative data, whereas naturalistic observation yields quantitative data.\n(B) Naturalistic observation involves surveys, whereas experiments measure behavior.\n(C) Naturalistic observation takes place in the field, whereas experiments take place in a lab.\n(D) Researchers can exercise greater control over experiments than in naturalistic observation.", "output": "(D)"}
{"input": "Georgia works in the local hospital because she wishes to help others, while Kathy works in the hospital strictly to make money. Their individual motivations demonstrate the difference between\n(A) primary and secondary drives\n(B) positive and negative loci of control\n(C) sympathetic and autonomic motivation\n(D) intrinsic and extrinsic motivation", "output": "(D)"}
{"input": "An unjustifiable and usually negative attitude toward a group and its members is called\n(A) prejudice\n(B) ethnocentrism\n(C) in-group bias\n(D) discrimination", "output": "(A)"}
{"input": "The pastry chef ordinarily makes 15 apple turnovers in 15 minutes, but when culinary arts students are watching him, he makes 20 apple turnovers in 15 minutes. This exemplifies\n(A) foot-in-the-door phenomenon\n(B) social loafing\n(C) social facilitation\n(D) the bystander effect", "output": "(C)"}
{"input": "The medical model of psychologically disordered behavior is most likely to be criticized for neglecting the importance of\n(A) depression\n(B) anxiety disorders\n(C) neurotransmitters\n(D) social circumstances", "output": "(D)"}
{"input": "Iconic memory refers to\n(A) visual sensory registries\n(B) olfactory sensory registries\n(C) frontal sensory registries\n(D) STM sensory registries", "output": "(A)"}
{"input": "Which of the following is a hallucination?\n(A) thinking you are President of the United States\n(B) being sure that your boss is out to get you\n(C) thinking this is 2010\n(D) hearing voices that are not actually there", "output": "(D)"}
