{"input": "Who said that “Jurisprudence is the eye of law”\n(A) Maine\n(B) Savigny\n(C) Pound\n(D) Laski", "output": "(D)"}
{"input": "The ________ School of jurisprudence believes that the law is an aggregate of social traditions and customs that have developed over the centuries.\n(A) Historical\n(B) Analytical\n(C) Command\n(D) Sociological", "output": "(A)"}
{"input": "Which of the following is the strongest argument against ethical relativism's hostility to human rights?\n(A) Utilitarianism\n(B) Communitarianism.\n(C) Cognitivism.\n(D) Positivism.", "output": "(C)"}
{"input": "According to Hobbes, peace is the first law of nature because of which of the following situations?\n(A) Without peace everyone has a right to everything - including another's life.\n(B) Peace is possible only after war.\n(C) Law cannot achieve peace.\n(D) The social contract cannot be entered into unless there is peace.", "output": "(A)"}
{"input": "Adherence to precedent is called the doctrine of ________.\n(A) nolo contendere\n(B) stare decisis\n(C) substantial performance\n(D) commercial impracticability", "output": "(B)"}
{"input": "The ________ School believes that promoting market efficiency should be the central goal of legal decision-making.\n(A) Law and Economics\n(B) Critical Legal Studies\n(C) Historical\n(D) Natural Law", "output": "(A)"}
{"input": "Which statement below is the least likely to follow logically from Dworkin's notion of law as integrity?\n(A) It is likely to generate more individual rights and greater liberty.\n(B) It renders a community more genuine.\n(C) It opens the door to authoritarianism.\n(D) It improves the moral justification for the exercise of political power.", "output": "(C)"}
{"input": "Which of the following best describes Dworkin's distinction between principles and policies?\n(A) Principles are legislative, policies are precedents.\n(B) Principles describe rights, policies describe duties.\n(C) Principles are democratic, policies are autocratic.\n(D) Principles describe rights, policies describe goals.", "output": "(D)"}
{"input": "Statutes are often called ________ law.\n(A) quasi\n(B) qualified\n(C) collaborated\n(D) codified", "output": "(D)"}
{"input": "In Justice for Hedgehogs Dworkin endorses 'Hume's principle'. What does he understand by this idea?\n(A) That there is no distinction between law and morality.\n(B) That there is a distinction between right and wrong.\n(C) That facts about the world or human nature cannot normally ordain what ought to be\n(D) That human rights are fundamentally unsound.", "output": "(C)"}
{"input": "Which description below most accurately captures the distinction between Gemeinschaft and Gesellschaft?\n(A) Gemeinschaft is democratic Gesellschaft, autocratic.\n(B) Gemeinschaft exists in civil society, Gesellschaft in civic society.\n(C) Gemeinschaft is a society based on community, Gesellschaft one based on association\n(D) Gemeinschaft refers to an open government, Gesellschaft to a lack of transparency.", "output": "(C)"}
{"input": "What does Dworkin mean by the 'semantic sting'?\n(A) The language of the law is generally unclear.\n(B) Lawyers' arguments usually concern language.\n(C) Judges are prey to linguistic misunderstanding.\n(D) The rule of recognition cannot fully account for legal validity.", "output": "(D)"}
{"input": "Why do the Scandinavian realists reject a metaphysical approach to law?\n(A) Because they regard empiricism as a more reliable method by which to understand the concept of law.\n(B) Because they have no interest in the operation of the legal system.\n(C) Because their approach is based on Bentham's sceptical account of the common law.\n(D) Because they prefer a natural law analysis of legal ideas.", "output": "(A)"}
{"input": "Catharine MacKinnon argues that since men dominate women, the question is ultimately one of power. Which proposition below is the most inconsistent with this argument?\n(A) Women can achieve equality through political pressure.\n(B) Equality is impossible because men define women as different.\n(C) The idea of 'woman' needs to be redefined.\n(D) The world is phallocentric and oppressive.", "output": "(A)"}
{"input": "Austin has been described as a 'naive empiricist.' Why?\n(A) Because he neglects the importance of morality.\n(B) Because his account of law is based on an anachronistic model of a legal system.\n(C) Because he conceives of laws in a pragmatic rather than a conceptual manner.\n(D) Because he overlooks the role of law in economic relations.", "output": "(C)"}
{"input": "Lex iniusta non est lex' has which of the following meanings?\n(A) The law is not valid unless it is formally enacted.\n(B) Law has lexical priority over morality.\n(C) An unjust law is not law.\n(D) No-one is above the law.", "output": "(C)"}
{"input": "Which statement best describes the nature and function of Kelsen's Grundnorm?\n(A) The ultimate source of a legal system's morality.\n(B) The rule that distinguishes norms from habits of obedience.\n(C) The constitution of a state.\n(D) A presupposition that facilitates our understanding of the legal system.", "output": "(D)"}
{"input": "What is the main reason why many Critical Race Theorists are hostile to concepts such as 'justice', 'neutrality', and 'truth'?\n(A) Because of their vagueness.\n(B) Because they have failed to produce racial justice.\n(C) Because they are unrelated to contemporary conditions.\n(D) Because these ideas are alien to most people of colour.", "output": "(B)"}
{"input": "The will theory of rights maintains that the enforcement of Y's duty requires the exercise of will by X. It assumes the correlativity of rights and duties. Which of the following succeeds in formulating the interest theory without this correlativity?\n(A) Regarding X's interest as directly related to Y's duty.\n(B) Accepting that conferring right means that the interest represented by that right ought to be recognized.\n(C) Treating an interest as the exercise of choice.\n(D) Asserting that X has a right whenever the protection of his interest is recognized as a reason for imposing duties -only when they are actually imposed.", "output": "(B)"}
{"input": "According to Malinowski, the Trobriand Islanders organized their society around what concept?\n(A) Conflict.\n(B) Love.\n(C) War.\n(D) Reciprocity.", "output": "(D)"}
