{"input": " This is where intermediaries are given exclusive rights to market the good or service within a defined 'territory', thus using a very limited number of intermediaries:\n(A) Exclusive.\n(B) Intensive.\n(C) Selective.\n(D) Direct.", "output": "(A)"}
{"input": " Providing free samples of perfumes (scent) in magazines is an example of which of the following?\n(A) Classical conditioning.\n(B) Operant conditioning.\n(C) Social learning.\n(D) Behavioural learning.", "output": "(A)"}
{"input": " Which of the following is the investigation of the hedonic consumption of products?\n(A) Social interaction perspective.\n(B) Functional utilization perspective.\n(C) Experiential consumption.\n(D) Brand management perspective.", "output": "(C)"}
{"input": " This is part of the communication process where receivers unpack the various components of the message, and begin to make sense and give the message meaning:\n(A) Encoding.\n(B) Decoding.\n(C) Transfer.\n(D) Noise.", "output": "(B)"}
{"input": "Conflict between sequential members in a distribution network, such as producers, distributor, and retailers, over such matters as carrying a particular range or price increases is referred to as:\n(A) Channel conflict.\n(B) Horizontal conflict.\n(C) Vertical conflict.\n(D) Supply chain conflict.", "output": "(C)"}
{"input": "Which of the following is not one of the categories of research design?\n(A) Exploratory research.\n(B) Descriptive research.\n(C) Causal research.\n(D) Desk research.", "output": "(D)"}
{"input": "When there are high levels of business failures and unemployment, the business cycle is said to be in which of the following phases?\n(A) Expansion\n(B) Peak\n(C) Recovery\n(D) Trough", "output": "(D)"}
{"input": " Information collected for the first time specifically for a marketing research study is called:\n(A) Secondary research.\n(B) Primary research.\n(C) Soft research.\n(D) Experimental research.", "output": "(B)"}
{"input": " Which type of research methods are designed to elicit responses to predetermined, standardized questions from many respondents?\n(A) Quantitative.\n(B) Qualitative.\n(C) Non-probability.\n(D) Probability.", "output": "(A)"}
{"input": " This operates algorithmically or using a mixture of algorithmic and human input to collect, index, store, and retrieve information on the web (e.g. web pages, images, information, and other types of files). It makes the information available to users in a manageable and meaningful way in response to a search query. This is referred to as:\n(A) Banner ads.\n(B) Pop-up ads.\n(C) A search engine.\n(D) Apps.", "output": "(C)"}
{"input": "The owners of independent gasoline stations in a community meet secretly and agree to keep their prices high to protect their profitability. If their plan is discovered and they are charged with a crime, they could be\n(A) found guilty under the Sherman Antitrust Act and face prison time\n(B) found guilty under the Magnuson-Moss Warranty Act and face large fines\n(C) found guilty under the Adamson Act and face prison time and fines\n(D) found not guilty because retailers are allowed to set their own price levels", "output": "(A)"}
{"input": "Which type of shop offers a range of grocery and household items that cater for last-minute purchase needs of consumers?\n(A) Supermarkets.\n(B) Convenience stores.\n(C) Category-killer stores.\n(D) Limited line retailers.", "output": "(B)"}
{"input": " Which of the following is best understood as a period of time during which a customer interacts directly with a service?\n(A) Good usage.\n(B) Servicescape.\n(C) Service mix.\n(D) Service encounters.", "output": "(D)"}
{"input": " Many brands are deliberately imbued with human characteristics, to the point that they are identified as having particular personalities. This is referred to as:\n(A) Branding pyramid.\n(B) Brand value.\n(C) Brand names.\n(D) Brand personalities.", "output": "(D)"}
{"input": "Which of the following is the name for a coupon that is included in a package for later purchase?\n(A) a free-standing coupon\n(B) an instant-redemption coupon\n(C) a bounce-back coupon\n(D) a rebate coupon", "output": "(C)"}
{"input": "AIDA stands for awareness, ________, desire and _________.\n(A) Interest; action.\n(B) Intensity; appeal.\n(C) Involvement; action.\n(D) Involvement; appeal.", "output": "(A)"}
{"input": " ________________ is a process that leads to specific decisions on how to compete in the marketplace and how the company should best serve its customers.\n(A) Portfolio analysis.\n(B) Environmental scanning.\n(C) Strategic marketing.\n(D) Marketing research.", "output": "(C)"}
{"input": " ________________is used to influence the way an organization is perceived by various groups of stakeholders.\n(A) Direct marketing.\n(B) Public relations.\n(C) Sale promotion.\n(D) Advertising", "output": "(B)"}
{"input": " What type of media helps advertisers demonstrate the benefits of using a particular product and can bring life and energy to an advertiser's message?\n(A) Broadcast media.\n(B) Interactive media.\n(C) Print media.\n(D) Support media.", "output": "(A)"}
{"input": "Marketers usually decide whether to conduct marketing research study internally or through an outside organization based on certain criteria. Which of the following criterion is not used?\n(A) Whether the study offers value for money.\n(B) The agency's reputation.\n(C) The likelihood that the research design will provide insights into the management problem.\n(D) The size of the agency.", "output": "(D)"}
