{"input": "What does Milton Friedman believe to be the sole responsibility of business?\n(A) The only social responsibility of business is to its shareholders\n(B) Managers should act in ways that balance the interest of society and shareholders\n(C) The primary responsibility organizations have is to its employees\n(D) The primary responsibility organizations have is to its stakeholders", "output": "(A)"}
{"input": "_______ and _______ are both examples of _______ -based theories which are based on basic universal principles of right and wrong.\n(A) Ethics of duty, Ethics of rights and justice, Principle\n(B) Utilitarianism, Egoism, Principle\n(C) Ethics of duty, Utilitarianism, Consequentialist\n(D) Egoism, Ethics of rights and justice, Consequentialist", "output": "(A)"}
{"input": "_______ is the term used to describe the ongoing approval and acceptance of a company's activities by society, especially among local communities and civil societies.\n(A) Enlightened self interest\n(B) Social licence to operate\n(C) Community approval\n(D) Supply chain responsibility", "output": "(B)"}
{"input": "Insider trading undermines the fiduciary relationship.\n(A) 1,2,3\n(B) 1,2,4\n(C) 2,3,4\n(D) 1,2,3,4", "output": "(B)"}
{"input": "Negative advertising, stealing or poaching customers and predatory pricing are all strategies employed by businesses described using the umbrella term ________.\n(A) Reasonable competitive behaviour\n(B) Swindles\n(C) Competitive tricks\n(D) Dirty tricks", "output": "(D)"}
{"input": "A corporation is ________ from its managers, employees, investors and customers. It therefore has _______ succession and also ________.\n(A) Indistinguishable, Perpetual, Does not own its own assets\n(B) Independent, Limited, Owns its own assets\n(C) Independent, Perpetual, Owns its own assets\n(D) Indistinguishable, Perpetual, Owns its own assets", "output": "(C)"}
{"input": "______ is the corporate role in governing citizenship rights for the individual\n(A) Political Corporate Social Responsibility\n(B) Triple Bottom Line\n(C) Sustainability\n(D) Corporate Citizenship", "output": "(D)"}
{"input": "What is the enlightened self-interest model of CSR?\n(A) That it is in an organization's own best interest to put itself first rather than its ethics\n(B) That it is in an organization's best interest to consider what a shareholder would want\n(C) That it is in an organization's own best interest to act in an ethical way\n(D) That it is in an organization's own best interest to follow the legislation and abide by the law", "output": "(C)"}
{"input": "______ are the obligations of workers towards their employer, based on individual contracts and wider employment laws.\n(A) Employee rights\n(B) Employee rights\n(C) Employer duties\n(D) Employee duties", "output": "(D)"}
{"input": "The state of being unable to make an informed, reasoned decision about a product purchase is known as?\n(A) Consumer inclusion\n(B) Consumer competence\n(C) Consumer exclusion\n(D) Consumer vulnerability", "output": "(D)"}
{"input": "Healthy eating, particularly relating to sugar and salt consumption, food and packaging waste and supply chain CO2 emissions are all business ethics issues facing the ________.\n(A) Supermarket industry\n(B) Chemicals industry\n(C) Construction industry\n(D) Information and mobile technology industry", "output": "(A)"}
{"input": " Although the benefit and contribution of civil society in encouraging sustainability, lobbying on important issues and helping the needy are taken for granted in many places, in many other countries, such as _____ and ______ civil society is far less developed than in, for instance, _______.\n(A) Russia, China, Britain\n(B) Norway, China, Russia\n(C) Britain, United States, Australia\n(D) Canada, Russia, United States", "output": "(A)"}
{"input": "Typical advertising regulatory bodies suggest, for example that adverts must not: encourage _________, cause unnecessary ________ or _____, and must not cause _______ offence.\n(A) Unsafe practices, Wants, Fear, Trivial\n(B) Unsafe practices, Distress, Fear, Serious\n(C) Safe practices, Wants, Jealousy, Trivial\n(D) Safe practices, Distress, Jealousy, Serious", "output": "(B)"}
{"input": "The so-called BRIC countries (Brazil, Russia, India and _______) tend to follow a __________ approach to corporate governance. However, recently this has tended to move towards more _______-based mechanisms.\n(A) Canada, Market, Relationship\n(B) China, Market, Relationship\n(C) Canada, Relationship, Market\n(D) China, Relationship, Market", "output": "(D)"}
{"input": "The Private Sector Social Enterprise Model.\n(A) 1,2,4\n(B) 2,3,4\n(C) 1,2,3,4\n(D) 1,2,3", "output": "(D)"}
{"input": "In a business to business context, conflicts of interest can arise in two main ways: conflict of _______ and _______ interests, which might arise, for example, when a firm is hired as a supplier of professional services by another firm or conflict of _________ and ________ interests, such as where an individual's interests may conflict with that of their employer.\n(A) Professional, Organizational, Personal, Organizational\n(B) Professional, Individual, Personal, Organizational\n(C) Individual, Organizational, Organizational, Professional\n(D) Individual, Professional, Organizational, Personal", "output": "(A)"}
{"input": "The ___________, otherwise known as _________ was launched in 1997 and is a global workplace standard that covers key labour rights such as working hours, forced labour and discrimination, with compliance being certified by independent auditors.\n(A) Social accountability standard, SA 8000\n(B) Social accountability standard, SA 9000\n(C) Sarbanes-Oxley Act, SA 8000\n(D) Sarbanes-Oxley Act, SA 9000", "output": "(A)"}
{"input": "Businesses engage in social accounting due to demands from _________, in order to identify ________, to improve ___________ and to encourage _________ and ___________\n(A) Stakeholders, Risks, Stakeholder management, Accountability, Transparency\n(B) Stakeholders, Accountability, Transparency, Risks, Stakeholder Management\n(C) Stakeholders, Accountability, Risks, Stakeholders, Stakeholder Management\n(D) Stakeholders, Stakeholder Management, Transparency, Risks, Accountability", "output": "(A)"}
{"input": "When the true cost an item is deliberately obscured by a company this is known as?\n(A) Predatory pricing\n(B) Deceptive pricing\n(C) Price fixing\n(D) Skimming", "output": "(B)"}
{"input": "Which of the following would most effectively act as the primary objective of a business organisation?\n(A) To make a profit\n(B) To procure resources\n(C) To communicate with shareholders\n(D) To mediate between the organisation and the environment", "output": "(A)"}
