{"input": "Steve follows Fred's example in everything. He influences him hugely. What does the pronoun \"He\" refer to?\n(A) Steve\n(B) Fred", "output": "(B)"}
{"input": "Beth didn't get angry with Sally, who had cut her off, because she stopped and apologized. What does the pronoun \"she\" refer to?\n(A) Beth\n(B) Sally", "output": "(B)"}
{"input": "Tom threw his schoolbag down to Ray after he reached the top of the stairs. What does the pronoun \"he\" refer to?\n(A) Tom\n(B) Ray", "output": "(A)"}
{"input": "Jane knocked on the door, and Susan answered it. She invited her to come out. What does the pronoun \"She\" refer to?\n(A) Jane\n(B) Susan", "output": "(A)"}
{"input": "Kirilov ceded the presidency to Shatov because he was less popular. What does the pronoun \"he\" refer to?\n(A) Kirilov\n(B) Shatov", "output": "(A)"}
{"input": "Dr. Adams informed Kate that she had retired and presented several options for future treatment. What does the pronoun \"she\" refer to?\n(A) Dr. Adams\n(B) Kate", "output": "(A)"}
{"input": "Sam Goodman's biography of the Spartan general Xenophanes conveys a vivid sense of the difficulties he faced in his childhood. What does the pronoun \"he\" refer to?\n(A) Goodman\n(B) Xenophanes", "output": "(B)"}
{"input": "The foxes are getting in at night and attacking the chickens. I shall have to guard them . What does the pronoun \"them\" refer to?\n(A) The foxes\n(B) The chickens", "output": "(B)"}
{"input": "The woman held the girl against her chest What does the pronoun \"her\" refer to?\n(A) The woman\n(B) The girl", "output": "(A)"}
{"input": "I put the cake away in the refrigerator. It has a lot of leftovers in it. What does the pronoun \"It\" refer to?\n(A) The cake\n(B) The refrigerator", "output": "(B)"}
{"input": "Bob collapsed on the sidewalk. Soon he saw Carl coming to help. He was very concerned. What does the pronoun \"He\" refer to?\n(A) Bob\n(B) Carl", "output": "(B)"}
{"input": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but they came out looking more like telephone poles. What does the pronoun \"they\" refer to?\n(A) lemons\n(B) lemon trees", "output": "(B)"}
{"input": "I took the water bottle out of the backpack so that it would be lighter. What does the pronoun \"it\" refer to?\n(A) The water bottle\n(B) The backpack", "output": "(B)"}
{"input": "Mary tucked her daughter Anne into bed, so that she could work. What does the pronoun \"she\" refer to?\n(A) Mary\n(B) Mary's daughter", "output": "(A)"}
{"input": "Susan knew that Ann's son had been in a car accident, so she told her about it. What does the pronoun \"she\" refer to?\n(A) Susan\n(B) Ann", "output": "(A)"}
{"input": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked it down. What does the pronoun \"it\" refer to?\n(A) The sand castle\n(B) The flag", "output": "(A)"}
{"input": "Carol believed that Rebecca regretted that she had stolen the watch. What does the pronoun \"she\" refer to?\n(A) Carol\n(B) Rebecca", "output": "(B)"}
{"input": "I'm sure that my map will show this building; it is very famous. What does the pronoun \"it\" refer to?\n(A) The map\n(B) The building", "output": "(B)"}
{"input": "Fred covered his eyes with his hands, because the wind was blowing sand around. He opened them when the wind stopped. What does the pronoun \"them\" refer to?\n(A) His eyes\n(B) His hands", "output": "(A)"}
{"input": "Joe's uncle can still beat him at tennis, even though he is 30 years younger. What does the pronoun \"he\" refer to?\n(A) Joe\n(B) Joe's uncle", "output": "(A)"}
{"input": "The sack of potatoes had been placed below the bag of flour, so it had to be moved first. What does the pronoun \"it\" refer to?\n(A) The sack of potatoes\n(B) The bag of flour", "output": "(B)"}
{"input": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, he was twelve months old. What does the pronoun \"he\" refer to?\n(A) Fred\n(B) My father", "output": "(B)"}
{"input": "As Ollie carried Tommy up the long winding steps, his legs dangled. What does the pronoun \"his\" refer to?\n(A) Ollie\n(B) Tommy", "output": "(B)"}
{"input": "Joe's uncle can still beat him at tennis, even though he is 30 years older. What does the pronoun \"he\" refer to?\n(A) Joe\n(B) Joe's uncle", "output": "(B)"}
{"input": "The police arrested all of the gang members. They were trying to run the drug trade in the neighborhood. What does the pronoun \"They\" refer to?\n(A) The police\n(B) The gang members", "output": "(B)"}
{"input": "As Andrea in the crop duster passed over Susan, she could see the landing strip. What does the pronoun \"she\" refer to?\n(A) Andrea\n(B) Susan", "output": "(A)"}
{"input": "The actress used to be named Terpsichore, but she changed it to Tina a few years ago, because she figured it was easier to pronounce. What does the pronoun \"it\" refer to?\n(A) Terpsichore\n(B) Tina", "output": "(B)"}
{"input": "The customer walked into the bank and stabbed one of the tellers. He was immediately taken to the police station. What does the pronoun \"He\" refer to?\n(A) The customer\n(B) The teller", "output": "(A)"}
{"input": "At the Loebner competition the judges couldn't figure out which respondents were the chatbots because they were so advanced. What does the pronoun \"they\" refer to?\n(A) the judges\n(B) the chatbots", "output": "(B)"}
{"input": "Bill passed the half-empty plate to John because he was full. What does the pronoun \"he\" refer to?\n(A) Bill\n(B) John", "output": "(A)"}
{"input": "I put the heavy book on the table and it broke. What does the pronoun \"it\" refer to?\n(A) The heavy book\n(B) The table", "output": "(B)"}
{"input": "Jane knocked on the door, and Susan answered it. She invited her to come in. What does the pronoun \"She\" refer to?\n(A) Jane\n(B) Susan", "output": "(B)"}
{"input": "The firemen arrived before the police because they were coming from so far away. What does the pronoun \"they\" refer to?\n(A) The firemen\n(B) The police", "output": "(B)"}
{"input": "During a game of tag, Ethan ran from Luke because he was \"it\". What does the pronoun \"he\" refer to?\n(A) Ethan\n(B) Luke", "output": "(B)"}
{"input": "Paul tried to call George on the phone, but he wasn't available. What does the pronoun \"he\" refer to?\n(A) Paul\n(B) George", "output": "(B)"}
{"input": "Sid explained his theory to Mark but he couldn't understand him. What does the pronoun \"he\" refer to?\n(A) Sid\n(B) Mark", "output": "(B)"}
{"input": "John promised Bill to leave, so an hour later he left. What does the pronoun \"he\" refer to?\n(A) John\n(B) Bill", "output": "(A)"}
{"input": "The city councilmen refused the demonstrators a permit because they feared violence. What does the pronoun \"they\" refer to?\n(A) The city councilmen\n(B) The demonstrators", "output": "(A)"}
{"input": "George got free tickets to the play, but he gave them to Eric, even though he was particularly eager to see it. What does the pronoun \"he\" refer to?\n(A) George\n(B) Eric", "output": "(A)"}
{"input": "In July, Kamtchatka declared war on Yakutsk. Since Yakutsk's army was much better equipped and ten times larger, they were defeated within weeks. What does the pronoun \"they\" refer to?\n(A) Kamchatka\n(B) Yakutsk", "output": "(A)"}
{"input": "Since it was raining, I carried the newspaper in my backpack to keep it dry. What does the pronoun \"it\" refer to?\n(A) The newspaper\n(B) The backpack", "output": "(A)"}
{"input": "Fred is the only man still alive who remembers my great-grandfather. He is a remarkable man. What does the pronoun \"He\" refer to?\n(A) Fred\n(B) My great-grandfather", "output": "(A)"}
{"input": "Frank was upset with Tom because the toaster he had bought from him didn't work. What does the pronoun \"he\" refer to?\n(A) Frank\n(B) Tom", "output": "(A)"}
{"input": "The fish ate the worm. It was tasty. What does the pronoun \"It\" refer to?\n(A) The fish\n(B) The worm", "output": "(B)"}
{"input": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because they are snobs. What does the pronoun \"they\" refer to?\n(A) Sam and Amy\n(B) Amy's parents", "output": "(B)"}
{"input": "Sam pulled up a chair to the piano, but it was broken, so he had to stand instead. What does the pronoun \"it\" refer to?\n(A) The chair\n(B) The piano", "output": "(A)"}
{"input": "I couldn't put the pot on the shelf because it was too tall. What does the pronoun \"it\" refer to?\n(A) The pot\n(B) The shelf", "output": "(A)"}
{"input": "Alice looked for her friend Jade in the crowd. Since she always wears a red turban, Alice spotted her quickly. What does the pronoun \"she\" refer to?\n(A) Alice\n(B) Jade", "output": "(B)"}
{"input": "Bill passed the gameboy to John because his turn was next. What does the pronoun \"his\" refer to?\n(A) Bill\n(B) John", "output": "(B)"}
{"input": "Sid explained his theory to Mark but he couldn't convince him. What does the pronoun \"he\" refer to?\n(A) Sid\n(B) Mark", "output": "(A)"}
