{"input": "Anecdotal evidence is a specific kind of\n(A) False sign\n(B) False criteria\n(C) False cause\n(D) Hasty Generalization", "output": "(D)"}
{"input": "Tan ah Tiat, forty-nine years old, a native of Kuala Lumpar, Malaysia, was charged with possession of opium. Arguing for acquittal, he told the judge that his opium habit did no harm, as he was too old to work anyway. Asked how he lived, he replied that he lived on the earnings of his grandmother.\n(A) Straw Man\n(B) False Dilemma\n(C) Inconsistency\n(D) Appeal to Authority", "output": "(C)"}
{"input": "Including more than one claim in a proposition may lead to which of the following fallacies?\n(A) Complex question\n(B) Appeal to ignorance\n(C) Compound proposition\n(D) Extension", "output": "(C)"}
{"input": "Whether someone is hypocritical regarding her claims is...\n(A) Irrelevant to her character\n(B) Evidence that the claims are false\n(C) Irrelevant to the truth of the claims\n(D) Relevant only in court", "output": "(C)"}
{"input": "E.F. Schumacher, famous economist, in an article in the Atlantic (April 1979): Fifteen months [after I had advised that rural India should have a technology intermediate between the hoe and the tractor,] an all-India conference on intermediate technology was arranged. (They still didn't like the term [intermediate], so they called it appropriate technology. That's all right: when I come to India and somebody says, \"Oh, Mr. Schumacher, I don't believe in appropriate technology\", I just look him straight in the face and say, \"Oh, that's splendid. Do you believe in inappropriate technology?\")\n(A) Equivocation\n(B) Inconsistency\n(C) Appeal to Authority\n(D) Prejudicial Language", "output": "(A)"}
{"input": "If you argued something is flawed because it fails to do something, when it was never intended to do that, you may have committed which of the following fallacies?\n(A) ad ignorantium\n(B) Many questions\n(C) Extension\n(D) Compound proposition", "output": "(C)"}
{"input": "Which of the following describes the fallacy of appeal to tradition?\n(A) reasoning that a claim must be true because it's been made so often\n(B) reasoning that a claim must be true because a regular person believes it\n(C) reasoning that a claim must be true because it's been believed in the past\n(D) reasoning that a claim must be true because a lot of people believe it", "output": "(C)"}
{"input": "The complex proposition fallacy involves\n(A) including more than one claim in the proposition and treating proof for one claim as proof for all the claims.\n(B) asking a question that includes either an unproven assumption or more than one question, thus making a straightforward yes or no answer meaningless.\n(C) arguing that a claim must be true because there is no evidence that it is false.\n(D) arguing something is inferior just because it doesn't do something it was never intended to do.", "output": "(A)"}
{"input": "Which of the following best describes the fallacy of poisoning the well?\n(A) a way of suppressing evidence that eliminates a source of evidence from consideration by claiming the source is flawed, when there is no true relationship between the alleged flaw and the reliability of the source\n(B) arguing that a claim should be accepted based on evidence that is not presented, but asserted to be well known or obvious.\n(C) arguing something should be done based only on evidence that it's been done that way in the past, or should be believed only because it's been believed for a long time.\n(D) reasoning that a claim is true based only on the evidence that it has been made so often.", "output": "(A)"}
{"input": "Which of the following best describes the snob appeal fallacy?\n(A) reasoning that a claim is true based only on the evidence that it has been made so often.\n(B) arguing someone should accept a claim based only on the evidence that he or she has the favorable characteristics to understand the truth of the claim.\n(C) arguing a claim should be accepted based only on evidence that unidentified authorities accept it.\n(D) arguing that someone should accept an idea or product based only on evidence that prestigious people accept it, or that non-prestigious people reject it.", "output": "(D)"}
{"input": "If you think that someone's argument is strong based on their compelling use of language and confident delivery, you've probably committed which fallacy?\n(A) Amphiboly\n(B) Equivocation\n(C) Special pleading\n(D) Style over substance", "output": "(D)"}
{"input": "The appeal to anonymous authority fallacy consists of\n(A) reasoning that an act or series of acts should be carried out because they will have no significant consequences, when there is no evidence there will be no consequences.\n(B) arguing that a claim should be accepted based on the evidence that a large number of people accept it\n(C) arguing that something should be done because it has been done in the past\n(D) arguing a claim should be accepted based only on the assertion that unidentified authorities accept it", "output": "(D)"}
{"input": "A syllogism that is formally invalid\n(A) cannot be materially true\n(B) might be materially true\n(C) might be materially untrue\n(D) both B and C", "output": "(D)"}
{"input": "Fallacies can be psychologically persuasive even though they are...\n(A) Psychologically impotent\n(B) Logically flawed\n(C) Deductively valid\n(D) Inductively valid", "output": "(B)"}
{"input": "If you say an opposing arguer has taken a position that you can easily defeat, when he or she has not taken that position, then you go on to defeat that position and claim to have done significant damage to that arguer's overall argument, you are probably guilty of which of the following fallacies?\n(A) genetic fallacy\n(B) appeal to emotions\n(C) straw person\n(D) ignorance of refutation", "output": "(C)"}
{"input": "Given the following major premise, which of the following minor premises could lead to a valid conclusion?\n\n\"Either I'm going to do well on this test or I'm going to be mad.\"\n(A) \"I won't do well on the test\"\n(B) \"I won't take the test\"\n(C) \"My birthday is today\"\n(D) both A and B", "output": "(A)"}
{"input": "We're perfectly entitled to believe there is a God. After all, every effort by atheists to prove otherwise has failed.\n(A) Appeal to Authority\n(B) Denying the Antecedent\n(C) Attacking the Person (ad hominem)\n(D) Argument from Ignorance", "output": "(D)"}
{"input": "Which of the statements below is correct about the following argument?\n\n\"If the sky is blue there won't be rain. The sky is blue today. Therefore, there won't be rain.\"\n(A) It is a formally valid categorical syllogism\n(B) It is a formally invalid disjunctive syllogism\n(C) It is a formally valid conditional syllogism\n(D) It is a formally invalid conditional syllogism", "output": "(C)"}
{"input": "The appeal to joy fallacy involves\n(A) arguing that someone should do something based only on the assertion that it will make him or her feel happier\n(B) causing confusion during refutation because of a lack of ability to engage in refutation\n(C) arguing for a conclusion based only on feeling sorry for someone when that feeling is irrelevant to the conclusion\n(D) arguing someone should do something only because other people will like him or her for doing it", "output": "(A)"}
{"input": "Asking a question that includes an unproven assumption may lead to which of the following fallacies?\n(A) Appeal to ignorance\n(B) Extension\n(C) a priori\n(D) Complex question", "output": "(D)"}
