{"input": "What is the judge ad hoc?\n(A) If a party to a contentious case before the ICJ does not have a national sitting as judge, it is entitled to nominate someone as a judge solely for that case, with the title of judge ad hoc\n(B) Judge ad hoc is the member of the bench of the ICJ with a casting vote\n(C) Judge ad hoc is a surrogate judge, in case a judge is disqualified or passes away\n(D) Judge ad hoc is the judge that each party will always nominate in every contentious case", "output": "(A)"}
{"input": "Would a reservation to the definition of torture in the ICCPR be acceptable in contemporary practice?\n(A) This is an acceptable reservation if the reserving country's legislation employs a different definition\n(B) This is an unacceptable reservation because it contravenes the object and purpose of the ICCPR\n(C) This is an unacceptable reservation because the definition of torture in the ICCPR is consistent with customary international law\n(D) This is an acceptable reservation because under general international law States have the right to enter reservations to treaties", "output": "(B)"}
{"input": "When 'consent' can serve as a circumstance precluding the wrongfulness of a State conduct?\n(A) Consent can serve as a circumstance precluding the wrongfulness whenever it is given\n(B) Consent can never serve as a circumstance precluding wrongfulness\n(C) Consent can serve as a circumstance precluding wrongfulness, provided the consent is valid and to the extent that the conduct remains within the limits of the consent given\n(D) Consent can always serve as a circumstance precluding wrongfulness, no matter which organ of the State gives it", "output": "(C)"}
{"input": "How the consent to be bound of a State may be expressed?\n(A) The consent of a State to be bound is expressed only by ratification\n(B) The consent of a state to be bound by a treaty may be expressed by signature, ratification, acceptance, approval or accession\n(C) The consent of a State to be bound is expressed by signature\n(D) The consent of a State to be bound is expressed by whatever means they choose", "output": "(B)"}
