{"input": "What is required for a general rule of customary law to be formed?\n(A) Only general, widespread and consistent practice on the part of States is required\n(B) The consistent practice of few States is sufficient\n(C) The legal conviction that a certain practice of a State is in accordance with international law is the most significant requirement\n(D) Both the elements of widespread and consistent State practice and of the opinio juris are required", "output": "(D)"}
{"input": "Which of the following statements is inaccurate?\n(A) Proportionality is a means of balancing the rights of an individual against the protection of the community as a whole\n(B) For an act to be proportionate, it should be linked to the legitimate aim of the state measure complained of\n(C) Proportionality is the same as reasonableness\n(D) Proportionality should mean the state takes the least intrusive action that is necessary", "output": "(C)"}
{"input": "Can armed violence perpetrated by non-State actors ever amount to an armed attack under Article 51 UN Charter?\n(A) The conduct of non-State actors can never amount to an armed attack\n(B) The Caroline case serves as precedent that non-State actors can under particular circumstances commit an armed attack\n(C) There is no precedent in international law for the proposition that non-State actors can commit an armed attack\n(D) Non-State can both commit an armed attack and possess a right of self-defence under international law", "output": "(B)"}
{"input": "Which treaties are considered as 'source of international law' under article 38 ICJ Statute?\n(A) All treaties that are in force at the time of the dispute\n(B) Only the treaties that are in force and binding upon the parties to the dispute\n(C) All treaties that have been concluded between the parties to the dispute, regardless whether they are in force\n(D) Only treaties that are multilateral and of paramount significance", "output": "(B)"}
{"input": "What is the 'optional; clause' in the ICJ Statute?\n(A) Optional clause is the clause in the ICJ Statute, which provides for the applicable law, according to the intention of the parties\n(B) Optional clause determines the intention of the parties to accept that the decision of the Court will be final and binding\n(C) Optional clause is the declaration deposited by a State, whereby it accepts the jurisdiction of the Court in respect of international legal disputes in relation to any other State accepting the same obligation.\n(D) Optional clause is the clause that the parties deposit, which sets out the procedure of the written and oral pleadings", "output": "(C)"}
