{"input": "When a reservation is considered as invalid under the law of treaties?\n(A) A reservation is invalid when the majority of the State parties objects to it\n(B) A reservation is invalid only when an international tribunal says so\n(C) A reservation is invalid only when is incompatible with a peremptory norm of international law (jus cogens)\n(D) A reservation is invalid when it is incompatible with the object and purpose of the treaty", "output": "(D)"}
{"input": "What is the fundamental premise of monist theory?\n(A) Monism posits that international law is superior to domestic laws\n(B) Monism posits that international and domestic law are part of the same legal order\n(C) Monism posits that domestic laws are superior to international law\n(D) Monism posits that domestic and international law never clash", "output": "(B)"}
{"input": "What is the meaning of cultural relativism?\n(A) Culture relativism posits that human rights apply equally to all without restrictions\n(B) Culture relativism posits that human rights have a cultural origin\n(C) Cultural relativism posits that the application of human rights is relative to the laws in each nation\n(D) Cultural relativism posits that local culture should validate the existence and practice of all human rights", "output": "(D)"}
{"input": "What is the constitutive theory of recognition?\n(A) Recognition is determinative of statehood\n(B) Recognition requires constitutional approval by third nations\n(C) Recognition requires that the constitution of the recognised State includes sufficient human rights guarantees\n(D) Countries wishing to be recognised must possess a valid constitution", "output": "(A)"}
{"input": "What is the difference between conciliation and mediation?\n(A) Conciliation is the continuation of mediation with the difference that conciliation produces a binding result, while mediation not\n(B) Conciliation is conducted exclusively by representatives of the UN Secretary-General, while mediation may also be conducted by third States' officials\n(C) Mediation is usually conducted by a person appointed with the consent of the parties, while conciliation involves a commission, which proceeds to an impartial examination of the dispute and proposes settlement terms\n(D) Conciliation is a method of dispute settlement pursued only by virtue of a treaty, while mediation may also be on an ad hoc basis", "output": "(C)"}
{"input": "Who is entitled to request an advisory opinion of the ICJ?\n(A) Only the principal organs of the UN may request an advisory opinion (Security Council, General Assembly, ECOSOC, Trusteeship Council, Secretariat)\n(B) All international organizations may request an advisory opinion\n(C) The General Assembly and the Security Council may request advisory opinions on any legal question, as well as 'other organs of the United Nations and specialized agencies, which may at any time be so authorized by the General Assembly, may also request advisory opinions of the Court on legal questions arising within the scope of their activities'\n(D) The principal organs of the UN may request an advisory opinion as well as the State that have been authorized by the General Assembly", "output": "(C)"}
{"input": "Who is an 'injured State' in the law of international responsibility?\n(A) A State is 'injured' in case that it has suffered a damage from the internationally wrongful conduct\n(B) A State is 'injured' in cases that there has been a violation of a peremptory norm of international law\n(C) A State is 'injured' should it acknowledge the existence of the internationally wrongful conduct\n(D) A State is 'injured' if the obligation breached was owed to it individually or if it was owed to a group of States, including that State, and it was specially affected", "output": "(D)"}
{"input": "What is the effects doctrine?\n(A) It posits that jurisdiction exists only when it is effective\n(B) The effects doctrine serves to confer jurisdiction on the State which has an effective link with the harmful conduct\n(C) The effects doctrine serves to confer jurisdiction on the State sharing the nationality of the offender\n(D) The effects doctrine serves to confer jurisdiction to the State on whose territory the conduct produces effects", "output": "(D)"}
{"input": "What is the 'Lotus principle'?\n(A) The so-called Lotus principle is that 'restrictions upon the independence of States cannot therefore be presumed', or, as it has been construed, 'whatever is not prohibited is permitted in international law'\n(B) The so-called Lotus principle is that States are free to choose the Court that they will submit their disputes\n(C) The so-called Lotus principle is that States are not prohibited to assert their enforcement jurisdiction on the high seas\n(D) The so-called Lotus principle is that customary law derives from the combination of State practice and opinio juris", "output": "(A)"}
{"input": "What is the meaning of \"act of State\" doctrine?\n(A) The act of State doctrine denotes that all State acts attract immunity\n(B) The act of State doctrine denotes that the assessment as to the existence of an alleged tort committed by a State belongs to the executive and not the courts\n(C) The act of State doctrine denotes that the courts are well placed to assess the existence of an alleged tort committed by the State\n(D) The act of State doctrine is a legal mechanism that allows the courts to provide immunity to public acts of foreign States", "output": "(B)"}
{"input": "What is the meaning of collective security?\n(A) The right to self-defence by more than one nation acting in concert\n(B) The right of one's allies to defend the victim State\n(C) The authorisation of armed force by the UN Security Council\n(D) The authorisation of peacekeeping missions by the UN General Assembly", "output": "(C)"}
{"input": "Which of the following types of rights have been described as first generation rights?\n(A) Social and economic rights\n(B) Civil and political rights\n(C) Cultural rights\n(D) People's rights", "output": "(B)"}
{"input": "What is the legal nature of the Universal Declaration of Human Rights (UDHR)?\n(A) The UDHR is a multilateral treaty\n(B) The UDHR is a UN General Assembly resolution\n(C) The UDHR is a UN Security Council resolution\n(D) The UDHR is a declaration adopted by several States at an international conference", "output": "(B)"}
{"input": "Do individuals (physical) persons enjoy international legal personality in the same manner as States and international organisations?\n(A) Individuals enjoy international legal personality, but this is limited\n(B) Individuals enjoy unlimited international legal personality\n(C) Individuals do not enjoy any international legal personality\n(D) Individuals can only bring claims before international courts", "output": "(A)"}
{"input": "What does the doctrine of incorporation suggest in respect of treaties?\n(A) The doctrine of incorporation requires that all treaties undergo legislative transformation before they become domestic law\n(B) The doctrine of incorporation does not require any further action at the domestic level\n(C) The doctrine of incorporation treats treaties as inferior to domestic law\n(D) The doctrine of incorporation suggests that ratified treaties automatically pass into the sphere of domestic law", "output": "(D)"}
{"input": "Which one of the statements below is false?\n(A) The war crimes trials at Nuremberg and Tokyo took place immediately after the First World War\n(B) The war crimes trials introduced a 'crime against humanity' as an offence\n(C) The war crimes trials held individuals legally responsible for acts such as war crimes and crimes against humanity\n(D) The war crimes trials found that \"superior orders\" could not be used as a defence for war crimes or crimes against humanity", "output": "(A)"}
{"input": "Is extra-territorial abduction a ground for refusal of otherwise lawful jurisdiction by English courts?\n(A) Such abduction constitutes abuse of process and leads to a stay of proceedings\n(B) Such abduction gives rise to the abductor's liability but does not lead to a stay of proceedings\n(C) The stay of proceedings under such circumstances would prevent the administration of justice in respect of international criminals\n(D) The courts may, but will seldom, stay proceedings in cases of extra-territorial abduction", "output": "(A)"}
{"input": "What is the value of the Resolutions of the UN General Assembly in terms as a 'source' of international law?\n(A) GA Resolutions are considered as additional sources of international law and thus binding upon States\n(B) GA Resolutions are equivalent to treaties\n(C) GA Resolutions reflect always customary law\n(D) GA Resolutions are considered as material source, in the sense that they may enunciate statements of customary law", "output": "(D)"}
{"input": "What is the principal source of immunity in respect of international organisations (IOs)?\n(A) The principal source of immunity for IOs is the UN Charter\n(B) The principal sources of immunity for IOs are headquarters agreements and multilateral treaties providing specific immunities\n(C) The principal source of immunity for IOs is customary law\n(D) The principal source of immunity for IOs is the Vienna Convention on Diplomatic Immunities", "output": "(B)"}
{"input": "What is jus cogens?\n(A) They are peremptory norms of international law, from which no derogations are allowed and which can never be altered even with the consent of the States\n(B) They are rules of international law that are laid down in multilateral treaties with a wide participation\n(C) They are the decisions of the UN Security Council\n(D) They are the rules of international law on which the ICJ founds its decisions", "output": "(A)"}
