{"input": "Hardy-Weinberg equilibrium generally assumes all of the following EXCEPT\n(A) a large population\n(B) genetic drift\n(C) random mating\n(D) absence of selection", "output": "(B)"}
{"input": "All of the following might be found in connective tissue EXCEPT\n(A) thrombin\n(B) glycosaminoglycans\n(C) collagens\n(D) fibroblasts", "output": "(A)"}
{"input": "Experiments on song development in birds have shown that when a young male reared in isolation hears only the song of a different bird species, he will develop an adult song repertoire that lacks certain characteristics typical of his own species. This result shows that the song of his species is most likely\n(A) entirely learned during development\n(B) entirely instinctive\n(C) both instinctive and learned\n(D) dependent upon hormones for proper development", "output": "(C)"}
{"input": "The concept of punctuated equilibrium refers to\n(A) oscillating ecological successional stages\n(B) ecological succession arrested by sudden environmental changes, e.g., fire\n(C) persistent predator-prey relationships in relatively stable environments\n(D) bursts of speciation followed by relatively unchanging lineages", "output": "(D)"}
{"input": "A quote from a natural resources text states: \"Whenever the original ecosystem becomes restructured by man, it tends to become simplified, with a resultant disruption of the stabilizing influences of density-dependent regulatory factors.\" This implies that in a disturbed ecosystem\n(A) there exist large populations of a low number of species\n(B) population levels of a species are kept at equilibrium through natural regulatory mechanisms\n(C) a given prey organism is subject to higher predation rates by more diverse predators\n(D) a given prey organism is less likely to undergo a population surge", "output": "(A)"}
{"input": "The ability of the brain to detect differences in stimulus intensity is best explained by the fact that which of the following varies with the stimulus intensity?\n(A) The amplitude of the action potential\n(B) The threshold potential\n(C) The number of action potentials per second\n(D) The number of synapses crossed", "output": "(C)"}
{"input": "All of the following statements about plant embryogenesis are correct EXCEPT:\n(A) The suspensor is derived from the basal cell.\n(B) Cotyledons are derived from the apical cell.\n(C) Shoot apical meristem formation occurs after seed formation.\n(D) Precursors of all three plant tissue systems are formed during embryogenesis.", "output": "(C)"}
{"input": "Which of the following is typically NOT found in normal somatic cells of a human male?\n(A) The entire genetic information possessed by the original zygote\n(B) An inactivated X chromosome\n(C) Forty-four autosomes\n(D) A diploid nucleus", "output": "(B)"}
{"input": "Root pressure created by a plant's roots causes water to enter the roots by\n(A) translocation\n(B) adhesion\n(C) osmosis\n(D) capillary action", "output": "(C)"}
{"input": "Stabilization of the unique coiled structure of an alpha helix in a protein is primarily attributed to (A) hydrogen bonding between the peptide backbone atoms\n(A) hydrogen bonding between the peptide backbone atoms\n(B) disulfide bridges between cysteine side chains\n(C) carbohydrate moieties attached to polar amino acids\n(D) peptide linkages that covalently bond amino acids", "output": "(A)"}
{"input": "The first point of entry of water at the roots of a monocot plant is through the cytoplasm of cells of the\n(A) root cap\n(B) Casparian strip\n(C) pericycle\n(D) endoderm", "output": "(D)"}
{"input": "Which of the following factors does NOT promote linkage disequilibrium?\n(A) Asexual reproduction\n(B) Coadapted gene complexes\n(C) Epistasis\n(D) Random mating", "output": "(D)"}
{"input": "Targeting of a newly synthesized protein is most likely to require two different signal peptides for which of the following destinations?\n(A) Plasma membrane\n(B) Lysosome\n(C) Cytosol\n(D) Chloroplast", "output": "(D)"}
{"input": "Nerve outgrowth from a developing neuron begins at the growth cone, located at the tip of the axon. Microspikes of the growth cone extend and retract in order to move the growth cone forward. Exposure of the neuron to cytochasalin B at this stage of development causes\n(A) microtubules in the axon to undergo reversible dissociation\n(B) microtubules in the axon to undergo irreversible dissociation\n(C) microfilaments in the microspike to undergo reversible depolymerization\n(D) microfilaments in the microspike to undergo irreversible depolymerization", "output": "(C)"}
{"input": "The sight organs of crustaceans and insects contain ommatidia, which make up the individual visual units of the\n(A) eyespot\n(B) simple eye\n(C) compound eye\n(D) binocular eye", "output": "(C)"}
{"input": "Cell motility, as viewed in a cultured fibroblast, encompasses all of the following EXCEPT\n(A) adhesion plaques\n(B) vinculin\n(C) clathrin\n(D) lamellipodia", "output": "(C)"}
{"input": "All of the following may serve as intracellular messengers EXCEPT\n(A) calcium ions\n(B) cAMP\n(C) acetylcholine\n(D) inositol 1,4,5-triphosphate", "output": "(C)"}
{"input": "Proteins were shown to move about in a plane of the plasma membrane when mouse cellsurface proteins and human cell-surface proteins were observed to integrate along a fused mouse-human cell plasma membrane. Which of the following cell culture techniques was most likely employed in order to yield these results?\n(A) Producing a heterokaryon\n(B) Producing a hybrid cell\n(C) Isolating an immortal variant cell from culture and using it to create a cell line\n(D) Inserting a tumor-inducing virus into a normal cell to initiate transformation", "output": "(A)"}
{"input": "Antibiotics that affect bacterial cells interfere with all of the following EXCEPT\n(A) peptidoglycan synthesis\n(B) protein synthesis\n(C) DNA synthesis\n(D) reverse transcriptase", "output": "(D)"}
{"input": "Which of the following statements about fungi is NOT true?\n(A) They all are eukaryotic.\n(B) They all have rigid cell walls.\n(C) Most are filamentous.\n(D) Some are photosynthetic.", "output": "(D)"}
