{"input": "Kiki likes to spend her money on hats and scarves. When she buys twice as many hats as scarves, she spends 60% of her money on hats and the rest on scarves. If she currently has $90, how many scarves will she buy if they are sold at $2 each?", "solution": "Kiki spends 60/100*$90=$<<60/100*90=54>>54 of her money on hats.\nThe amount she spends on buying scarves is $90-$54=$<<90-54=36>>36\nIf each scarf is sold at $2, Kiki will buy $36/$2=<<36/2=18>>18 scarves.\n#### 18", "output": 18}
{"input": "John is working as an IT specialist. He repairs broken computers. One day he had to fix 20 computers. 20% of them were unfixable, and 40% of them needed to wait a few days for spare parts to come. The rest John was able to fix right away. How many computers John was able to fix right away?", "solution": "From all the computers, 100% - 40% - 20% = 40% got fixed right away.\nSo John was able to fix 40/100 * 20 = <<40/100*20=8>>8 computers.\n#### 8", "output": 8}
{"input": "At a certain car dealership, 15% of the cars cost less than $15000 and 40% of the cars cost more than $20000. If there are 3000 cars at the dealership, how many of them cost between $15000 and $20000?", "solution": "15% of 3000 cars is (15/100)*3000 = <<(15/100)*3000=450>>450 cars\n40% of 3000 cars is (40/100)*3000 = <<(40/100)*3000=1200>>1200 cars\n450+1200 = <<450+1200=1650>>1650 cars which cost either less than $15000 or more than $20000\nOut of 3000 cars, there will then be 3000-1650 = <<3000-1650=1350>>1350 cars left which cost between $15000 and $20000\n#### 1350", "output": 1350}
{"input": "Norris saved $29 in September. He saved $25 in October and $31 in November. Then Hugo spent $75 on an online game. How much money does Norris have left?", "solution": "The total amount of money saved is $29 + $25 + $31 = $<<29+25+31=85>>85.\nNorris has $85 - $75 = $<<85-75=10>>10 left.\n#### 10", "output": 10}
{"input": "Marie is planning to buy a new cash register for her bakery that costs $1040. Every day Marie sells 40 loaves of bread for $2 each and 6 cakes for $12 each. She has to pay $20 each day for rent and $2 each day for electricity. How many days' worth of profits will it take for Marie to pay for the cash register?", "solution": "First figure out how much money Marie makes from selling bread each day by multiplying the number of loaves sold by the price per loaf: 40 loaves * $2/loaf = $<<40*2=80>>80\nNext figure out how much money Marie makes from selling cakes each day by multiplying the number of cakes sold by the price per cake: 6 cakes * $12/cake = $<<6*12=72>>72\nNow add the money from selling the bread to the money from selling the cakes to find Marie's total daily income: $80 + $72 = $<<80+72=152>>152\nNext subtract Marie's daily expenses from her daily income to find her daily profit: $152 - $20 - $2 = $<<152-20-2=130>>130\nFinally, divide the price of the cash register by Marie's daily profit to find how many days' profits she needs to pay for it: $1040 / $130 = <<1040/130=8>>8\n#### 8", "output": 8}
