{"input": "How does anthropology differ from other social sciences such as economics and sociology?\n(A) Anthropology is holistic and integrative in its approach.\n(B) Anthropology is less holistic and more theoretical in its approach.\n(C) Anthropology tends to focus on specific topics in history.\n(D) Anthropology is more narrowly focused than the other social sciences.", "output": "(A)"}
{"input": "What designation for a pottery style was eventually applied to an entire cultural complex that moved across the Pacific?\n(A) Clovis\n(B) Nenana Complex\n(C) Lapita\n(D) Micronesian Pottery Tradition", "output": "(C)"}
{"input": "Between 1.4 million and 400,000 years ago, hand axe technology:\n(A) steadily improved.\n(B) steadily worsened.\n(C) changed only slightly.\n(D) evolved into a more sophisticated technology.", "output": "(C)"}
{"input": "The Gault site in south-central Texas has produced evidence from 13,000 years ago that Paleoindians chose this location based on the:\n(A) nearness of the site to navigable rivers and the Gulf coast.\n(B) abundance of wild game, plants, and fish in a rich and diverse woodland environment.\n(C) proximity to a local source of chert for quarrying and making stone tools.\n(D) nearby location of migratory routes of large mammals such as bison.", "output": "(C)"}
{"input": "The greatest Egyptian pyramids at Giza were built:\n(A) as burial monuments for the pharaoh Khufu, Khufu's son Khafre, and Khufu's grandson Menkaure.\n(B) by slaves who were coerced and worked under the threat of death, as described in the book of Exodus of the Old Testament.\n(C) in the construction frenzy of the 6th dynasty.\n(D) all of the above.", "output": "(A)"}
{"input": "What was the unifying element of Olmec culture?\n(A) religious iconography\n(B) large armies\n(C) agricultural surpluses\n(D) all of the above", "output": "(A)"}
{"input": "Monk's Mound, at the Mississippian center of Cahokia, served as:\n(A) a lookout or fire tower.\n(B) a meeting ground for egalitarian tribes.\n(C) a burial monument.\n(D) the base for one or more important buildings.", "output": "(D)"}
{"input": "Which of the following is evidence of new uses for plants during the Middle Stone Age?\n(A) the use of seeds as a natural insecticide in Altamira cave in southwestern Europe\n(B) plant materials such as flowers in Aurignacian burials in southern France\n(C) plant material lining the floor of Sibudu Cave in South Africa\n(D) the use of wood in the Gravettian tradition to make spear-throwers and canoes", "output": "(C)"}
{"input": "A design that is not painted upon but is etched into a rock face is called a:\n(A) pictograph.\n(B) petroglyph.\n(C) pictorial.\n(D) petrification.", "output": "(B)"}
{"input": "The ethics of conducting archaeological research on sites with human remains of indigenous North American ancestors is addressed by the Native American Graves Protection and Repatriation Act. Problems often arise when:\n(A) both non-indigenous archaeologists and Native Americans are allowed onto the site at the same time.\n(B) there are no Native Americans who have been trained as archaeologists and no archaeologists who are Native American.\n(C) neither archaeologists nor Native Americans can agree on the exact location of burials at the site.\n(D) burials are so ancient that establishing historical or genealogical connections with modern, living groups of people is impossible.", "output": "(D)"}
{"input": "According to one theory, the power of Ancestral Pueblo elites emerged when certain groups:\n(A) predicted astronomical events such as eclipses and meteor showers.\n(B) constructed monuments and elaborate multi-storied cliff dwellings.\n(C) stored food surpluses in good years for distribution in bad years.\n(D) incorporated other societies through conquest warfare.", "output": "(C)"}
{"input": "Why is the timing of monumental construction at Ceibal significant?\n(A) It contradicts the hypothesis that the monumental construction of the Maya was largely inspired by the Olmec.\n(B) It confirms that the residents of Ceibal were inspired by the Olmec to build large platforms.\n(C) It contradicts the hypothesis that the development of monumental construction among the Maya was an internal process.\n(D) It confirms that the Olmec, who built most of the Maya monuments, were inspired by the Egyptians.", "output": "(A)"}
{"input": "The Egyptian system of hieroglyphics:\n(A) did not use pictographs\n(B) appears to have developed suddenly\n(C) was the earliest form of writing in the world\n(D) all of the above", "output": "(B)"}
{"input": "During the late Miocene, carbon isotope analysis indicates environmental changes that would have impacted the hominid ancestors of modern humans. These changes are best characterized as:\n(A) a sudden drop in global temperatures resulting in a return to ice age conditions.\n(B) a sudden rise in global temperatures resulting in rising sea levels.\n(C) an expansion of grasslands and reduction in woodlands, resulting in regional mosaic environments.\n(D) a decline in large mammal populations and relative increase in other classes of vertebrate species.", "output": "(C)"}
{"input": "How did Aurignacian technology differ from Mousterian technology?\n(A) Mousterian technology produced more projectile points.\n(B) Mousterian technology produced more usable blade surface.\n(C) Aurignacian technology produced more usable blade surface.\n(D) Aurignacian technology was focused on the production of hand axes.", "output": "(C)"}
{"input": "The Yang-shao culture gave way to the Lung-Shan sometime after:\n(A) 6,000 B.P.\n(B) 5,000 B.P.\n(C) 4,000 B.P.\n(D) 3,000 B.P.", "output": "(B)"}
{"input": "Based on the morphology of fossil hominids dating from about 1.8 million until about 400,000 years ago, researchers argue that:\n(A) there were two or more related but geographically separate hominid species during this period that evolved from earlier African hominids\n(B) hominids dating from this time can be grouped into different species in Africa, Asia, and Europe.\n(C) all of the hominids that evolved from Homo habilis and predate Homo sapiens belong in a single, geographically widespread but morphologically diverse species known as Homo erectus.\n(D) all of the above", "output": "(D)"}
{"input": "What contributes to societies becoming more complex?\n(A) Surplus food is stored in large, collective facilities.\n(B) Crop irrigation requires the construction of dams or canals.\n(C) Sedentary communities need to defend themselves.\n(D) All of the above.", "output": "(D)"}
{"input": "What effect did the late Pleistocene to early Holocene climate change have on human populations?\n(A) It forced populations to move toward the equator.\n(B) It tested the ability of human beings to adapt.\n(C) It forced humans to wear clothing.\n(D) It had no effect at all.", "output": "(B)"}
{"input": "What does the lid of the sarcophagus of Pacal the Great, ruler of Palenque, depict?\n(A) the slain enemies of the king, with a series of hieroglyphs representing all of the great cities and civilizations of the world\n(B) the dead king suspended between the Maya earth monster and the Quetzal bird which symbolizes the Maya heaven\n(C) the Aztec king ascending to heaven on a chariot made of gold\n(D) an ancient alien looking through a telescope and piloting a spaceship", "output": "(B)"}
