{"input": "The speed of light inside of a nonmagnetic dielectric material with a dielectric constant of 4.0 is\n(A) 1.2 x 10^9 m/s\n(B) 3.0 x 10^8 m/s\n(C) 1.5 x 10^8 m/s\n(D) 1.0 x 10^8 m/s", "output": "(C)"}
{"input": "White light is normally incident on a puddle of water (index of refraction 1.33). A thin (500 nm) layer of oil (index of refraction 1.5) floats on the surface of the puddle. Of the following, the most strongly reflected wavelength is\n(A) 500 nm\n(B) 550 nm\n(C) 600 nm\n(D) 650 nm", "output": "(C)"}
{"input": "A uniform solid disk starts from rest and rolls down an inclined plane without slipping. After some time, what fraction of the disk’s total kinetic energy is rotational kinetic energy?\n(A) 1/4\n(B) 1/3\n(C) 1/2\n(D) 2/3", "output": "(B)"}
{"input": "A magnetic field is directed perpendicular to the plane of a circular coil of area 0.2 m^2 and 250 turns. If the magnetic field is increased from 0.01 T to 0.06 T during a time interval of 0.25 s, the average induced EMF in the coil is\n(A) 0.04 V\n(B) 0.1 V\n(C) 2.5 V\n(D) 10 V", "output": "(D)"}
{"input": "The surface of the Sun has a temperature close to 6,000 K and it emits a blackbody (Planck) spectrum that reaches a maximum near 500 nm. For a body with a surface temperature close to 300 K, at what wavelength would the thermal spectrum reach a maximum?\n(A) 10:00 PM\n(B) 100 Pm\n(C) 10 mm\n(D) 100 mm", "output": "(A)"}
{"input": "The first five harmonics produced by an organ pipe open at both ends are 50 Hz, 100 Hz, 150 Hz, 200 Hz, and 250 Hz. Which of the harmonics, if any, will survive once the pipe is closed at one end?\n(A) 50 Hz, 150 Hz, and 250 Hz only\n(B) 100 Hz and 200 Hz only\n(C) 150 Hz and 250 Hz only\n(D) nan", "output": "(D)"}
{"input": "A proton moves in the +z-direction after being accelerated from rest through a potential difference V. The proton then passes through a region with a uniform electric field E in the +x-direction and a uniform magnetic field B in the +y-direction, but the proton’s trajectory is not affected. If the experiment were repeated using a potential difference of 2V, the proton would then be\n(A) deflected in the +x-direction\n(B) deflected in the -x-direction\n(C) deflected in the +y-direction\n(D) deflected in the -y-direction", "output": "(B)"}
{"input": "The energy from electromagnetic waves in equilibrium in a cavity is used to melt ice. If the Kelvin temperature of the cavity is increased by a factor of two, the mass of ice that can be melted in a fixed amount of time is increased by a factor of\n(A) 2\n(B) 4\n(C) 8\n(D) 16", "output": "(D)"}
{"input": "Which of the following statements about bosons and/or fermions is true?\n(A) Bosons have symmetric wave functions and obey the Pauli exclusion principle.\n(B) Bosons have antisymmetric wave functions and do not obey the Pauli exclusion principle.\n(C) Fermions have symmetric wave functions and obey the Pauli exclusion principle.\n(D) Fermions have antisymmetric wave functions and obey the Pauli exclusion principle.", "output": "(D)"}
{"input": "An airplane drops a payload while traveling due north, parallel to the ground, at a constant speed of 100 m/s. If air resistance is neglected, what is the velocity of the payload relative to the plane 4.0 s after it is released?\n(A) 0\n(B) 40 m/s down\n(C) 80 m/s down\n(D) 100 m/s north and 40 m/s down", "output": "(B)"}
{"input": "Consider an electron in the n = 4, l = 1 state in hydrogen. Which of the following final states can NOT be reached by an allowed transition?\n(A) n = 3, l = 2\n(B) n = 3, l = 1\n(C) n = 3, l = 0\n(D) n = 2, l = 0", "output": "(B)"}
{"input": "The suspension cable of a 1,000 kg elevator snaps, sending the elevator moving downward through its shaft. The emergency brakes of the elevator stop the elevator shortly before it reaches the bottom of the shaft. If the elevator fell a distance of 100 m starting from rest, the heat that the brakes must dissipate to bring the elevator safely to rest is\n(A) 100 J\n(B) 1,000 J\n(C) 10,000 J\n(D) 1,000,000 J", "output": "(D)"}
{"input": "A spring of force constant k is stretched a certain distance. It takes twice as much work to stretch a second spring by half this distance. The force constant of the second spring is\n(A) k\n(B) 2k\n(C) 4k\n(D) 8k", "output": "(D)"}
{"input": "Characteristic X rays, appearing as sharp lines on a continuous background, are produced when high-energy electrons bombard a metal target. Which of the following processes results in the characteristic X rays?\n(A) Electrons producing Čerenkov radiation\n(B) Electrons colliding with phonons in the metal\n(C) Electrons filling inner shell vacancies that are created in the metal atoms\n(D) Electrons combining with protons to form neutrons", "output": "(C)"}
{"input": "Two students perform an experiment in which they drop a ball from rest from a known height above the ground and measure the speed of the ball just before it strikes the ground. From repeated measurement, the students estimate the uncertainty in the measured speed of the ball to be 10 percent. Which of the following gives the uncertainty in the kinetic energy of the ball? (Assume the uncertainty in the ball’s mass is negligibly small.)\n(A) 5%\n(B) 10%\n(C) 15%\n(D) 20%", "output": "(D)"}
{"input": "The speed of light inside of a nonmagnetic dielectric material with a dielectric constant of 4.0 is\n(A) 1.2 * 10^9 m/s\n(B) 3.0 * 10^8 m/s\n(C) 1.5 * 10^8 m/s\n(D) 1.0 * 10^8 m/s", "output": "(C)"}
{"input": "White light is normally incident on a puddle of water (index of refraction 1.33). A thin (500 nm) layer of oil (index of refraction 1.5) floats on the surface of the puddle. Of the following, the most strongly reflected wavelength is\n(A) 500 nm\n(B) 550 nm\n(C) 600 nm\n(D) 650 nm", "output": "(C)"}
{"input": "Electromagnetic radiation emitted from a nucleus is most likely to be in the form of\n(A) gamma rays\n(B) microwaves\n(C) ultraviolet radiation\n(D) visible light", "output": "(A)"}
{"input": "The sign of the charge carriers in a doped semiconductor can be deduced by measuring which of the following properties?\n(A) Specific heat\n(B) Thermal conductivity\n(C) Electrical resistivity\n(D) Hall coefficient", "output": "(D)"}
{"input": "Unpolarized light is incident on a pair of ideal linear polarizers whose transmission axes make an angle of 45q with each other. The transmitted light intensity through both polarizers is what percentage of the incident intensity?\n(A) 100%\n(B) 75%\n(C) 50%\n(D) 25%", "output": "(D)"}
