{"input": "As of 2019, about what percentage of Americans say the relationship between the U.S. and Germany is good?\n(A) 60%\n(B) 75%\n(C) 90%\n(D) 45%", "output": "(B)"}
{"input": "As of 2015, agriculture made up about what percentage of total US GDP?\n(A) 1%\n(B) 3%\n(C) 9%\n(D) 20%", "output": "(A)"}
{"input": "The conjecture that inequality first increases with development, then decreases with further development (known as the “inverted U hypothesis”) has, as of 2020, been\n(A) strongly supported by most studies\n(B) supported mainly by cross-section, not time-series studies\n(C) supported mainly by time-series, not cross-section studies\n(D) generally repudiated by empirical studies", "output": "(B)"}
{"input": "As of 2019, about what percentage of Turks say God plays an important role in their life?\n(A) 59%\n(B) 69%\n(C) 79%\n(D) 89%", "output": "(D)"}
{"input": "Controlling for inflation and PPP-adjustment, about how much did GDP per capita increase from 1950 to 2016 in China?\n(A) by 4 fold\n(B) by 8 fold\n(C) by 16 fold\n(D) by 32 fold", "output": "(C)"}
{"input": "As of 2019, about what percentage of Americans say it is very important to have free media in our country without government/state censorship?\n(A) 50%\n(B) 60%\n(C) 70%\n(D) 80%", "output": "(D)"}
{"input": "Which of the following mental disorders is most prevalent in the world?\n(A) Bipolar disorder\n(B) Schizophrenia\n(C) Alcohol use disorders\n(D) Anxiety disorders", "output": "(D)"}
{"input": "What is the percentage of children aged 13-15 in the United States who reported being bullied at least once in the past couple of months as of 2015?\n(A) 26%\n(B) 46%\n(C) 66%\n(D) 86%", "output": "(A)"}
{"input": "As of 2015, about what percentage of the world’s land area is forested?\n(A) 15%\n(B) 30%\n(C) 45%\n(D) 60%", "output": "(B)"}
{"input": "As of 2019, which of the following had the lowest life expectancy?\n(A) Brazil\n(B) China\n(C) Mexico\n(D) Iran", "output": "(C)"}
{"input": "As of 2020, about what percentage of the world population practices open defecation?\n(A) 2%\n(B) 4%\n(C) 9%\n(D) 18%", "output": "(C)"}
{"input": "As of 2015, what percentage of the global population over 15 years old was literate?\n(A) 81%\n(B) 86%\n(C) 91%\n(D) 96%", "output": "(B)"}
{"input": "Controlling for inflation and PPP-adjustment, about how much did GDP per capita increase from 1950 to 2016 in Japan?\n(A) by 5 fold\n(B) by 10 fold\n(C) by 15 fold\n(D) by 20 fold", "output": "(C)"}
{"input": "Consider the following statements: (1) In every country, people think other individuals in their country are less happy than they actually are. (2) In the United States, women’s happiness has increased both absolutely and relative to men. Which of these statements is True/False?\n(A) True, True\n(B) True, False\n(C) False, True\n(D) False, False", "output": "(B)"}
{"input": "As of 2019, about what percentage of people from the United States says homosexuality should be accepted by society?\n(A) 52%\n(B) 62%\n(C) 72%\n(D) 82%", "output": "(C)"}
{"input": "As of 2017, how many people in the world have some access to electricity?\n(A) 60%\n(B) 70%\n(C) 80%\n(D) 90%", "output": "(C)"}
{"input": "As of 2017, the share of GDP spent on the military by Saudi Arabia is about\n(A) 1%\n(B) 3%\n(C) 6%\n(D) 10%", "output": "(D)"}
{"input": "As of 2017, the share of GDP spent on the military by China is about\n(A) 0.50%\n(B) 2%\n(C) 6%\n(D) 12%", "output": "(B)"}
{"input": "The global HIV/AIDS death rate is highest for which of these age groups?\n(A) Under 5\n(B) 14-May\n(C) 15-49\n(D) over 50", "output": "(C)"}
{"input": "Which of the following countries invested the largest fraction of its GDP in renewable energy in 2015?\n(A) China\n(B) Japan\n(C) Chile\n(D) India", "output": "(C)"}
