{"input": "In an experiment designed to study the photoelectric effect, it is observed that low-intensity visible light of wavelength 550 nm produced no photoelectrons. Which of the following best describes what would occur if the intensity of this light were increased dramatically?\n(A) Almost immediately, photoelectrons would be produced with a kinetic energy equal to the energy of the incident photons.\n(B) Almost immediately, photoelectrons would be produced with a kinetic energy equal to the energy of the incident photons minus the work function of the metal.\n(C) After several seconds, necessary for the electrons to absorb sufficient energy from the incident light, photoelectrons would be produced with a kinetic energy equal to the energy of the incident photons minus the work function of the metal.\n(D) Nothing would happen.", "output": "(D)"}
{"input": "An alarm whose frequency is 400 Hz is dropped out of a third-floor window. The student who drops it measures the frequency with a very sensitive oscilloscope. The measured frequency\n(A) appears higher than 400 Hz and the frequency increase as it falls\n(B) appears higher than 400 Hz and the frequency decreases as it falls\n(C) appears lower than 400 Hz and the frequency decreases as it falls\n(D) appears lower than 400 Hz and the frequency increases as it falls", "output": "(C)"}
{"input": "A beam of electrons has speed 10^7 m/s. It is desired to use the magnetic field of the Earth, 5 × 10−5 T, to bend the electron beam into a circle. What will be the radius of this circle?\n(A) 1 nm\n(B) 1 μm\n(C) 1 mm\n(D) 1 m", "output": "(D)"}
{"input": "A car moving with speed v reaches the foot of an incline of angle θ. The car coasts up the incline without using the engine. Neglecting friction and air resistance, which of the following is correct about the magnitude of the car’s horizontal acceleration ax and vertical acceleration ay?\n(A) ax = 0; ay < g\n(B) ax = 0; ay = g\n(C) ax < g; ay < g\n(D) ax < g; ay = g", "output": "(C)"}
{"input": "What happens to the force of gravitational attraction between two small objects if the mass of each object is doubled and the distance between their centers is doubled?\n(A) It is doubled.\n(B) It is quadrupled.\n(C) It is halved.\n(D) It remains the same.", "output": "(D)"}
{"input": "A nonconducting sphere is given a nonzero net electric charge, +Q, and then brought close to a neutral conducting sphere of the same radius. Which of the following will be true?\n(A) An electric field will be induced within the conducting sphere.\n(B) The conducting sphere will develop a net electric charge of –Q.\n(C) The spheres will experience an electrostatic attraction.\n(D) The spheres will experience an electrostatic repulsion.", "output": "(C)"}
{"input": "Two identical capacitors are hooked in parallel to an external circuit. Which of the following quantities must be the same for both capacitors? I. the charge stored on the capacitor II.  the voltage across the capacitor III. the capacitance of the capacitor\n(A) I only\n(B) II only\n(C) II and III only\n(D) (E) I, II, and III", "output": "(D)"}
{"input": "Pretend someone actually managed to dig a hole straight through the center of the Earth all the way to the other side. If an object were dropped down that hole, which of the following would best describe its motion? Assume ideal conditions and that the object cannot be destroyed.\n(A) It would fall to the center of the Earth and stop there.\n(B) It would fall through the hole to the other side, continue past the opposite side’s opening, and fly into space.\n(C) It would oscillate back and forth from one opening to the other indefinitely.\n(D) It would fall to the other side and stop there.", "output": "(C)"}
{"input": "Two objects, A and B, have equal charge and equal mass. Neither body is in motion because the gravitational and electrostatic forces between them are equal. If the mass of Object A is halved, equilibrium will be maintained if\n(A) the charge on Object A were doubled\n(B) the charge on Object B were halved\n(C) the charge on Object B were doubled\n(D) the mass on Object B were halved", "output": "(D)"}
{"input": "A student is experimenting with a simple spring-block oscillator of spring constant k and amplitude A. The block attached to the spring has a mass of m. If the student places a small block of mass m on top of the original block, which of the following is true?\n(A) The small block is most likely to slide off when the original block is at maximum displacement from the equilibrium position, but will not slide off as long as the coefficient of static friction between the blocks is greater than kA/[(M+m)g].\n(B) The small block is most likely to slide off when the original block is at the equilibrium position, but will not slide off as long as the coefficient of static friction between the blocks is greater than kA/[(M+m)g].\n(C) The small block is most likely to slide off when the original block is at maximum displacement from the equilibrium position, but will not slide off as long as the coefficient of static friction between the blocks is greater than (M+m)g/(kA).\n(D) The small block is most likely to slide off when the original block is at the equilibrium position, but will not slide off as long as the coefficient of static friction between the blocks is greater than (M+m)g/(kA).", "output": "(A)"}
{"input": "Which of the following changes to a circuit will always bring about an increase in the current?\n(A) Increased voltage and increased resistance\n(B) Decreased voltage and decreased resistance\n(C) Increased voltage and decreased resistance\n(D) Decreased voltage and increased resistance", "output": "(A)"}
{"input": "A moving 1.5-kg cart collides with and sticks to a 0.5-kg cart which was initially at rest. Immediately after the collision, the carts each have the same ______ as each other.\n(A) Velocity\n(B) Kinetic energy\n(C) Mass\n(D) Linear momentum", "output": "(A)"}
{"input": "Traveling at an initial speed of 1.5 × 10^6 m/s, a proton enters a region of constant magnetic field of magnitude 1.5 T. If the proton's initial velocity vector makes an angle of 30° with the magnetic field, compute the proton's speed 4 s after entering the magnetic field.\n(A) 5.0 × 10^6 m/s\n(B) 7.5 × 10^6 m/s\n(C) 1.5 × 10^6 m/s\n(D) 3.0 × 10^6 m/s", "output": "(C)"}
{"input": "A man stands with his hands to his sides on a frictionless platform that is rotating. Which of the following could change the angular momentum of the man-platform system?\n(A) The man catches a baseball thrown to him by a friend.\n(B) The man thrusts his arms out away from his body\n(C) The man thrusts his arms out away from his body, and then quickly brings his arms back to his side again.\n(D) The man jumps straight up in the air and lands back on the platform.", "output": "(A)"}
{"input": "A liquid flows at a constant flow rate through a pipe with circular cross-sections of varying diameters. At one point in the pipe, the diameter is 2 cm and the flow speed is 18 m/s. What is the flow speed at another point in this pipe, where the diameter is 3 cm?\n(A) 4 m/s\n(B) 6 m/s\n(C) 8 m/s\n(D) 12 m/s", "output": "(C)"}
{"input": "An electric dipole consists of a pair of equal but opposite point charges of magnitude 4.0 nC separated by a distance of 2.0 cm. What is the electric field strength at the point midway between the charges?\n(A) 0\n(B) 9.0 × 10^4 V/m\n(C) 1.8 × 10^5 V/m\n(D) 7.2 × 10^5 V/m", "output": "(D)"}
{"input": "A disk of radius 0.1 m initially at rest undergoes an angular acceleration of 2.0 rad/s^2. If the disk only rotates, find the total distance traveled by a point on the rim of the disk in 4.0 s.\n(A) 0.4 m\n(B) 0.8 m\n(C) 1.2 m\n(D) 1.6 m", "output": "(D)"}
{"input": "A horse is attached to a cart that is at rest behind it. Which force, or combination of forces, explains how the horse-cart system can accelerate from rest?\n(A) The forward static friction force of the ground on the horse is greater than any friction forces acting backward on the cart, providing a forward acceleration.\n(B) The forward force of the horse on the cart is greater than the backward force of the cart on the horse, providing a forward acceleration.\n(C) The force of the horse’s muscles on the rest of the horse-cart system provides the necessary acceleration.\n(D) The upward normal force of the ground on the horse is greater than the horse’s weight, providing an upward acceleration.", "output": "(A)"}
{"input": "The charge on an oil drop is measured in the laboratory. Which of the following measurements should be rejected as highly unlikely to be correct?\n(A) 6.4 × 10^-19 C\n(B) 8.0 × 10^-19 C\n(C) 4.8 × 10^-19 C\n(D) 2.4 × 10^-19 C", "output": "(D)"}
{"input": "Physics students are checking the constant acceleration equations of kinematics by measuring the velocity of a tennis ball that is dropped and falls 6 meters and then passes through a photogate. The predicted velocity is 20% above the velocity measured by the photogate. Which of the following best describes the cause of the large percent difference?\n(A) The ball changes its shape while falling.\n(B) The acceleration of gravity varies as the ball is falling.\n(C) Air resistance increases the acceleration of the ball.\n(D) The acceleration of the balls varies with the velocity.", "output": "(D)"}
