{"input": " A war that involves actual fighting is known as\n(A) a hot war.\n(B) a cold war.\n(C) a war simpliciter.\n(D) none of the above", "output": "(A)"}
{"input": " In Altman's characterization, racial epithets and similar terms of abuse are communicative tools for expressing an extreme form of which of the following?\n(A) moral blame\n(B) moral praise\n(C) moral contempt\n(D) none of the above", "output": "(C)"}
{"input": " Frances Kamm discusses the case of a scientist who works on finding a cure for congenital blindness and is motivated only by a bad desire for mastery to suggest that\n(A) sometimes an action can be permissible even if it is motivated by a bad desire.\n(B) all actions motived by bad desires are impermissible.\n(C) the desire for mastery is not, as Sandel argues, a bad desire.\n(D) sometimes the only way to cure a disease is through selfish desires.", "output": "(A)"}
{"input": "According to Michael Huemer, the harm of drug use to individual drug users\n(A) justifies state prohibition of drug use.\n(B) does not justify state prohibition of drug use.\n(C) justifies a massive campaign of public health awareness.\n(D) does not justify a massive campaign of public health awareness.", "output": "(B)"}
{"input": " The second premise in Singer's main argument is: \"If it is in your power to prevent something bad from happening, without sacrificing anything nearly as important, it is wrong not to do so.\" Which phrase in this premise is deliberately left vague?\n(A) \"something bad\"\n(B) \"it is wrong\"\n(C) \"nearly as important\"\n(D) \"in your power\"", "output": "(C)"}
{"input": " In support of her thesis that global social institutions violate the rights of the world's poor, Ashford argues that\n(A) illicit cash flow to tax havens from rich countries exceeds aid to the world's poor.\n(B) the implementation of neoliberal economic policies have had at mixed and at worse adverse impacts of the economic and social rights of the world's poor.\n(C) that wealthy nations press their political and economic advantages to secure unfair trade agreements with poor countries.\n(D) all of the above", "output": "(D)"}
{"input": " According to Aquinas's moral theory, morality is ultimately grounded in\n(A) agreements made between individuals.\n(B) pleasure and the absence of pain.\n(C) facts about human nature.\n(D) virtue.", "output": "(C)"}
{"input": " According to Aquinas, the first precept of natural law is\n(A) \"good is to be done, evil to be avoided.\"\n(B) \"one ought to do what one will.\"\n(C) \"one ought to do only what can be done without contradiction.\"\n(D) \"pleasure is to be sought, pain to be avoided.\"", "output": "(A)"}
{"input": " Norcross claims that if morality demands that we not torture puppies merely to enhance our own eating pleasure, morality also demands that\n(A) we try to reduce our carbon footprint.\n(B) we donate money to Oxfam.\n(C) we not support factory farming.\n(D) we follow the Golden Rule.", "output": "(C)"}
{"input": " Mary is a person, and as such she plausibly deserves moral consideration because of features inherent to her (e.g., being self-aware). This suggests that she has\n(A) direct moral standing.\n(B) indirect moral standing.\n(C) relative moral standing.\n(D) none of the above", "output": "(A)"}
{"input": " In response to the argument that embryos are not persons because they lack certain rights that all persons have (such as the right to life), Lee and George argue that\n(A) the right to life belongs to a human being at all times that he or she exists.\n(B) the right to life belongs to all living creatures, human or not.\n(C) not all persons have the right to life-for example, a murderer has given up his or her right to life through his or her actions\n(D) all of the above", "output": "(A)"}
{"input": " What is the main difference between a cloned (SCNT) individual and an individual who is a product of normal sexual reproduction?\n(A) The SCNT individual has genetic material primarily from one person instead of two.\n(B) The SCNT individual has genetic material primarily from two people instead of one.\n(C) The SCNT individual has no genetic material.\n(D) There is no significant difference.", "output": "(A)"}
{"input": " Which of the following is evidence that de Marneffe cites in support of the claim that increased availability of a drug leads to increased use of that drug?\n(A) Heroin use was much higher among military personnel in Vietnam than it was among veterans who returned to the United States.\n(B) The percentage of physicians who use psychoactive drugs is much higher than the general population.\n(C) Alcohol abuse declines when the law restricts the times it can be legally sold.\n(D) all of the above", "output": "(A)"}
{"input": " According to Ross, when our duties conflict with each other we should\n(A) not do anything because duties cannot actually conflict with each other.\n(B) use moral judgment to determine which duty should be obeyed.\n(C) consult authorities instead of relying on our own judgment.\n(D) wait until the conflict ceases on its own.", "output": "(B)"}
{"input": " According to Hardin, the fundamental error of \"sharing ethics\" is that\n(A) it is anti-Christian.\n(B) it would require a stronger system of taxation for the affluent.\n(C) it would lead to a \"tragedy of the commons.\"\n(D) all of the above", "output": "(C)"}
{"input": " The consequentialist approach to punishment is at odds with\n(A) retributive theories of punishment.\n(B) perfectionist theories of punishment.\n(C) legal theories of punishment.\n(D) preventive theories of punishment.", "output": "(A)"}
{"input": " One way to value a patient's autonomy is by aiming to maximize his or her effective options. When we value a patient's autonomy in this way, what, according to Velleman, do we value?\n(A) the patient's opportunities for self-determination\n(B) the patient's capacity for self-determination\n(C) the ability to provide the patient with options\n(D) the ability to share reasons with the patient", "output": "(A)"}
{"input": " Which of the following statements would Macedo disagree with?\n(A) States should give special weight to their own citizens.\n(B) Immigration policies can have powerful economic effects.\n(C) Self-governance is morally irrelevant to the immigration debate.\n(D) There are reasons to think U.S. immigration policy has had detrimental effects on income distribution among citizens.", "output": "(C)"}
{"input": " The only way to break out of the \"terrorist cycle,\" says Walzer, is to\n(A) attack quickly, swiftly, and with full force.\n(B) use the same tactics the terrorists use.\n(C) avoid playing the terrorism game.\n(D) use psychological rather than military tactics.", "output": "(C)"}
{"input": " Mill defends which of the following liberty-limiting principles?\n(A) the harm principle\n(B) the offense principle\n(C) the principle of legal paternalism\n(D) wthe principle of legal moralism", "output": "(A)"}
