{"input": "Suppose X and Y are random variables with E(X) = 37, var(X) = 5, E(Y) = 62, and var(Y) = 12. What are the expected value and variance of the random variable X + Y?\n(A) E(X + Y) = 99, var(X + Y) = 8.5\n(B) E(X + Y) = 99, var(X + Y) = 13\n(C) E(X + Y) = 99, var(X + Y) = 17\n(D) There is insufficient information to answer this question.", "output": "(D)"}
{"input": "After a frost warning was issued, the owner of a large orange grove asked his workers to spray all his trees with water. The water was supposed to freeze and form a protective covering of ice around the orange blossom. Nevertheless, the owner suspected that some trees suffered considerable damage due to the frost. To estimate the proportion of trees that suffered more than 50 percent damage due to the frost, he took a random sample of 100 trees from his grove. What is the response variable in this experiment?\n(A) The proportion of trees that suffered more than 50 percent damage due to frost.\n(B) The number of trees affected by the frost.\n(C) The number of trees sampled from the grove.\n(D) For each sampled tree, whether it suffered more than 50 percent damage or at most 50 percent damage.", "output": "(D)"}
{"input": "A new smartwatch is manufactured in one part of a factory, then secured for shipping in another, independent part of the factory. The weight of the smartwatch has a mean of 62 grams and a standard deviation of 1.0 grams. The weight of the packaging (box, user's guide, bubble wrap, etc.) has a mean of 456 grams and a standard deviation of 6 grams. Together, the distribution of the weight of the smartwatch and its packaging would have the following mean and standard deviation:\n(A) Mean 518 grams; standard deviation 7.0 grams\n(B) Mean 518 grams; standard deviation 3.5 grams\n(C) Mean 518 grams; standard deviation 6.1 grams\n(D) Mean 394 grams; standard deviation 6.1 grams", "output": "(C)"}
{"input": "Which of the following sets has the smallest standard deviation? Which has the largest?\nI: {1,2,3}\nII: {-10,10}\nIII: {100}\n\n(A) I, II\n(B) II, III\n(C) III, I\n(D) III, II", "output": "(D)"}
