{"input": "A skeptic decides to conduct an experiment in ESP in which a blindfolded subject calls out the color of a card dealt from a regular deck of cards (half the cards are red; the other half, black). One hundred cards are dealt from a well-shuffled pack, with each card being replaced after a deal. Using a 5 percent level of significance, what is the lowest number of cards that the subject needs to call out correctly in order to show that he is doing better than he would if he were simply guessing?\n(A) 51\n(B) 59\n(C) 75\n(D) 95", "output": "(B)"}
{"input": "Which of the following are examples of continuous data? I. The speed your car goes II. The number of outcomes of a binomial experiment III. The average temperature in San Francisco IV. The wingspan of a bird V. The jersey numbers of a football team\n(A) I, III, and IV only\n(B) II and V only\n(C) I, III, and V only\n(D) II, III, and IV only", "output": "(A)"}
{"input": "In the correlation coefficient r = 0.78, what percentage of variation in y is explained by the linear regression model?\n(A) 22%\n(B) 39%\n(C) 44%\n(D) 61%", "output": "(D)"}
{"input": "Random samples of size n are drawn from a population. The mean of each sample is calculated, and the standard deviation of this set of sample means is found. Then the procedure is repeated, this time with samples of size 4n. How does the standard deviation of the second group compare with the standard deviation of the first group?\n(A) It will be the same.\n(B) It will be twice as large.\n(C) It will be four times as large.\n(D) It will be half as large.", "output": "(D)"}
{"input": "For which of these is a binomial probability model most reasonable?\n(A) The number of times, out of 10 attempts, that a particular child can throw a ball into a basket from six feet away\n(B) The colors of the cars in the parking lot of a particular grocery store on a randomly selected Sunday\n(C) The number of times that a randomly selected resident of California has visited a museum in the last 12 months\n(D) The number of cards drawn from a well-shuffled deck until all four aces are found", "output": "(A)"}
