{"input": "If all the values of a data set are the same, all of the following must equal zero except for which one?\n(A) Mean\n(B) Standard deviation\n(C) Variance\n(D) Range", "output": "(A)"}
{"input": "At a large hospital, the durations of emergency room visits, from check-in to discharge, are approximately normally distributed with a mean of 167 minutes and a standard deviation of 76 minutes. Which interval, to the nearest minute, contains the middle 80% of durations?\n(A) 15 minutes to 319 minutes\n(B) 53 minutes to 281 minutes\n(C) 70 minutes to 264 minutes\n(D) 91 minutes to 243 minutes", "output": "(C)"}
{"input": "An employment placement agency specializes in placing workers in jobs suited for them. From past experience, the agency knows that 20% of all the workers it places will no longer be at the position in which they were placed after one year; however, only 5% of those remaining after the first year leave during the next year. At the start of a year an employer hires 100 workers using this agency, then at the start of the next year the employer hires 100 more. How many of these 200 workers are expected to be on the job at the end of the second year?\n(A) 140\n(B) 144\n(C) 152\n(D) 156", "output": "(D)"}
{"input": "A major polling organization wants to predict the outcome of an upcoming national election (in terms of the proportion of voters who will vote for each candidate). They intend to use a 95% confidence interval with margin of error of no more than 2.5%. What is the minimum sample size needed to accomplish this goal?\n(A) 1536\n(B) 39\n(C) 1537\n(D) 40", "output": "(C)"}
{"input": "Which of the following is a correct statement?\n(A) The probability of a Type II error does not depend on the probability of a Type I error.\n(B) In conducting a hypothesis test, it is possible to simultaneously make both a Type I and a Type II error.\n(C) A Type II error will result if one incorrectly assumes the data are normally distributed.\n(D) When you choose a significance level α, you're setting the probability of a Type I error to exactly α.", "output": "(D)"}
{"input": "An experiment is to be conducted to determine whether taking fish oil capsules or garlic capsules has more of an effect on cholesterol levels. In past studies it was noted that daily exercise intensity (low, moderate, high) is associated with cholesterol level, but average sleep length (< 5, 5 - 8, > 8 hours) is not associated with cholesterol level. This experiment should be done\n(A) by blocking on exercise intensity\n(B) by blocking on sleep length\n(C) by blocking on cholesterol level\n(D) by blocking on capsule type", "output": "(A)"}
{"input": "An assembly line machine is supposed to turn out ball bearings with a diameter of 1.25 centimeters. Each morning the first 30 bearings produced are pulled and measured. If their mean diameter is under 1.23 centimeters or over 1.27 centimeters, the machinery is stopped and an engineer is called to make adjustments before production is resumed. The quality control procedure may be viewed as a hypothesis test with the null hypothesis H0: μ = 1.25 and the alternative hypothesis Ha: μ ≠ 1.25. The engineer is asked to make adjustments when the null hypothesis is rejected. In test terminology, what would a Type II error result in?\n(A) A warranted halt in production to adjust the machinery\n(B) An unnecessary stoppage of the production process\n(C) Continued production of wrong size ball bearings\n(D) Continued production of proper size ball bearings", "output": "(C)"}
{"input": "A filling machine puts an average of four ounces of coffee in jars, with a standard deviation of 0.25 ounces. Forty jars filled by this machine are selected at random. What is the probability that the mean amount per jar filled in the sampled jars is less than 3.9 ounces?\n(A) 0.0057\n(B) 0.0225\n(C) 0.025\n(D) 0.05", "output": "(A)"}
{"input": "Suppose that 60% of a particular electronic part last over 3 years, while 70% last less than 6 years. Assuming a normal distribution, what are the mean and standard deviation with regard to length of life of these parts?\n(A) μ = 3.677, σ = 3.561\n(B) μ = 3.977, σ = 3.861\n(C) μ = 4.177, σ = 3.561\n(D) μ = 4.377, σ = 3.261", "output": "(B)"}
{"input": "A medicine is known to produce side effects in one in five patients taking it. Suppose a doctor prescribes the medicine to four unrelated patients. What is the probability that none of the patients will develop side effects?\n(A) 0.8\n(B) 0.4096\n(C) 0.25\n(D) 0.2", "output": "(B)"}
{"input": "Data were collected on two variables X and Y and a least squares regression line was fitted to the data. The estimated equation for this data is y = –2.29 + 1.70x. One point has x = 5, y = 6. What is the residual for this point?\n(A) 7.91\n(B) 6.21\n(C) 0.21\n(D) –0.21", "output": "(D)"}
{"input": "The correlation between height in inches and weight in pounds for a particular class is 0.65. If the heights are converted from inches to centimeters, what will the correlation be? (1 in. = 2.54 cm)\n(A) -0.65\n(B) -0.26\n(C) 0.1\n(D) 0.65", "output": "(D)"}
{"input": "A company has 400 employees. Their mean income is $20,500, and the standard deviation of their incomes is $3,750. The distribution of incomes is normally distributed. How many of the 400 employees do you expect to have an income of between $13,000 and $28,000?\n(A) 50\n(B) 100\n(C) 200\n(D) 390", "output": "(D)"}
{"input": "In a study on the effect of music on worker productivity, employees were told that a different genre of background music would be played each day and the corresponding production outputs noted. Every change in music resulted in an increase in production. This is an example of\n(A) the effect of a treatment unit.\n(B) the placebo effect.\n(C) the control group effect.\n(D) sampling error.", "output": "(B)"}
{"input": "Fifty oranges of one variety were selected at random and weighed. A 95 percent confidence interval computed from the sample weights to estimate the mean weight of oranges of this variety is (7.58, 8.72) ounces. Which of the following statements is true with respect to the confidence level used?\n(A) In repeated samplings of the same size, 95 percent of the intervals constructed will contain the true mean weight of the oranges of this variety.\n(B) In repeated samplings of the same size, 95 percent of the intervals constructed will contain the sampled mean weight of the oranges.\n(C) Ninety-five percent of the oranges in this sample weigh between 7.58 and 8.72 ounces.\n(D) Ninety-five percent of the oranges of this variety weigh between 7.58 and 8.72 ounces.", "output": "(A)"}
{"input": "To determine the average number of children living in single-family homes, a researcher picks a simple random sample of 50 such homes. However, even after one follow-up visit the interviewer is unable to make contact with anyone in 8 of these homes. Concerned about nonresponse bias, the researcher picks another simple random sample and instructs the interviewer to keep trying until contact is made with someone in a total of 50 homes. The average number of children is determined to be 1.73. Is this estimate probably too low or too high?\n(A) Too low, because of undercoverage bias.\n(B) Too low, because convenience samples overestimate average results.\n(C) Too high, because of undercoverage bias.\n(D) Too high, because convenience samples overestimate average results.", "output": "(C)"}
{"input": "Which of the following can affect the value of the correlation r?\n(A) A change in measurement units\n(B) A change in which variable is called x and which is called y\n(C) Adding the same constant to all values of the x-variable\n(D) None of the above can affect the r value.", "output": "(D)"}
{"input": "The longevity of people living in a certain locality has a standard deviation of 14 years. What is the mean longevity if 30% of the people live longer than 75 years? Assume a normal distribution for life spans.\n(A) 75 - 0.30(14)\n(B) 75 + 0.30(14)\n(C) 75 - 0.4756(14)\n(D) 75 - 0.5244(14)", "output": "(D)"}
{"input": "Which among the following would result in the narrowest confidence interval?\n(A) Small sample size and 95% confidence\n(B) Small sample size and 99% confidence\n(C) Large sample size and 95% confidence\n(D) Large sample size and 99% confidence", "output": "(C)"}
{"input": "Which of the following is a binomial random variable?\n(A) The number of tosses before a \"5\" appears when tossing a fair die.\n(B) The number of points a hockey team receives in 10 games, where two points are awarded for wins, one point for ties, and no points for losses.\n(C) The number of hearts out of five cards randomly drawn from a deck of 52 cards, without replacement.\n(D) The number of motorists not wearing seat belts in a random sample of five drivers.", "output": "(D)"}
