{"input": "This question refers to the following information.\n\"Article 1\nThe Parties undertake, as set forth in the Charter of the United Nations, to settle any international dispute in which they may be involved by peaceful means in such a manner that international peace and security and justice are not endangered, and to refrain in their international relations from the threat or use of force in any manner inconsistent with the purposes of the United Nations.\n\"Article 2\nThe Parties will contribute toward the further development of peaceful and friendly international relations by strengthening their free institutions, by bringing about a better understanding of the principles upon which these institutions are founded, and by promoting conditions of stability and well-being. They will seek to eliminate conflict in their international economic policies and will encourage economic collaboration between any or all of them.\n\"Article 3\nIn order more effectively to achieve the objectives of this Treaty, the Parties, separately and jointly, by means of continuous and effective self-help and mutual aid, will maintain and develop their individual and collective capacity to resist armed attack…\n\"Article 5\nThe Parties agree that an armed attack against one or more of them in Europe or North America shall be considered an attack against them all and consequently they agree that, if such an armed attack occurs, each of them, in exercise of the right of individual or collective self-defence recognised by Article 51 of the Charter of the United Nations, will assist the Party or Parties so attacked by taking forthwith, individually and in concert with the other Parties, such action as it deems necessary, including the use of armed force, to restore and maintain the security of the North Atlantic area.\"\nNorth Atlantic Treaty, April 4, 1949\nWhich of the following best explains why the North Atlantic Treaty was signed by its participating countries?\n(A) Because of new enfranchisement laws, citizens demanded their countries join in alliance with other nations.\n(B) The threat from opposing states was sufficient enough to join in alliance for the sake of protection.\n(C) The opportunity to re-take colonies lost after World War II could only be acted on through military alliance with other countries.\n(D) A monopoly on nuclear warfare capabilities compelled nations to join the alliance out of fear.", "output": "(B)"}
{"input": "This question refers to the following information.\nSource 1:\n\"You may well ask: \"Why direct action? Why sit-ins, marches and so forth? Isn't negotiation a better path?\" You are quite right in calling, for negotiation. Indeed, this is the very purpose of direct action. Nonviolent direct action seeks to create such a crisis and foster such a tension that a community which has constantly refused to negotiate is forced to confront the issue. It seeks so to dramatize the issue that it can no longer be ignored. My citing the creation of tension as part of the work of the nonviolent-resister may sound rather shocking. But I must confess that I am not afraid of the word \"tension.\" I have earnestly opposed violent tension, but there is a type of constructive, nonviolent tension which is necessary for growth. Just as Socrates felt that it was necessary to create a tension in the mind so that individuals could rise from the bondage of myths and half-truths to the unfettered realm of creative analysis and objective appraisal, we must we see the need for nonviolent gadflies to create the kind of tension in society that will help men rise from the dark depths of prejudice and racism to the majestic heights of understanding and brotherhood.\"\nMartin Luther King, Jr., Letter from a Birmingham Jail, 1966\nSource 2:\n\"We, men and women, who hereby constitute ourselves as the National Organization for Women, believe that the time has come for a new movement toward true equality for all women in America, and toward a fully equal partnership of the sexes, as part of the world-wide revolution of human rights now taking place within and beyond our national borders.\nThe purpose of NOW is to take action to bring women into full participation in the mainstream of American society now, exercising all the privileges and responsibilities thereof in truly equal partnership with men.\nWe believe the time has come to move beyond the abstract argument, discussion and symposia over the status and special nature of women which has raged in America in recent years; the time has come to confront, with concrete action, the conditions that now prevent women from enjoying the equality of opportunity and freedom of which is their right, as individual Americans, and as human beings.\"\nNational Organization for Women, Statement of Purpose, 1966\nSource 3:\n\"The long-term goal of Gay Liberation, which inevitably brings us into conflict with the institutionalized sexism of this society, is to rid society of the gender-role system which is at the root of our oppression. This can only be achieved by eliminating the social pressures on men and women to conform to narrowly defined gender roles. It is particularly important that children and young people be encouraged to develop their own talents and interests and to express their own individuality rather than act out stereotyped parts alien to their nature.\nAs we cannot carry out this revolutionary change alone, and as the abolition of gender rotes is also a necessary condition of women's liberation, we will work to form a strategic alliance with the women's liberation movement, aiming to develop our ideas and our practice in close inter-relation. In order to build this alliance, the brothers in gay liberation will have to be prepared to sacrifice that degree of male chauvinism and male privilege that they still all possess.\"\nGay Liberation Front, Manifesto, 1971\nSource 2 suggests that which of the following was true about the women's movement in 1966?\n(A) It had succeeded in achieving all of its goals.\n(B) It was ready for more abstract discussions.\n(C) It was not a movement supported by men.\n(D) It had not achieved full equality for all segments of society.", "output": "(D)"}
{"input": "This question refers to the following information.\nAn Act to place certain restrictions on Immigration and to provide for the removal from the Commonwealth of Prohibited Immigrants.\n…\n3. The immigration into the Commonwealth of the persons described in any of the following paragraphs in this section (hereinafter called \"prohibited immigrants\") is prohibited, namely\n(a) Any person who when asked to do so by an officer fails to write out at dictation and sign in the presence of the officer a passage of fifty words in length in a European language directed by the officer;\n(b) Any person in the opinion of the Minister or of an officer to become a charge upon the public or upon any public or charitable organisation;\n…\n(g) Any persons under a contract or agreement to perform manual labour within the Commonwealth: Provided that this paragraph shall not apply to workmen exempted by the Minister for special skill required by Australia…\nImmigration Restriction Act of 1901 (Australia)\nWhereas in the opinion of the Government of the United States the coming of Chinese laborers to this country endangers the good order of certain localities within the territory thereof;\nTherefore,\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, That from and after the expiration of ninety days next after the passage of this act, the coming of Chinese laborers to the United States be suspended; and during such suspension it shall not be lawful for any Chinese laborer to come, or having so come after the expiration of said ninety days to remain within the United States.\nSEC. 2. That the master of every vessel who shall knowingly bring within the United States on such vessel, and land or permit to be landed, any Chinese laborer, from any foreign port or place, shall be deemed guilty of a misdemeanor, and on conviction thereof shall be punished by a fine of not more than five hundred dollars for each and every such Chinese laborer so brought, and may be also imprisoned for a term not exceeding one year….\nChinese Exclusion Act of 1882 (United States)\nThe first passage can be regarded as the cornerstone of which of the following official initiatives?\n(A) The White Australia Policy\n(B) The Commonwealth Literacy Crusade\n(C) The Australian Economic Diversification Program\n(D) The Australian Migrant Exclusion Campaign", "output": "(A)"}
{"input": "This question refers to the following information.\nQuestions to the passage below, an account given to a French officer in Algeria in the 1830s by a member of an Arab slave trade caravan.\nThe Slave Trade\nAll of you [soldiers], are summoned . . . to hunt the idolatrous Koholanes [a pejorative word for \"black Africans\"]. . . . The soldiery divided themselves into two companies . . . with orders to attack places without defenses and to carry off the inhabitants as well as seizing all peasants busy cultivating their fields. . . . Whilst waiting for the return of the companies despatched to hunt Negroes, we went every day to the slave market where we bought at the following prices:\nA Negro with beard………………10 or 15,000 cowries.\nThey are not considered as merchandise since one has little chance of preventing them from escaping.\nAn adult Negress………………..10 or 15,000 cowries for the same reasons\nAn adolescent Negro………………….30,000 cowries\nA young Negress ……………………50–60,000 cowries\nThe price varies according to whether she is more or less beautiful.\nA male Negro child……………………..45,000 cowries\nA female Negro child ……………………….35–40,000 cowries\nFinally, our caravan which had set out from Algeria with sixty-four camels and only sixteen persons, was now augmented by four hundred slaves, of whom three hundred were women. . . . It was at this point that suddenly a confused noise of cries and sobs passed from one group of slaves to another and reached our own. . . . Some rolled on the ground, clung to bushes and absolutely refused to walk. . . . They could only be got up with mighty lashes of the whip and by rendering them completely bloody.\nWhat is the most likely destination for the captured slaves in the excerpt?\n(A) Elites' homes or harems in the Middle East\n(B) Sugar plantations in Brazil\n(C) Cotton plantations in North America\n(D) Slave armies of the Mughal Empire", "output": "(A)"}
{"input": "This question refers to the following information.\nAn Act to place certain restrictions on Immigration and to provide for the removal from the Commonwealth of Prohibited Immigrants.\n…\n3. The immigration into the Commonwealth of the persons described in any of the following paragraphs in this section (hereinafter called \"prohibited immigrants\") is prohibited, namely\n(a) Any person who when asked to do so by an officer fails to write out at dictation and sign in the presence of the officer a passage of fifty words in length in a European language directed by the officer;\n(b) Any person in the opinion of the Minister or of an officer to become a charge upon the public or upon any public or charitable organisation;\n…\n(g) Any persons under a contract or agreement to perform manual labour within the Commonwealth: Provided that this paragraph shall not apply to workmen exempted by the Minister for special skill required by Australia…\nImmigration Restriction Act of 1901 (Australia)\nWhereas in the opinion of the Government of the United States the coming of Chinese laborers to this country endangers the good order of certain localities within the territory thereof;\nTherefore,\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, That from and after the expiration of ninety days next after the passage of this act, the coming of Chinese laborers to the United States be suspended; and during such suspension it shall not be lawful for any Chinese laborer to come, or having so come after the expiration of said ninety days to remain within the United States.\nSEC. 2. That the master of every vessel who shall knowingly bring within the United States on such vessel, and land or permit to be landed, any Chinese laborer, from any foreign port or place, shall be deemed guilty of a misdemeanor, and on conviction thereof shall be punished by a fine of not more than five hundred dollars for each and every such Chinese laborer so brought, and may be also imprisoned for a term not exceeding one year….\nChinese Exclusion Act of 1882 (United States)\nWhat broad trend from the 1800s formed the background for the enactment of the laws described in both passages?\n(A) The growing appeal of Christianity among Indian and Chinese populations\n(B) European and American colonial domination of India and China\n(C) The Pacific-wide migration of Indian and Chinese indentured laborers\n(D) Gradual industrialization of the Indian and Chinese economies", "output": "(C)"}
