{"input": "This question refers to the following information.\nOh, shame on you, poor Winter King!\nWhat's this that you have done?\nIs 't not a very naughty thing\nTo snatch the kaiser's crown?\nNow you will have to stay away\nAlike from Rhine and Prague,\nAnd more than that-shame and dismay\nYour days and nights will plague.\nRight well you knew, and all the world,\nRight well they know this thing,\nThat Ferdinand alone can be\nBohemia's lawful king.\nSo come, dear Fritz, rouse up and go\nTo Ferdinand, your king,\nAnd beg him graciously to show\nFull pardon for your sin.\n\"Poor Winter King,\" seventeenth-century song\nWhich of the following best explains why the narrator mentions \"Rhine and Prague\"?\n(A) They are destinations for the Winter King's planned pilgrimage.\n(B) These are lands that the Winter King lost in battle.\n(C) Because these were strongholds of the Holy Roman Empire, the narrator warns the Winter King to stay away.\n(D) They are significant military posts within the borders of the Holy Roman Empire.", "output": "(B)"}
{"input": "This question refers to the following information.\nThis great purity of the French Revolution is precisely what causes both our strength and our weakness. Our strength, because it gives to us rights of the public interest over private interests; our weakness, because it rallies all vicious men against us. We must smother the internal and external enemies of the Republic or perish with it; now in this situation, the first maxim of your policy ought to be to lead the people by reason and the people's enemies by terror. Terror is nothing other than justice, prompt, severe, inflexible; it is therefore an emanation of virtue; it is not so much a special principle as it is a consequence of the general principle of democracy applied to our country's most urgent needs.\nFrench revolutionary leader Maximilien Robespierre, 1794\nWith which of the following threats does the speaker in the passage above seem most concerned?\n(A) Counterrevolutionary opponents\n(B) Foreign invaders\n(C) Communist agitators\n(D) Transnational corporations", "output": "(A)"}
{"input": "This question refers to the following information.\nNo task is more urgent than that of preserving peace. Without peace our independence means little. The rehabilitation and upbuilding of our countries will have little meaning. Our revolutions will not be allowed to run their course. What can we do? We can do much! We can inject the voice of reason into world affairs. We can mobilize all the spiritual, all the moral, all the political strength of Asia and Africa on the side of peace. Yes, we! We, the peoples of Asia and Africa, 1.4 billion strong.\nIndonesian leader Sukarno, keynote address to the Bandung Conference, 1955\nLike numerous other leaders in Africa, Asia, and the Middle East, Sukarno attempted, but did not completely succeed, in maintaining a neutral stance during\n(A) the Arab-Israeli conflict.\n(B) the Korean War.\n(C) the Cold War.\n(D) the Vietnam conflicts.", "output": "(C)"}
{"input": "This question refers to the following information.\nBonesteel's prime consideration was to establish a surrender zone as far north as he thought the Soviets would accept. He knew that the Russian troops could reach the southern tip of Korea before American troops could arrive. He also knew that the Russians were on the verge of moving into Korea, or were already there. The nearest American troops to Korea were on Okinawa, 600 miles away. His problem, therefore, was to compose a surrender arrangement which, while acceptable to the Russians, would at the same time prevent them from seizing all of Korea. If they refused to confine their advance to north Korea, the United States would be unable to stop them. . . . He decided to use the 38th parallel as a hypothetical line dividing the zones within which Japanese forces in Korea would surrender to appointed American and Russian authorities.\n—Adapted from U.S. Army Lt. Paul C. McGrath's account of Colonel Bonesteel's decision in the 1940s\nWhich best describes the relationship between the United States and the Soviets as depicted in the passage?\n(A) Uneasy allies\n(B) Comrades-in-arms\n(C) Mortal enemies\n(D) Distant strangers", "output": "(A)"}
{"input": "This question refers to the following information.\nO ye who believe! Strong drink and games of chance and idols… are only an infamy of Satan's handiwork. Leave it aside in order that ye may succeed.\nthe Qur'an, Sura 5: 89\nWhen once you hear the roses are in bloom,\nThen is the time, my love, to pour the wine.\nthe Rubáiyát of Omar Khayyám\nBoth verses relate most closely to\n(A) key economic processes within Islamic society.\n(B) production of food and drink in Islamic society.\n(C) religious regulation of personal behavior in Islamic society.\n(D) changing gender relations in Islamic society.", "output": "(C)"}
{"input": "This question refers to the following information.\nBonesteel's prime consideration was to establish a surrender zone as far north as he thought the Soviets would accept. He knew that the Russian troops could reach the southern tip of Korea before American troops could arrive. He also knew that the Russians were on the verge of moving into Korea, or were already there. The nearest American troops to Korea were on Okinawa, 600 miles away. His problem, therefore, was to compose a surrender arrangement which, while acceptable to the Russians, would at the same time prevent them from seizing all of Korea. If they refused to confine their advance to north Korea, the United States would be unable to stop them. . . . He decided to use the 38th parallel as a hypothetical line dividing the zones within which Japanese forces in Korea would surrender to appointed American and Russian authorities.\n—Adapted from U.S. Army Lt. Paul C. McGrath's account of Colonel Bonesteel's decision in the 1940s\nHow did the events depicted here affect Koreans?\n(A) They became a part of Japan’s territory.\n(B) The Americans established freedom for all Koreans.\n(C) The Korean economy never recovered.\n(D) Korea remains divided into two nations near the 38th parallel.", "output": "(D)"}
{"input": "This question refers to the following information.\nThe passage below is taken from testimony before Parliament.\nJoshua Drake, called in; and Examined.\nYou say you would prefer moderate labour and lower wages; are you pretty comfortable upon your present wages?\n—I have no wages, but two days a week at present; but when I am working at some jobs we can make a little, and at others we do very poorly.\nWhen a child gets 3s. a week, does that go much towards its subsistence?\n—No, it will not keep it as it should do.\nWhy do you allow your children to go to work at those places where they are ill-treated or over-worked?\n—Necessity compels a man that has children to let them work.\nThen you would not allow your children to go to those factories under the present system, if it was not from necessity?\n—No.\n—Testimony given before the Sadler Committee, 1831–32\nWhich period in history is associated with the conditions described in the passage?\n(A) The Enlightenment\n(B) The Green Revolution\n(C) The Scientific Revolution\n(D) The Industrial Revolution", "output": "(D)"}
{"input": "This question refers to the following information.\nAlthough in Protestant Europe, [Peter the Great] was surrounded by evidence of the new civil and political rights of individual men embodied in constitutions, bills of rights and parliaments, he did not return to Russia determined to share power with his people. On the contrary, he returned not only determined to change his country but also convinced that if Russia was to be transformed, it was he who must provide both the direction and the motive force. He would try to lead; but where education and persuasion were not enough, he could drive—and if necessary flog—the backward nation forward.\n—Robert K. Massie, Peter the Great: His Life and World\nBased on the above passage, what kinds of reforms did Peter the Great embrace?\n(A) Creation of an elected assembly\n(B) Declarations of human rights\n(C) Development of a constitutional monarchy\n(D) Reduction of aristocratic influence", "output": "(C)"}
{"input": "This question refers to the following information.\nThe invaders had brought in wheat and other Eurasian and African grains; peach, pear, orange, and lemon trees; chick-peas, grape vines, melons, onions, radishes, and much more. A Spanish nobleman come to America could require his Indians to furnish his table with the fruits of his ancestors.\n—Alfred Crosby, historian, 1972\nThe comment quoted above resulted from which of the following processes?\n(A) The Green Revolution\n(B) The Columbian Exchange\n(C) The triangular trade\n(D) The Middle Passage", "output": "(B)"}
{"input": "This question refers to the following information.\n\"From the confines of Jerusalem and the city of Constantinople a horrible tale has gone forth and very frequently has been brought to our ears, namely, that a race from the kingdom of the Persians, an accursed race, a race utterly alienated from God, a generation forsooth which has not directed its heart and has not entrusted its spirit to God, has invaded the lands of those Christians and has depopulated them by the sword, pillage and fire; it has led away a part of the captives into its own country, and a part it has destroyed by cruel tortures; it has either entirely destroyed the churches of God or appropriated them for the rites of its own religion….The kingdom of the Greeks is now dismembered by them and deprived of territory so vast in extent that it cannot be traversed in a march of two months. On whom therefore is the labor of avenging these wrongs and of recovering this territory incumbent, if not upon you? You, upon whom above other nations God has conferred remarkable glory in arms, great courage, bodily activity, and strength to humble the hairy scalp of those who resist you.\nLet the deeds of your ancestors move you and incite your minds to manly achievements; the glory and greatness of king Charles the Great, and of his son Louis, and of your other kings, who have destroyed the kingdoms of the pagans, and extended in these lands the territory of the holy church. Let the holy sepulchre of the Lord our Savior, which is possessed by unclean nations, especially incite you, and the holy places which are now treated with ignominy and irreverently polluted with their filthiness. Oh, most valiant soldiers and descendants of invincible ancestors, be not degenerate, but recall the valor of your progenitors.\nJerusalem is the navel of the world; the land is fruitful above others, like another paradise of delights. This the Redeemer of the human race has made illustrious by His advent, has beautified by residence, has consecrated by suffering, has redeemed by death, has glorified by burial. This royal city, therefore, situated at the center of the world, is now held captive by His enemies, and is in subjection to those who do not know God, to the worship of the heathens. She seeks therefore and desires to be liberated and does not cease to implore you to come to her aid. From you especially she asks succor, because, as we have already said, God has conferred upon you above all nations great glory in arms. Accordingly undertake this journey for the remission of your sins, with the assurance of the imperishable glory of the kingdom of heaven.\"\nPope Urban II, Speech at the Council of Clermont as recorded by Robert the Monk, 1095 C.E.\nWhich of the following events most directly inspired Urban's invocation of Constantinople in the first paragraph?\n(A) The conquest of Constantinople by the armies of the Abbasid Caliphate\n(B) The invasion of Anatolia by the Seljuk Turks\n(C) The invasion of the Balkans by the Avars and Bulgars\n(D) The conversion of the people of Constantinople to Catholic Christianity", "output": "(B)"}
{"input": "This question refers to the following information.\nYi Yin sacrificed to the former king, and presented the heir-king reverently before the shrine of his grandfather. . . . Yi Yin then clearly described the virtue of the Meritorious Ancestor for the instruction of the young king.\n\"Oh! of old the former kings of Xia cultivated earnestly their virtue, and then there were no calamities from Heaven. The spirits of the hills and rivers were all in tranquility; and the birds and beasts enjoyed their existence according to their nature. But their descendant did not follow their example, and Heaven sent down calamities, using our ruler, who possessed of its favor. The attack on Xia may be traced to the orgies in Ming Tiao. . . . Our king of Shang brilliantly displayed his sagely prowess; for oppression he substituted his generous gentleness. Now your Majesty is entering on the inheritance of his virtue; all depends on how you commence your reign.\n\"Oh! the former king began with careful attention to the bonds that hold men together. . . . Revere these warnings in your person. . . . The ways of Heaven are not invariable: on the good-doer it sends down all blessings, and on the evil-doer it sends down all miseries. If you not be virtuous, be it in large things or in small, it will bring the ruin of your ancestral temple.\"\n—Excerpted and adapted from the Shu Jing, 6th century BCE, China\nWhich phrase can be seen as a statement of the roots of Daoist beliefs?\n(A) Our king of Shang brilliantly displayed his sagely prowess.\n(B) The former king began with careful attention to the bonds that hold men together.\n(C) The birds and beasts . . . enjoyed their existence according to their nature.\n(D) The ways of Heaven are not invariable: on the good-doer it sends down all blessings.", "output": "(C)"}
{"input": "This question refers to the following information.\nQuestions to the passage below, an account given to a French officer in Algeria in the 1830s by a member of an Arab slave trade caravan.\nThe Slave Trade\nAll of you [soldiers], are summoned . . . to hunt the idolatrous Koholanes [a pejorative word for \"black Africans\"]. . . . The soldiery divided themselves into two companies . . . with orders to attack places without defenses and to carry off the inhabitants as well as seizing all peasants busy cultivating their fields. . . . Whilst waiting for the return of the companies despatched to hunt Negroes, we went every day to the slave market where we bought at the following prices:\nA Negro with beard………………10 or 15,000 cowries.\nThey are not considered as merchandise since one has little chance of preventing them from escaping.\nAn adult Negress………………..10 or 15,000 cowries for the same reasons\nAn adolescent Negro………………….30,000 cowries\nA young Negress ……………………50–60,000 cowries\nThe price varies according to whether she is more or less beautiful.\nA male Negro child……………………..45,000 cowries\nA female Negro child ……………………….35–40,000 cowries\nFinally, our caravan which had set out from Algeria with sixty-four camels and only sixteen persons, was now augmented by four hundred slaves, of whom three hundred were women. . . . It was at this point that suddenly a confused noise of cries and sobs passed from one group of slaves to another and reached our own. . . . Some rolled on the ground, clung to bushes and absolutely refused to walk. . . . They could only be got up with mighty lashes of the whip and by rendering them completely bloody.\nWhich statement best supports the argument that religion played a role in the Arab slave trade?\n(A) Seizing all peasants busy cultivating their fields\n(B) With orders to attack places without defenses\n(C) Four hundred slaves, of whom three hundred were women\n(D) All of you [soldiers], are summoned . . . to hunt the idolatrous Koholanes", "output": "(D)"}
{"input": "This question refers to the following information.\nI don't know whether this world has meaning that transcends it. But I know that I do not know that meaning, and that it is impossible just now for me to know it. What can a meaning outside my condition mean to me? I can understand only in human terms.\nAlbert Camus, \"The Myth of Sisyphus,\" 1955\nThe passage above is best seen as exemplifying which of the following intellectual trends?\n(A) A postwar reassertion of traditional religious values\n(B) An expression of patriotic pride thanks to victory in World War II\n(C) A modernist tendency to question the validity of faith-based moralities\n(D) An increased willingness to embrace radical Marxism", "output": "(C)"}
{"input": "This question refers to the following information.\nI walk alongside the column, ask what's going on.\nA soldier says simply: \"They call up more every day.\n\"Some of us were sent north to the Yellow River at age fifteen,\nAnd now at forty we're heading off to the garrisons in the west.\nOn our first tour, the village headman had to tie our bandannas for us.\nWhen we came back, our hair was white, but still there's more unrest.\nThe frontier garrisons run with blood, enough to fill an ocean,\nBut the Martial Emperor's territorial ambitions have yet to crest.\nIn the hundred districts east of the mountains, throughout the land of Han,\nThere must be ten thousand villages that brambles now infest.\nEven if wives are strong enough to handle a hoe and plow,\nThe crops grow every which way, the fields are all a mess.\nIt's hardest for the Shanxi men, with their reputations as fighters:\nThey're rounded up like dogs or chickens, every male impressed.\n\"But sir, though it's good of you to ask,\nComplaining isn't part of the soldier's task.\nWe can only shake our heads. Take this winter:\nThe Shanxi troops were never sent home.\nThe District Officers are demanding the land tax,\nBut where will it come from? You can't get blood from a stone!\nI honestly think it's bad luck to bear a son now,\nIt's better to have a daughter: at least she can marry\nAnd live with the neighbors next door.\nBut a son will end up lying on some distant prairie.\"\nDu Fu, \"Ballad of the Army Carts,\" ca. 750 C.E.\nThe poem provides evidence of which of the following as a major cause of later Tang decline?\n(A) Discontent among the peasantry due to oppressive taxation\n(B) Foreign invasion of the Tang heartlands\n(C) The spread of Buddhism and Taoism as a reaction to state-sponsored Confucianism\n(D) An ineffective bureaucracy and poor leadership", "output": "(A)"}
{"input": "This question refers to the following information.\n\"Article 1\nThe Parties undertake, as set forth in the Charter of the United Nations, to settle any international dispute in which they may be involved by peaceful means in such a manner that international peace and security and justice are not endangered, and to refrain in their international relations from the threat or use of force in any manner inconsistent with the purposes of the United Nations.\n\"Article 2\nThe Parties will contribute toward the further development of peaceful and friendly international relations by strengthening their free institutions, by bringing about a better understanding of the principles upon which these institutions are founded, and by promoting conditions of stability and well-being. They will seek to eliminate conflict in their international economic policies and will encourage economic collaboration between any or all of them.\n\"Article 3\nIn order more effectively to achieve the objectives of this Treaty, the Parties, separately and jointly, by means of continuous and effective self-help and mutual aid, will maintain and develop their individual and collective capacity to resist armed attack…\n\"Article 5\nThe Parties agree that an armed attack against one or more of them in Europe or North America shall be considered an attack against them all and consequently they agree that, if such an armed attack occurs, each of them, in exercise of the right of individual or collective self-defence recognised by Article 51 of the Charter of the United Nations, will assist the Party or Parties so attacked by taking forthwith, individually and in concert with the other Parties, such action as it deems necessary, including the use of armed force, to restore and maintain the security of the North Atlantic area.\"\nNorth Atlantic Treaty, April 4, 1949\nThe treaty above is most clearly an example of which of the following?\n(A) A reduction of barriers to trade across international borders\n(B) A secret treaty to maintain the balance of power in Europe\n(C) Reconstruction efforts to rebuild Europe after World War II\n(D) A response to aggression from outside of Western Europe", "output": "(D)"}
{"input": "This question refers to the following information.\n\"The question as to who, and what, is responsible for African underdevelopment can be answered at two levels. Firstly, the answer is that the operation of the imperialist system bears major responsibility for African economic retardation by draining African wealth and by making it impossible to develop more rapidly the resources of the continent. Secondly, one has to deal with those who manipulate the system and those who are either agents or unwitting accomplices of the said system. The capitalists of Western Europe were the ones who actively extended their exploitation from inside Europe to cover the whole of Africa.\"\nWalter Rodney, historian, How Europe Underdeveloped Africa, 1974\nWhich of the following best explains the importance of trading contacts with Europeans for Sub-Saharan Africans in the period 1450 to 1750 C.E.?\n(A) Sub-Saharan Africans relied on European merchants to sustain population growth through the constant importation of New World foodstuffs.\n(B) Sub-Saharan Africans consolidated new states and kingdoms by trading with the Europeans for firearms.\n(C) Sub-Saharan Africans depended on European merchants as the sole purchasers of slaves.\n(D) Sub-Saharan Africans allied with European powers to evict Muslim and Arab merchant princes from encroaching on their sovereignty.", "output": "(B)"}
{"input": "This question refers to the following information.\n\"MAHATMA GANDHI'S MESSAGE.\nREMAIN NON-VIOLENT\nThe following message was sent by Mahatma Gandhi from Waltair:—\nMaulana Mohamed AH was arrested at Waltair under sections 107 and 108 to be called upon to give security, to be of good behaviour for one year. The place and date of trial is unknown.\nThe Begum Saheba and Mr. Hayat were permitted to see him after arrest.\nHe and I were going to address a meeting outside the station. He was arrested. I continued going to the meeting and addressed them. There is no cause for sorrow, but every cause for congratulation. There should be no hartal. Perfect peace and calmness should be observed. I regard the arrest as a prelude to Swaraj and the redress of the Khilafat and the Punjab wrongs, if we can remain non-violent. Retain Hindu-Muslim Unity despite the madness of some Moplahs, and fulfil the Swadeshi programme.\nI hope every Indian, man or woman, will completely boycott foreign cloth and take up spinning or weaving during every spare minute.\nBy striving like the Maulana, be insistent on religious and national rights.\nLet us earn imprisonment. I am conscious of the Maulana's innocence and I am sure the imprisonment of the innocent will enable the nation to reach the cherished goal.\"\nMohandas Gandhi, The Pilgrims' March, 1921\nThe instructions indicated in the fourth paragraph to remain nonviolent most likely inspired which of the following historical developments?\n(A) The Zionist movement that created the modern state of Israel\n(B) The independence movements that freed the states of southeast Asia from colonial rule\n(C) The civil rights movements that changed the legal status of minorities in the United States\n(D) The communist movement that changed the government of Cuba", "output": "(C)"}
{"input": "This question refers to the following information.\nAlthough in Protestant Europe, [Peter the Great] was surrounded by evidence of the new civil and political rights of individual men embodied in constitutions, bills of rights and parliaments, he did not return to Russia determined to share power with his people. On the contrary, he returned not only determined to change his country but also convinced that if Russia was to be transformed, it was he who must provide both the direction and the motive force. He would try to lead; but where education and persuasion were not enough, he could drive—and if necessary flog—the backward nation forward.\n—Robert K. Massie, Peter the Great: His Life and World\nWhat term best describes Peter the Great's ruling style as described in the passage?\n(A) Egalitarian\n(B) Absolutist\n(C) Republican\n(D) Theocratic", "output": "(B)"}
{"input": "This question refers to the following information.\nBy what principle of reason then, should these foreigners send in return a poisonous drug? Without meaning to say that the foreigners harbor such destructive intentions in their hearts, we yet positively assert that from their inordinate thirst after gain, they are perfectly careless about the injuries they inflict upon us! And such being the case, we should like to ask what has become of that conscience which heaven has implanted in the breasts of all men? We have heard that in your own country opium is prohibited with the utmost strictness and severity. This is a strong proof that you know full well how hurtful it is to mankind. Since you do not permit it to injure your own country, you ought not to have this injurious drug transferred to another country, and above all others, how much less to the Inner Land! Of the products which China exports to your foreign countries, there is not one which is not beneficial to mankind in some shape or other.\nLin Zexu, Chinese trade commissioner, letter to Queen Victoria, 1839\nWhich of the following background facts persuaded Europeans to engage in the actions described in the passage?\n(A) China had recently placed an embargo on exports of silk.\n(B) The price of Chinese tea had risen higher than European buyers found acceptable.\n(C) China refused to allow a meaningful volume of European goods to be sold there.\n(D) China's emperor had repeatedly insulted the British ambassador.", "output": "(C)"}
{"input": "This question refers to the following information.\nSource 1:\n\"You may well ask: \"Why direct action? Why sit-ins, marches and so forth? Isn't negotiation a better path?\" You are quite right in calling, for negotiation. Indeed, this is the very purpose of direct action. Nonviolent direct action seeks to create such a crisis and foster such a tension that a community which has constantly refused to negotiate is forced to confront the issue. It seeks so to dramatize the issue that it can no longer be ignored. My citing the creation of tension as part of the work of the nonviolent-resister may sound rather shocking. But I must confess that I am not afraid of the word \"tension.\" I have earnestly opposed violent tension, but there is a type of constructive, nonviolent tension which is necessary for growth. Just as Socrates felt that it was necessary to create a tension in the mind so that individuals could rise from the bondage of myths and half-truths to the unfettered realm of creative analysis and objective appraisal, we must we see the need for nonviolent gadflies to create the kind of tension in society that will help men rise from the dark depths of prejudice and racism to the majestic heights of understanding and brotherhood.\"\nMartin Luther King, Jr., Letter from a Birmingham Jail, 1966\nSource 2:\n\"We, men and women, who hereby constitute ourselves as the National Organization for Women, believe that the time has come for a new movement toward true equality for all women in America, and toward a fully equal partnership of the sexes, as part of the world-wide revolution of human rights now taking place within and beyond our national borders.\nThe purpose of NOW is to take action to bring women into full participation in the mainstream of American society now, exercising all the privileges and responsibilities thereof in truly equal partnership with men.\nWe believe the time has come to move beyond the abstract argument, discussion and symposia over the status and special nature of women which has raged in America in recent years; the time has come to confront, with concrete action, the conditions that now prevent women from enjoying the equality of opportunity and freedom of which is their right, as individual Americans, and as human beings.\"\nNational Organization for Women, Statement of Purpose, 1966\nSource 3:\n\"The long-term goal of Gay Liberation, which inevitably brings us into conflict with the institutionalized sexism of this society, is to rid society of the gender-role system which is at the root of our oppression. This can only be achieved by eliminating the social pressures on men and women to conform to narrowly defined gender roles. It is particularly important that children and young people be encouraged to develop their own talents and interests and to express their own individuality rather than act out stereotyped parts alien to their nature.\nAs we cannot carry out this revolutionary change alone, and as the abolition of gender rotes is also a necessary condition of women's liberation, we will work to form a strategic alliance with the women's liberation movement, aiming to develop our ideas and our practice in close inter-relation. In order to build this alliance, the brothers in gay liberation will have to be prepared to sacrifice that degree of male chauvinism and male privilege that they still all possess.\"\nGay Liberation Front, Manifesto, 1971\nThe author of Source 1 endorses which of the following tactics as a means of achieving his aims?\n(A) Violent overthrow of the government\n(B) Nonviolent resistance\n(C) Appeasement\n(D) Legal action", "output": "(B)"}
