{"input": "Which of the following best describes the relationship between postcolonialism and security studies?\n(A) Postcolonialism sits outside security studies, as it concerns only the welfare of nations and peoples once subject to imperial power.\n(B) Despite some minor differences, postcolonialism shares with traditional security studies its view of the international system and world powers.\n(C) Postcolonialism rejects the concept of power that is central to within security studies and rejects the notion that traditionally dominant states, such as the USA, should be considered powerful.\n(D) Relations between postcolonialism and security studies are tense and contested. Postcolonialism questions the standard Westphalian account of world history that is the basis of security studies.", "output": "(D)"}
{"input": "Which of the following is not a motivation for utilising aid as an economic policy for security?\n(A) To reward recipients for the cessation of negative behaviour, such as human rights abuses.\n(B) To incentivise recipients to act in ways beneficial to the donor.\n(C) Compassion for the human suffering of others.\n(D) To influence recipients or potential recipients through granting or denying aid.", "output": "(C)"}
{"input": "Which of the following describes the basis of the case in support of humanitarian intervention?\n(A) Associated with liberalism and cosmopolitanism, the foundational idea in support of humanitarian intervention is that external actors have a duty as well as a right to intervene to halt genocide and mass atrocities.\n(B) Just War theory and Christian theology can be interpreted to advocate the use of force through humanitarian intervention where the need to allay human suffering justifies such actions.\n(C) The case for humanitarian intervention rests on the Kantian philosophy that individuals have fundamental human rights that must be protected.\n(D) Due to the social interconnectedness that is the result of globalisation, and which characterises the contemporary global society, human rights violations in one part of the world will affect every other part in some way.", "output": "(A)"}
{"input": "How can examination of previous state practice and policy be used to justify humanitarian intervention?\n(A) Previous state practice does not illustrate any successful acts of humanitarian intervention, instead indicating that future acts of intervention need to be more closely regulated by international governing bodies.\n(B) Every humanitarian crisis since the Cold War has been met with humanitarian intervention as a response from the international society, and as a result countless deaths through genocide avoided.\n(C) State practice since the end of the Cold War suggests that there is a customary right of humanitarian intervention, but not of duty, in response to humanitarian emergencies.\n(D) Examples of humanitarian intervention, such as intervention during the Rwandan genocide in 1994, illustrate previous policy that supports the claims to a right of humanitarian intervention.", "output": "(C)"}
{"input": "What can social constructivism offer to the discipline of Security Studies?\n(A) The social constructivist perspective has been largely criticised in its failure to be applicable to contemporary conflict situations. The strength of the approach lies in its application to theories of social security.\n(B) Social constructivism supports realist theory and provides ontological clarification for some of the questions raised by the traditionalist approach.\n(C) The social constructivist perspective offers the possibility of moving beyond the logic of anarchy that underpins the realist approach to security studies.\n(D) Security studies is best approached using a social constructivist perspective, as this will aide the formulation of empirically testable theories and reveal truths about the international system for further investigation.", "output": "(C)"}
