{"input": "In 1960, a widower, advancing into old age, realizes that he is no longer able to farm his 1,000 acres; therefore, he decides to sell some of the farmland in parcels of 250 acres. The president of a development company is interested in purchasing three of the parcels. The president buys the three parcels from the widower and begins formulating plans for constructing single-family dwelling units on the land, which is located in an upper-middle-class area of the county. The original deed between thewidower and the development company contains a provision expressly binding \"upon all subsequent grantees, their heirs, and assigns,\" stipulating that any further subdivisions by any such persons shall be restricted to minimum two-acre lots to be used for single-family dwelling units only. In the original deed between the widower and the development company, the stipulation that restricted the size and residential character of any subsequent subdivision of the parcels is an example of a (an)\n(A) easement.\n(B) affirmative covenant.\n(C) covenant for quiet enjoyment.\n(D) negative covenant.", "output": "(D)"}
{"input": "An owner of a pharmaceutical company manufactures aspirin tablets that it sells in interstate commerce. A woman purchased a bottle of the owner's aspirin from a drugstore. Shortly after taking two of the aspirin tablets, the woman became extremely ill and began having convulsions. She was rushed to the hospital, where it was determined that the aspirin tablets contained strychnine, a poisonous chemical. The owner of the pharmaceutical company is subsequently charged with violating a federal statute that makes it a misdemeanor to transport impure drugs in interstate commerce. The owner should be found\n(A) guilty, only if he had the authority and responsibility for packaging the aspirin tablets. \n(B) guilty, only if he knew or should have known that the aspirin tablets were poisonous. \n(C) guilty, only if he personally supervised the packaging of the aspirin tablets. \n(D) guilty, only if he knew that other customers had purchased poisonous aspirin tablets in the past. ", "output": "(A)"}
{"input": "A man has sued a police officer, alleging that the officer violated the man's civil rights by using excessive force while arresting him. At trial, the officer admits having hit the man in the head with the butt of his gun, but contends that the force was necessary, because the man was resisting arrest. In support of his contention, the officer seeks to introduce evidence that the man had resisted arrest on three prior occasions during the last 10 years. Is this testimony regarding the man's conduct during the three prior arrests admissible? \n(A) No, because evidence of the prior incidents constitutes impermissible character evidence.\n(B) No, because the officer has not shown that the man was convicted in connection with the prior incidents.\n(C) Yes, because the incidents in question are relevant evidence of the man's propensity for violence.\n(D) Yes, because the incidents in question are sufficient to constitute a habit.", "output": "(A)"}
{"input": "A private developer sought a building permit to build a nursing home in a district that was zoned \"residential\" by the township. The home would house 200 beds for persons needing nursing home care for the remainder of their lives. The state government approved the request and certified the need for more nursing homes in that township. The township, however, vehemently opposed permitting a nursing home in a residential zoning district and refused the building permit. The township's zoning law has 15 residential zones, each of which does not allow a nursing home. The nursing home sued in federal court requesting declaratory and injunctive relief on the basis that the zoning law was discriminatory against handicapped persons and a violation of federal law. Will the court compel the township to allow the construction of the nursing home?\n(A) Yes, under federal law all municipalities must provide reasonable accommodations to handicapped persons, and the zoning law in question violates that mandate.\n(B) No, it is strictly a matter of local preference whether a particular use will be allowed in a zoning district.\n(C) No, because there are numerous other locations for nursing homes within the state, a local community's restriction against that use is not discriminatory.\n(D) Yes, the zoning law represents an unconstitutional denial of substantive due process to handicapped persons.", "output": "(A)"}
{"input": "A hardware store had a public pay telephone attached to the outside wall of its building. The telephone was owned and operated by the local telephone company. On Thursday, November 25, the store was closed for Thanksgiving. A resident, who lived two doors away, walked to the hardware store to use the telephone. He wanted to call his son and daughter- in-law to wish them a happy Thanksgiving, but his home phone was out of order. The resident picked up the receiver, inserted coins for the cost of the call, and promptly received an electric shock. Although the resident was momentarily stunned, he did not suffer any pain or injuries. Unbeknownst to the resident, a technician employed by the telephone company had incorrectly rewired the telephone the previous day, causing a short circuit in the telephone mechanism. If the resident institutes a personal injury action for negligence against the telephone company, he will most likely\n(A) recover, because the technician's error would constitute the proximate cause of the resident's injuries. \n(B) recover, because the technician's error was a substantial factor in causing the resident's injuries. \n(C) recover, under the doctrine of respondeat superior\n(D) not recover, because the resident did not suffer any injuries. ", "output": "(D)"}
