{"input": "For which of the following preliminary questions of fact will the trial court judge, not the jury, determine admissibility?\n(A) Whether the voice on a sound recording is that of the defendant.\n(B) Whether defendant's copy of a document accurately reflects the contents of the original writing.\n(C) Whether a conspiracy existed and defendant and declarant were members of the conspiracy before admitting an alleged declaration by a co-conspirator.\n(D) A plaintiff sues on a lost writing, and the defendant contends that it was not lost because it never existed. The question to be decided is whether the original writing ever existed.", "output": "(C)"}
{"input": "A son loaned his father a large sum of money. The father signed a 10-year promissory note and secured the note with a mortgage on his farm. The mortgage was promptly recorded. The next year, the father died intestate. The father's heirs were the son and his two sisters. The sisters first learned of the mortgage just after their father died. The sisters now assert that the son, their brother, holds the mortgage for their benefit as well as for himself because as a tenant in common with his sisters, he has a fiduciary duty toward them. There are no applicable statutes. Are the sisters correct?\n(A) No, because the mortgage was granted before the tenancy in common was created.\n(B) No, because the three siblings took the farm as tenants in common rather than as joint tenants with right of survivorship.\n(C) Yes, because a fiduciary relationship exists among tenants in common.\n(D) Yes, because their three interests are equal.", "output": "(C)"}
{"input": "A ski resort had a lift that carried customers from the bottom to the top of the ski slope. One afternoon, the lift suddenly broke down because of a power failure in the area. A customer was suspended in his lift chair, one-third of the way up the hill and 50 feet above the ground. The customer remained on the lift for five hours until power was restored. He was then returned uninjured to the bottom of the hill. In a suit against the ski resort, the customer is likely to have action for\n(A) false imprisonment.\n(B) negligence.\n(C) assault.\n(D) no cause of action.", "output": "(D)"}
{"input": "A woman had spent many years converting her back yard to an authentic Japanese-style garden. Her garden had become a showplace for the neighborhood, and various civic groups and organizations frequently visited the woman's property to enjoy the beauty of the yard. Recently, the woman had read about a particular cymbidium that was native to Japan. Desiring to have one of these cymbidiums planted in her garden, she contacted a number of plant distributors, only to discover that this particular cymbidium had not yet been imported to the United States. She contacted a plant distributor, who she knew had ties to Japan, and asked if it would be possible to acquire one of these cymbidiums from Japan. After checking with local and Japanese authorities, the distributor determined that he could indeed acquire the plant for the woman. The parties then signed a contract that stated the distributor would acquire the cymbidium from a nursery in Japan, have it shipped to the United States and have it planted in the woman's garden for the price of $5,000. The distributor promised that the plant would be in place within six months, and the woman promised to pay $1,000 at the time of the execution of the contract and$4,000 when the cymbidium was planted in her garden. The woman then handed a check for $1,000 to the distributor. Two weeks later, agricultural officials discovered that a special type of beetle that attacked citrus plants had adapted to using cymbidiums for nesting purposes. The female beetle would lay eggs among the roots of the cymbidiums, and it would sometimes take up to one year for the eggs to hatch. Fearing for the safety of the citrus crops in the United States, the United States government adopted a ban on the importation of all cymbidiums grown in foreign countries. As a result, the distributor was not able to acquire the cymbidium for the woman. Which of the following best states the legal relationship at this point between the distributor the woman?\n(A) The distributor's performance was excused because of impossibility, but the woman can seek restitution.\n(B) The distributor's performance was not excused because of the supervening illegality, and the woman can recover damages because of the distributor's prospective inability to perform.\n(C) The distributor's performance was not excused because of the supervening illegality, and the woman can recover damages, provided she waits until the date performance was due before filing suit.\n(D) Both parties are excused from performance because of the supervening illegality, and neither can recover from the other.", "output": "(A)"}
{"input": "A defendant and a victim were roommates at college. The defendant was playing the role of a serial killer in the school play and asked the victim if she could leave their apartment for a few hours while she rehearsed. The victim agreed but returned to the apartment shortly thereafter because she was curious and wanted to see the defendant rehearse. The victim quietly came back into the apartment and hid behind some curtains in the dining room in order to watch the defendant rehearse. In her role, the defendant earned a large butcher's knife, with which she stabbed the curtains at her \"victim. \" Unknown to the defendant, the victim, who was hiding behind the curtain, was stabbed in the chest and killed. If the defendant is prosecuted for the victim's death, she should be found\n(A) guilty of murder.\n(B) guilty of manslaughter.\n(C) guilty of battery.\n(D) not guilty.", "output": "(D)"}
{"input": "Buyer is purchasing a bicycle based on the salesperson's understanding of buyer's goals and seller's knowledge. What kind of warranty might this be considered?\n(A) Warranty of Fitness for Particular Purpose.\n(B) Warranty of Merchantability\n(C) Express\n(D) Implied", "output": "(A)"}
{"input": "A husband and his wife are involved in a contested divorce and child custody battle. Ignorant of the adversarial system, they both visited a family law attorney together for an initial consultation. The attorney advised them that he could not represent them both. The wife found another attorney. During the trial, the wife's attorney calls the wife to testify. She states that during the initial consultation she and her husband had with his attorney, she privately told the attorney, when her husband was taking a bathroom break, that her husband had a bad drinking problem, which was one of her major reasons for seeking a divorce and custody of the children. Upon objection by the husband's attorney, the wife's testimony should be\n(A) admitted, because the spousal privilege is inapplicable, since the parties are living in separation.\n(B) admitted, because the marital communication privilege is inapplicable in a lawsuit involving the parties.\n(C) excluded, because the wife is incompetent to testify to marital communications because she is not the holder of the privilege.\n(D) excluded, because confidential statements made during a joint consultation are privileged communications between clients and their attorneys.", "output": "(B)"}
{"input": "Calvin Poultry Co. offered to sell Chickenshop 20,000 pounds of chicken at 40 cents per pound under specified delivery terms. Chickenshop accepted the offer as follows: \"We accept your offer for 20,000 pounds of chicken at 40 cents per pound per city scale weight certificate.\" Which of the following is correct?\n(A) A contract was formed on Calvin's terms.\n(B) Chickenshop's reply constitutes a conditional acceptance, but not a counteroffer.\n(C) Chickenshop's reply constitutes a counteroffer and no contract was formed.\n(D) A contract was formed on Chickenshop's terms.", "output": "(D)"}
{"input": "Alice owned Greyacre, a one-acre piece of property, in fee simple. Alice sold the property to Barbara who moved into the only residence on the land. Barbara neglected to record the deed, and three years later, Alice conveyed the same property to Charlene who immediately filed the deed she received from Alice. Greyacre's jurisdiction has a race-notice statute and a tract index system. If an action is filed for title to the property, the likely outcome would be for\n(A) Alice, since her ownership was first in time and she was of record.\n(B) Barbara, because Charlene had notice of the prior conveyance between Alice and Barbara.\n(C) Barbara, because she was the first to record her deed.\n(D) Charlene, because she was the first to record her deed.", "output": "(B)"}
{"input": "The prime minister of a foreign country was assassinated by a group of right wing extremists. The prime minister's death triggered a civil war between rival factions within the country. To prevent U. S. involvement in this country's political crisis, Congress passed an appropriations bill prohibiting any funding for U. S. military operations in this foreign country. The appropriations bill was passed over a presidential veto. Thereafter, the President issued an executive order directing U. S. Navy and Army troops to the foreign country to restore order. Is this executive order constitutional?\n(A) Yes, because the President, as commander- in-chief of the armed forces, has the power to authorize such military expeditions.\n(B) Yes, because the President has inherent power to regulate foreign affairs as long as there is no formal declaration of war.\n(C) No, because the President cannot usurp Congress's spending power by taking action that supersedes a congressional appropriations bill.\n(D) No, because the executive order was neither authorized by federal statute nor ratified by the Senate.", "output": "(C)"}
{"input": "On November 1, Beeson contracted to purchase from Sloan for $250,000 certain property located in the City of La Mirada. In the contract of sale, Beeson and Sloan agreed that the property was to be used for the purpose of building a commercial shopping mall. The contract required Beeson to pay Sloan a deposit of $12,500, with the balance of the purchase price payable at closing a month later on December 1. On November 24, the city council rezoned the property so that it could be used only for single-family residential purposes. As a consequence, Beeson refused to honor the contract. Sloan now brings an action for specific performance arguing that the doctrine of equitable conversion places the loss on the buyer. Beeson argues that to enforce the contract would be harsh and oppressive to him. If judgment is for Beeson, it will most likely be because\n(A) Sloan assumed the risk.\n(B) Sloan would be unjustly enriched.\n(C) legal title remained in Sloan.\n(D) equity will relieve Beeson of a bad bargain.", "output": "(B)"}
{"input": "A deed executed by a grantor conveyed his property for a consideration of one dollar, receipt of which was acknowledged, \"to my brother for life, then to the heirs of my brother. \" A life interest in the property for the life of the brother is worth $20,000 on the date of the conveyance. The total worth of the property is $50,000. The brother accepted but didn't record the deed. The recording statute in this jurisdiction provided \"unless recorded, all written instruments affecting title to land are void as to subsequent purchasers who paid value and without notice. \"Four years later, the grantor purported to convey his property in fee simple absolute to his two sons, by a warranty deed, as a gift. The two sons recorded the deed. Shortly thereafter, the brother ascertained that the grantor's sons were about to take possession of the property. As a consequence, the brother promptly recorded his deed. In a dispute between the brother and the grantor's children as to the ownership of the property, if the brother prevails it will be because\n(A) the brother paid valuable consideration for his deed.\n(B) the brother recorded his deed before the grantor's children sought to oust him from the land.\n(C) the grantor's sons are not protected by the recording statute.\n(D) the grantor's knowledge is imputed to his children.", "output": "(C)"}
{"input": "A man is sitting on a beach chair, peacefully and in a relaxed meditative state, when a truck racing on the sand ran down a sunbathing elderly person. The man said out loud, \"Oh God, look what that truck driver did. The man driving that truck was racing and going about 100 mph.! Someone call 911!!\" A woman, who was sitting on the beach nearby, but facing the other way, heard the man's outcry. When the case comes to trial, will the court allow both the man and the woman to testify about the man's utterances?\n(A) Yes, both the woman and the man can testify because it is an excited utterance exception to the hearsay rule that goes to the material issue of the case.\n(B) Yes, because this is not hearsay and it is not being entered for the truth of the statement by either witness so that they can both testify.\n(C) No, neither of them can testify because the man was impaired due to being too relaxed from his meditation, and the woman cannot repeat the utterances of an impaired witness.\n(D) No, neither can testify because the utterances do not fit any of the exceptions to the hearsay rule.", "output": "(A)"}
{"input": "A passenger on a subway car placed her pocketbook on the seat next to her and began to zip up her jacket. Defendant was standing in front of the passenger and holding on to the hand rail. Seeing the pocketbook unattended, he suddenly grabbed it and tried to run away. As he did so, the passenger became very frightened and fell backward. She struck her head against the window and was knocked unconscious. In the commotion, Defendant dropped the pocketbook and hurriedly exited the subway car empty-handed. Defendant should be found guilty of\n(A) larceny.\n(B) attempted larceny.\n(C) assault.\n(D) robbery.", "output": "(A)"}
{"input": "A homeowner awoke one night and observed a thief stealing chickens from his backyard chicken coop. He thought he saw a gun but could not tell for sure. While the thief was exiting with a sack of chickens, the homeowner got his hunting rifle and shot him dead. The authorities charged the homeowner with homicide. At the trial, he defended on the basis that he was in fear for his safety, and was legally authorized to use deadly force to defend his dwelling and person from the illegal threat. Is the defense to homicide valid under these facts?\n(A) Yes, he was authorized to use deadly force where he reasonably believed that the thief had a gun and would harm him.\n(B) No, because it is not reasonable to use deadly force to prevent the theft of the chickens.\n(C) No, because a homeowner can never legally use deadly force to stop a theft.\n(D) Yes, because a dwelling owner can always use deadly force to protect his property and person from an illegal trespasser or thief.", "output": "(B)"}
{"input": "A woman was seven months pregnant with her first child. One afternoon, the woman was in the kitchen of her home preparing a snack when she glanced out the window and saw a horrible crime being committed. The woman watched in horror as a local gang member pulled out a handgun and used it to shoot the victim, a member of a rival gang. The gang member did not know anyone was witnessing his act of shooting the victim. The woman watched as the victim collapsed and fell dead on her neighbor's front lawn. As a result of her shock from viewing this horrible incident, the woman suffered a miscarriage. If the woman asserts a claim against the local gang member who shot the victim, the woman will\n(A) recover, because she suffered a physical injury, rather than just emotional harm.\n(B) recover, because the gang member acted intentionally in shooting the victim.\n(C) not recover, because the woman was not within the zone of danger.\n(D) not recover, because the gang member was unaware that the woman was watching.", "output": "(D)"}
{"input": "A man brought a federal diversity action against his insurance company, alleging that the company had breached its duty under his insurance policy by refusing to pay for his medical expenses resulting from a mountain-biking accident. At the jury trial, the man presented evidence that he had paid all premiums on the insurance policy and that the policy cov-ered personal-injury-related medical expenses arising from accidents. After he rested his case, the company presented evidence that a provision of the policy excluded payment for injury-related expenses resulting from an insured's Òunduly riskyÓ behavior. The company also presented a witness who testified that the accident had occurred in an area where posted signs warned bikers not to enter. The man did not cross-examine the witness. After resting its case, the company moved for judgment as a matter of law. Should the court grant the motion?\n(A) No, because a motion for judgment as a matter of law must first be made at the close of the plaintiff's case-in-chief.\n(B) No, because whether the man's behavior was unduly risky is a question of fact for the jury to resolve.\n(C) Yes, because the company's uncontradicted evidence of the man's unduly risky behavior means that no reason-able jury could find that the policy covers his injuries.\n(D) Yes, because the man waived his right to rebut the company's evidence by not addressing the Òunduly riskyÓ policy provision in his case-in-chief.", "output": "(B)"}
{"input": "A husband and wife were unhappily married. The husband was an alcoholic who physically abused the wife when he became drunk. After the husband beat up the wife one night, she decided to kill him. The wife, who was experienced in firearms, planned to shoot her husband while he slept. Before carrying out her plan, the wife took out a $1,000,000 life insurance policy on her husband, naming herself as beneficiary. Shortly thereafter, the husband and wife celebrated their 10th wedding anniversary. They went out to dinner and had a truly enjoyable evening together. After a great night, the wife experienced a change of heart and decided she really loved her husband and didn't want to kill him after all. The wife confessed and told her husband about her plan, begging forgiveness. The husband was outraged. He proceeded to file for divorce and notified the police about his wife's plan. If the wife is charged with attempted murder, she should be found\n(A) guilty, because she purchased the life insurance policy.\n(B) guilty, because she intended to kill her husband.\n(C) not guilty, because she did not perform a substantial step in carrying out the murder.\n(D) not guilty, because she effectively withdrew from the criminal endeavor.", "output": "(C)"}
{"input": "A manufacturer of electric motors formerly produced motors that utilized as a coolant a chemical substancethat was later discovered to be highly toxic. During its manufacturing operations, the manufacturer negligentlyallowed quantities of this substance to leak into the soil. The Environmental Protection Agency (EPA) orderedthat the premises, now owned by an appliance repair shop, be decontaminated. This order, and the subsequent cleanup efforts, received a high level of attention in the local media. An employee of the appliance repair shop has sued the manufacturer in negligence for damages for emotionaldistress. The employee claims to have suffered the distress as a consequence of learning that she has beenexposed for five years, while employed by the appliance repair shop at the premises affected by the EPA order,to the toxic contamination that has existed there. Her complaint does not allege that her emotional distress issevere, that the manufacturer's conduct was extreme and outrageous, or that she has suffered any physicalconsequences. In that action the manufacturer has filed a motion to dismiss for failure to state a claim upon which relief maybe granted. What is the manufacturer's best argument in support of that motion?\n(A) The repair shop employee's emotional distress is not alleged to be severe.\n(B) The complaint does not allege that the manufacturer's conduct was extreme and outrageous.\n(C) The complaint does not allege that the repair shop employee suffered any physical consequences.\n(D) The repair shop employee's proper remedy is in a claim against the repair shop, the occupier of thepremises during the period of her alleged exposure.", "output": "(C)"}
{"input": "An elderly woman was riding in an elevator from her apartment on the 12th floor to the lobby. When the elevator stopped on the fifth floor, a man entered the elevator smoking a cigar. The man was standing in front of the elderly woman on the elevator when the woman tapped him on the shoulder. When the man turned around, the woman pointed to the \"No Smoking\" sign and said, \"Excuse me, sir, would you mind putting that cigar out?\" The man indignantly responded by inhaling heavily on his cigar, and then he blew a big puff of smoke into the woman's face. When the elevator stopped on the next floor, the man then departed. If the woman brings a civil suit against the man for battery, who will prevail?\n(A) The woman, because the smoke touched her face.\n(B) The woman, because she had a reasonable basis for fearing that the man would attack her.\n(C) The man, because he did not touch the woman.\n(D) The man, because his conduct was annoying but did not inflict any bodily injury on the woman.", "output": "(A)"}
