{"input": "Suppose that the following regression is estimated using 27 quarterly observations:\n\n$y_t = \\beta_1 + \\beta_2 x_2 + \\beta_3 x_{3t} + u_t$\n\nWhat is the appropriate critical value for a 2-sided 5% size of test of $H_0: \\beta_3 = 1$?\n(A) 1.64\n(B) 1.71\n(C) 2.06\n(D) 1.96", "output": "(C)"}
{"input": "If the Engle-Granger test is applied to the residuals of a potentially cointegrating regression, what would be the interpretation of the null hypothesis?\n(A) The variables are cointegrated\n(B) The variables are not cointegrated\n(C) Both variables are stationary\n(D) Both variables are non-stationary", "output": "(B)"}
{"input": "Which of the following could result in autocorrelated residuals?\n\ni) Slowness of response of the dependent variable to changes in the values of the independent variables\n\nii) Over-reactions of the dependent variable to changes in the independent variables\n\niii) Omission of relevant explanatory variables that are autocorrelated\n\niv) Outliers in the data\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(C)"}
{"input": "Which of the following statements are true concerning maximum likelihood (ML) estimation in the context of GARCH models?\n\ni) Maximum likelihood estimation selects the parameter values that maximise the\n\nprobability that we would have actually observed the values of the series y that we\n\nactually did.\n\n\nii) GARCH models can only be estimated by ML and not by OLS\n\n\niii) For estimation of a standard linear model (with no GARCH), the OLS and ML\n\nestimates for the slope and intercept parameters will be identical but the estimator\n\nfor the variance of the disturbances is slightly different\n\n\niv) Most computer packages use numerical procedures to estimate GARCH models\n\nrather than a set of analytical formulae\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(D)"}
{"input": "A parsimonious model is one that\n(A) Includes too many variables\n(B) Includes as few variables as possible to explain the data\n(C) Is a well-specified model\n(D) Is a mis-specified model", "output": "(A)"}
{"input": "Which of the following are plausible approaches to dealing with a model that exhibits heteroscedasticity?\n\ni) Take logarithms of each of the variables\n\nii) Use suitably modified standard errors\n\niii) Use a generalised least squares procedure\n\niv) Add lagged values of the variables to the regression equation.\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(C)"}
{"input": "Which of the following statements are true concerning the Box-Jenkins approach to diagnostic testing for ARMA models?\n\n(i) The tests will show whether the identified model is either too large or too small\n\n(ii) The tests involve checking the model residuals for autocorrelation, heteroscedasticity, and non-normality\n\n(iii) If the model suggested at the identification stage is appropriate, the acf and pacf for the residuals should show no additional structure\n\n(iv) If the model suggested at the identification stage is appropriate, the coefficients on the additional variables under the overfitting approach will be statistically insignificant\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(A)"}
{"input": "Under which of the following situations would bootstrapping be preferred to pure simulation?\n\ni) If it is desired that the distributional properties of the data in the experiment\n\nare the same as those of some actual data\n\n\nii) If it is desired that the distributional properties of the data in the experiment\n\nare known exactly\n\n\niii) If the distributional properties of the actual data are unknown\n\n\niv) If the sample of actual data available is very small\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iv) only\n(D) (i), (ii), (iii), and (iv)", "output": "(B)"}
{"input": "If there were a leverage effect in practice, what would be the shape of the news impact curve for as model that accounted for that leverage?\n(A) It would rise more quickly for negative disturbances than for positive ones of the same magnitude\n(B) It would be symmetrical about zero\n(C) It would rise less quickly for negative disturbances than for positive ones of the same magnitude\n(D) It would be zero for all positive disturbances", "output": "(A)"}
{"input": "Under the null hypothesis of a Bera-Jarque test, the distribution has\n(A) Zero skewness and zero kurtosis\n(B) Zero skewness and a kurtosis of three\n(C) Skewness of one and zero kurtosis\n(D) Skewness of one and kurtosis of three.", "output": "(B)"}
{"input": "Consider an identical situation to that of question 21, except that now a 2-sided alternative is used. What would now be the appropriate conclusion?\n(A) H0 is rejected\n(B) H0 is not rejected\n(C) H1 is rejected\n(D) There is insufficient information given in the question to reach a conclusion", "output": "(A)"}
{"input": "Which of the following statements are true concerning the acf and pacf?\n\n(i) The acf and pacf are often hard to interpret in practice\n\n(ii) The acf and pacf can be difficult to calculate for some data sets\n\n(iii) Information criteria represent an alternative approach to model order determination\n\n(iv) If applied correctly, the acf and pacf will always deliver unique model selections\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(C)"}
{"input": "What is the meaning of the term \"heteroscedasticity\"?\n(A) The variance of the errors is not constant\n(B) The variance of the dependent variable is not constant\n(C) The errors are not linearly independent of one another\n(D) The errors have non-zero mean", "output": "(A)"}
{"input": "Which of the following is NOT a feature of continuously compounded returns (i.e. log-returns)?\n(A) They can be interpreted as continuously compounded changes in the prices\n(B) They can be added over time to give returns for longer time periods\n(C) They can be added across a portfolio of assets to give portfolio returns\n(D) They are usually fat-tailed", "output": "(C)"}
{"input": "Consider again the VAR model of equation 16. Which of the following conditions must hold for it to be said that there is bi-directional feedback?\n(A) The b and d coefficients significant and the a and c coefficients insignificant\n(B) The a and c coefficients significant and the b and d coefficients insignificant\n(C) The a and c coefficients significant\n(D) The b and d coefficients significant", "output": "(D)"}
{"input": "What is the most important disadvantage of the diagonal VECH approach to building multivariate GARCH models that is overcome by the BEKK formulation?\n(A) The diagonal VECH model is hard to interpret intuitively\n(B) The diagonal VECH model contains too many parameters\n(C) The diagonal VECH model does not ensure a positive-definite variance-covariance matrix\n(D) The BEKK model reduces the dimensionality problem that arises when a number of series are modelled together.", "output": "(C)"}
{"input": "Which of the following statements are true concerning a triangular or recursive system?\n\ni) The parameters can be validly estimated using separate applications of OLS to\n\neach equation\n\n\nii) The independent variables may be correlated with the error terms in other\n\nequations\n\n\niii) An application of 2SLS would lead to unbiased but inefficient parameter estimates\n\n\niv) The independent variables may be correlated with the error terms in the equations\n\nin which they appear as independent variables\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(C)"}
{"input": "Which of the following may be consequences of one or more of the CLRM assumptions being violated?\n\ni) The coefficient estimates are not optimal\n\n\nii) The standard error estimates are not optimal\n\n\niii) The distributions assumed for the test statistics are inappropriate\n\n\niv) Conclusions regarding the strength of relationships between the dependent\n\nand independent variables may be invalid.\n(A) (ii) and (iv) only\n(B) (i) and (iii) only\n(C) (i), (ii), and (iii) only\n(D) (i), (ii), (iii), and (iv)", "output": "(D)"}
{"input": "The pacf is necessary for distinguishing between\n(A) An AR and an MA model\n(B) An AR and an ARMA model\n(C) An MA and an ARMA model\n(D) Different models from within the ARMA family", "output": "(B)"}
{"input": "Which one of the following is examined by looking at a goodness of fit statistic?\n(A) How well the population regression function fits the data\n(B) How well the sample regression function fits the population regression function\n(C) How well the sample regression function fits the data\n(D) How well the population regression function fits the sample regression function.", "output": "(C)"}
