{"input": "Statement 1| U2F is a stronger second factor than sending an SMS code to a user’s smartphone. Statement 2| An attacker that knows a user’s password can easily guess the U2F key to access the user’s account.\n(A) True, True\n(B) False, False\n(C) True, False\n(D) False, True", "output": "(C)"}
{"input": "Suppose a user has an iPhone (running iOS) and downloads an app called Innocent from the Apple App Store and installs it. The user unlocks the phone and runs Innocent. Innocent exploits a bug in the iOS kernel which allows Innocent to redirect execution inside the kernel to code that Innocent controls. Now Innocent can execute any instructions it likes inside the iOS kernel. Innocent is not able to exploit any bugs in the phone’s secure enclave. Can Innocent read the user’s private information stored in the phone’s flash (e.g. Contacts and messages), or will the security measures described in the paper keep the data private? If Innocent is only able to see encrypted data, then the phone has successfully kept the data private. Circle the security features of the phone (if any) that will prevent Innocent from reading information from the flash on the phone.\n(A) Secure boot chain\n(B) System software authorization \n(C) The secure enclave’s ephemeral key\n(D) None of the above", "output": "(D)"}
{"input": "___________ is a process of wireless traffic analysis that may be helpful for forensic investigations or during troubleshooting any wireless issue.\n(A) Wireless Traffic Sniffing\n(B) WiFi Traffic Sniffing\n(C) Wireless Traffic Checking\n(D) Wireless Transmission Sniffing", "output": "(A)"}
{"input": "Suppose we define h(H, m) = E(m, H)h(H,m)=E(m,H). Then the resulting h(\\cdot,\\cdot)h(⋅,⋅) is not collision resistant: to build a collision (H,m)(H,m) and (H’,m’)(H’,m’) choose random (H,m,m’)(H,m,m’) and construct H’H’ as follows:\n(A) H’=D(m’, E(m,H))\n(B) H’=E(m’,D(m,H))\n(C) H’=E(m’,E(m,H))\n(D) H’=D(m’,D(m,H))", "output": "(A)"}
{"input": "Why is it that anti-virus scanners would not have found an exploitation of Heartbleed?\n(A) It's a vacuous question: Heartbleed only reads outside a buffer, so there is no possible exploit \n(B) Anti-virus scanners tend to look for viruses and other malicious\n(C) Heartbleed attacks the anti-virus scanner itself\n(D) Anti-virus scanners tend to look for viruses and other malicious code, but Heartbleed exploits steal secrets without injecting any code ", "output": "(D)"}
