{"input": "Which of the following statements identifies a chemically based sensory system?\nI. Gustatory system\nII. Auditory system\nIII. Olfactory system\n(A) I only\n(B) II only\n(C) III only\n(D) I and III only", "output": "(D)"}
{"input": "An action potential arriving at the motor endplate causes release of:\n(A) acetylcholine which traverses the neuromuscular junction.\n(B) sodium ions which binds to sodium receptors on the muscle membrane.\n(C) calcium ions which initiate an action potential along the muscle fibre.\n(D) noradrenaline which increases muscle metabolic activity.", "output": "(A)"}
{"input": "Triacylglycerides consist of I. A ribose backbone II. a glycerol backbone III. three phosphodiester linkages IV. three ester linkages\n(A) I and III\n(B) II only\n(C) II and III\n(D) II and IV", "output": "(D)"}
{"input": "Diisopropylfluorophosphate (DFP) binds to the active site of acetylcholinesterase (ACE) in the synapses of neurons. When DFP binds to ACE, the ACE enzyme is rendered permanently inactive. This makes DFP a potent toxin, with lethal amounts at less than 100 mg. The interaction between DFP and ACE can best be characterized as:\n(A) Competitive inhibition\n(B) Noncompetitive inhibition\n(C) Irreversible inhibition\n(D) Partially competitive inhibition", "output": "(C)"}
{"input": "A scientist using mouse models to determine the response of blood hormones to large levels of glucose in the body discovers a new hormone not previously described. According to his data, this hormone is found both inside and out of cells when carrying out its function, increase the amount of nucleic acid in the cell while functioning, and are derived from a structure containing four hydroxycarbon rings. This will likely be categorized as which type of hormone?\n(A) Enzymatic\n(B) Steroid\n(C) Peptide\n(D) Amino acid", "output": "(B)"}
{"input": "Metabolism is determined by the:\n(A) size of proteins in the cell.\n(B) availability of amino acids.\n(C) proteins formed as dictated by the genetic material.\n(D) amino acid composition of the ribonucleic acids.", "output": "(C)"}
{"input": "Women's world record performances have improved rapidly in recent years mainly because:\n(A) women have evolved a greater muscle mass.\n(B) women can now run faster than men.\n(C) women have started training at an earlier age.\n(D) more women are now engaged in sport.", "output": "(D)"}
{"input": "Neonatal Respiratory Distress Syndrome (NRDS) is a serious complication seen in infants born prematurely who have a compromised ability to facilitate oxygen diffusion across their alveolar membranes. This is caused by inadequate surfactant production. What role does surfactant play in facilitating oxygen diffusion?\n(A) Increases surface permeability\n(B) Maintains alveoli in an open state\n(C) Depresses cilia of the lung\n(D) Dilates blood vessels", "output": "(B)"}
{"input": "New York City is home to over 7 million inhabitants from a diverse range of backgrounds. Although the city itself has characteristics, there are several smaller areas, usually congregations of people from the same nationality, who adhere to customs from their prior country of inhabitance. For example, in Little Italy, a small town in the city, it is still customary to greet people with cheek kisses. This is an example of what kind of phenomenon?\n(A) Subculture\n(B) Counterculture\n(C) Microculture\n(D) Culture lag", "output": "(A)"}
{"input": "A common heart defect in humans is a ventricular septal defect, in which there is a hole in the septum between the right and left ventricles. If a patient were to have this defect, which of the following statements is correct?\n(A) The percentage of oxygen in the left atrium would be lower.\n(B) The percentage of CO2 in the right ventricle would be higher.\n(C) The percentage of oxygen in the right atrium would be lower.\n(D) The percentage of oxygen in the right ventricle would be higher.", "output": "(D)"}
{"input": "Which of the following statements is false?\n(A) Ammonia is produced in repeated high intensity exercise.\n(B) Muscle lactate accumulation does not begin until at least 5 seconds of intermittent muscle contractions have taken place.\n(C) Muscle phosphocreatine depletion begins in the first few seconds of high intensity exercise.\n(D) With an increasing number of repeated sprints the rate of accumulation of lactate in muscle declines.", "output": "(B)"}
{"input": "Vygotsky’s sociocultural development theory attempts to describe the interaction between the mental function children are born with and how they develop those into what they possess as adults. One of the important components of this is the zone of proximal development. Which of the following statements accurately describes an individual in the zone of proximal development?\n(A) A baseball player hits baseballs from a tee in order to build muscle memory.\n(B) A concert flute player falls short of finishing a piece that has a very complex ending without mistakes\n(C) A high school English student submits a paper for review by his professor.\n(D) A high diver takes instruction from her coach to improve her form on a specific move.", "output": "(D)"}
{"input": "Karen is a college student working on developing a stronger sense of self-esteem and self-efficacy with her therapist. She has noticed a great change in her ability to handle situations after 3 months of therapy. Which of the following would NOT be a strategy that her therapist would ask her to employ to raise her sense of self-efficacy?\n(A) Seek positive feedback from friends.\n(B) Put in daily practice on the tasks she wishes to improve on.\n(C) Find others her age and ability who excel at tasks she is interested in.\n(D) Avoid potential pitfalls by withholding from tasks she is not proficient in.", "output": "(D)"}
{"input": "The body compensates for increased environmental temperature by:\n(A) decreasing salt retention\n(B) increasing respiration rate\n(C) increasing heart rate\n(D) increasing water lost through skin", "output": "(D)"}
{"input": "The process of translation requires the presence of:\n(A) mRNA, tRNA and ribosomes.\n(B) mRNA, ribosomes and RNA polymerase.\n(C) DNA, mRNA and RNA polymerase.\n(D) chromatin, DNA and amino acids.", "output": "(A)"}
{"input": "Which of the following processes is not used to modify protein structure after translation has occurred?\n(A) Lipidation.\n(B) Attachment of more amino acids via peptide bonds.\n(C) Glycosylation.\n(D) Phosphorylation.", "output": "(B)"}
{"input": "Sauna use, sometimes referred to as \"sauna bathing,\" is characterized by short-term passive exposure to extreme heat. This exposure elicits mild hyperthermia – an increase in the body's core temperature – that induces a thermoregulatory response involving neuroendocrine, cardiovascular, and cytoprotective mechanisms that work together to restore homeostasis and condition the body for future heat stressors… In recent decades, sauna bathing has emerged as a means to increase lifespan and improve overall health, based on compelling data from observational, interventional, and mechanistic studies. Of particular interest are the findings from studies of participants in the Kuopio Ischemic Heart Disease Risk Factor (KIHD) Study, an ongoing prospective population-based cohort study of health outcomes in more than 2,300 middle-aged men from eastern Finland, which identified strong links between sauna use and reduced death and disease… The KIHD findings showed that men who used the sauna two to three times per week were 27 percent less likely to die from cardiovascular-related causes than men who didn't use the sauna.[2] Furthermore, the benefits they experienced were found to be dose-dependent: Men who used the sauna roughly twice as often, about four to seven times per week, experienced roughly twice the benefits – and were 50 percent less likely to die from cardiovascular-related causes.[2] In addition, frequent sauna users were found to be 40 percent less likely to die from all causes of premature death. These findings held true even when considering age, activity levels, and lifestyle factors that might have influenced the men's health.[2]... The KIHD also revealed that frequent sauna use reduced the risk of developing dementia and Alzheimer's disease in a dose-dependent manner. Men who used the sauna two to three times per week had a 66 percent lower risk of developing dementia and a 65 percent lower risk of developing Alzheimer's disease, compared to men who used the sauna only one time per week… The health benefits associated with sauna use extended to other aspects of mental health, as well. Men participating in the KIHD study who used the sauna four to seven times per week were 77 percent less likely to develop psychotic disorders, regardless of the men's dietary habits, socioeconomic status, physical activity, and inflammatory status (as measured by C-reactive protein)…Exposure to high temperature stresses the body, eliciting a rapid, robust response. The skin and core body temperatures increase markedly, and sweating ensues. The skin heats first, rising to 40°C (104°F), and then changes in core body temperature occur, rising slowly from 37°C (98.6°F, or normal) to 38°C (100.4°F) and then rapidly increasing to 39°C (102.2°F)…  Cardiac output, a measure of the amount of work the heart performs in response to the body's need for oxygen, increases by 60 to 70 percent, while the heart rate (the number of beats per minute) increases and the stroke volume (the amount of blood pumped) remains unchanged.[5] During this time, approximately 50 to 70 percent of the body's blood flow is redistributed from the core to the skin to facilitate sweating. The average person loses approximately 0.5 kg of sweat while sauna bathing.[11] Acute heat exposure also induces a transient increase in overall plasma volume to mitigate the decrease in core blood volume. This increase in plasma volume not only provides a reserve source of fluid for sweating, but it also acts like the water in a car's radiator, cooling the body to prevent rapid increases in core body temperature and promoting heat tolerance… Repeated sauna use acclimates the body to heat and optimizes the body's response to future exposures, likely due to a biological phenomenon known as hormesis, a compensatory defense response following exposure to a mild stressor that is disproportionate to the magnitude of the stressor. Hormesis triggers a vast array of protective mechanisms that not only repair cell damage but also provide protection from subsequent exposures to more devastating stressors… The physiological responses to sauna use are remarkably similar to those experienced during moderate- to vigorous-intensity exercise. In fact, sauna use has been proposed as an alternative to exercise for people who are unable to engage in physical activity due to chronic disease or physical limitations.[13]\n\nWhich of the following is a likely paragraph that follows this excerpt in the article?\n(A) A paragraph on a protein that facilitates intracellular function in response to heat.\n(B) A paragraph on increased heart attacks in Eskimo populations.\n(C) A recap of Finland’s water polo team excellence.\n(D) A study on rats exposed to high levels of heat.", "output": "(A)"}
{"input": "Hydrogen ions are formed when:\n(A) glycogen becomes depleted.\n(B) phosphocreatine breakdown occurs.\n(C) pyruvate is converted to lactate.\n(D) glycolysis is being used as a major means of resynthesising ATP.", "output": "(D)"}
{"input": "Which of the following is true?\n(A) Increasing the protein intake above 3 grams per kg body mass per day will stimulate muscle growth and increase strength.\n(B) Creatine supplements can increase muscle strength and power.\n(C) Amino acid supplements can increase muscle strength and power.\n(D) Muscle damage is induced by shortening contractions.", "output": "(B)"}
{"input": "Selective Androgen Receptor Modulators (SARMs) are:\n(A) steroid drugs that act on androgen receptors mimicking the effects of natural steroid hormones.\n(B) steroid drugs that act on androgen receptors antagonising the effects of natural steroid hormones.\n(C) non-steroid drugs that act on androgen receptors mimicking the effects of natural steroid hormones.\n(D) non-steroid drugs that act on androgen receptors inhibiting the effects of natural steroid hormones.", "output": "(C)"}
