{"input": "A company has just issued convertible bonds with $1,000 par value and a conversion ratio of 40. Which of the following is most likely to be the market price per share of the company's common stock at present?\n(A) Under $25.\n(B) $25.00\n(C) Between $25 and $30.\n(D) Above $30.", "output": "(A)"}
{"input": "An issuer's board of directors would ordinarily participate in each of the following activities except\n(A) Establishing long-term strategy and objectives to which their information technology system should be aligned.\n(B) Supervising and monitoring the quality control testing upon the installation of a new information technology system.\n(C) Ensuring that suitable information technology resources and skills are available to meet the company's strategic objectives.\n(D) Maintaining awareness of current technology used by the organization to assure its efficiency and effectiveness for financial reporting.", "output": "(B)"}
{"input": "An auditor is considering whether the omission of the confirmation of investments impairs the auditor’s ability to support a previously expressed unmodified opinion. The auditor need not perform this omitted procedure if\n(A) The results of alternative procedures that were performed compensate for the omission.\n(B) The auditor’s assessed level of detection risk is low.\n(C) The omission is documented in a communication with the audit committee.\n(D) No individual investment is material to the financial statements taken as a whole.", "output": "(A)"}
{"input": "Under Treasury Circular 230, in which of the following situations is a CPA prohibited from giving written advice concerning one or more federal tax issues?\n(A) The CPA takes into account the possibility that a tax return will not be audited.\n(B) The CPA reasonably relies upon representations of the client.\n(C) The CPA considers all relevant facts that are known\n(D) The CPA takes into consideration assumptions about future events related to the relevant facts", "output": "(A)"}
{"input": "A company has a 22% investment in another company that it accounts for using the equity method. Which of the following disclosures should be included in the company’s annual financial statements?\n(A) The names and ownership percentages of the other stockholders in the investee company.\n(B) The reason for the company’s decision to invest in the investee company.\n(C) The company’s accounting policy for the investment.\n(D) Whether the investee company is involved in any litigation.", "output": "(C)"}
