{"input": "Which of the following is the proper treatment of the cost of equipment used in research and development activities that will have alternative future uses?\n(A) Expensed in the year in which the research and development project started.\n(B) Capitalized and depreciated over the term of the research and development project.\n(C) Capitalized and depreciated over its estimated useful life.\n(D) Either capitalized or expensed, but not both, depending on the term of the research and development project.", "output": "(C)"}
{"input": "Goll Co. has a 25% interest in the common stock of Rose Co. and an 18% interest in the common stock of Jave Co. Neither investment gives Goll the ability to exercise significant influence over either company's operating and financial policies. Which of the two investments should Goll account for using the equity method?\n(A) Both Rose and Jave.\n(B) Rose only.\n(C) Jave only.\n(D) Neither Rose nor Jave.", "output": "(D)"}
{"input": "The following information pertains to Dash Co.'s utility bills: Period covered Amount Date paid April 16 ‚Äì May 15 $5000 June 1 May 16 ‚Äì June 15 $6000 July 1 June 16 ‚Äì July 15 $8000 August 1 What is the amount that Dash should report as a liability in its June 30 balance sheet?\n(A) $6,000\n(B) $7,000\n(C) $10,000\n(D) 14000", "output": "(C)"}
{"input": "Which of the following factors most likely would be considered an inherent limitation to an entity's internal control?\n(A) The ineffectiveness of the entity's audit committee.\n(B) Collusion of employees in circumventing internal controls.\n(C) The lack of resources to monitor internal controls.\n(D) The complexity of the entity's electronic order processing system.", "output": "(B)"}
{"input": "Holt Co. discovered that in the prior year it failed to report $40000 of depreciation related to a newly constructed building. The depreciation was computed correctly for tax purposes. The tax rate for the current year was 20%. How should Holt report the correction of error in the current year?\n(A) As an increase in accumulated depreciation of $32000.\n(B) As an increase in accumulated depreciation of $40000.\n(C) As an increase in depreciation expense of $32000.\n(D) As an increase of depreciation expense of $40000.", "output": "(B)"}
{"input": "In which of the following situations would there be inelastic demand?\n(A) A 5% price increase results in a 3% decrease in the quantity demanded.\n(B) A 4% price increase results in a 6% decrease in the quantity demanded.\n(C) A 4% price increase results in a 4% decrease in the quantity demanded.\n(D) A 3% price decrease results in a 5% increase in the quantity demanded.", "output": "(A)"}
{"input": "According to COSO, an effective approach to monitoring internal control involves each of the following steps, except\n(A) Establishing a foundation for monitoring.\n(B) Increasing the reliability of financial reporting and compliance with applicable laws and regulations.\n(C) Designing and executing monitoring procedures that are prioritized based on risks to achieve organizational objectives.\n(D) Assessing and reporting the results, including following up on corrective action where necessary.", "output": "(B)"}
{"input": "Decker a 62-year-old single individual sold his principal residence for the net amount of $500000 after all selling expenses. Decker bought the house 15 years ago and occupied it until it was sold. On the date of sale the house had a cost basis of $200000. Within six months Decker purchased a new house for $600000. What amount of gain should Decker recognize from the sale of the residence?\n(A) $0\n(B) $50,000\n(C) $175,000\n(D) 300000", "output": "(B)"}
{"input": "If a five-year bond has a yield of 6% and a ten-year bond has a yield of 5%, what is the yield curve likely to be?\n(A) upward sloping\n(B) 3% at −5\n(C) 4% at −10\n(D) downward sloping", "output": "(D)"}
{"input": "On July 1 year 7 Dean Co. issued at a premium bonds with a due date of July 1 year 12. Dean incorrectly used the straight-line method instead of the effective interest method to amortize the premium. How were the following amounts affected by the error at June 30 year 12? Bond carrying Retained amount earnings\n(A) Overstated Understated\n(B) Understated Overstated\n(C) Overstated No effect\n(D) No effect No effect", "output": "(D)"}
{"input": "Swift Co. has identified three operating segments that may require separate disclosure in Swift's general purpose financial statements for the year ended December 31 year 2. Information for year 2 follows: Segment (in thousands) A B C Total Reported revenue $ 42 $ 121 $ 14 $ 177 Reported profit(loss) $ 12 $ 65 $ (3) $ 74 Assets $ 470 $ 800 $ 80 $ 1350 Which of Swift's segments are required to be separately disclosed in its December 31 year 2 financial statements?\n(A) A and B only.\n(B) A and C only.\n(C) B and C only.\n(D) A B and C.", "output": "(A)"}
{"input": "What term is used to represent unavoidable past costs that cannot be changed no matter what action is taken?\n(A) Prime costs\n(B) Sunk costs\n(C) Opportunity costs\n(D) Incremental costs", "output": "(B)"}
{"input": "In assessing the tolerable rate of deviations of a test of controls that was performed using statistical sampling an auditor should consider that\n(A) Deviations from pertinent controls do not affect the risk of material misstatement in the accounting records.\n(B) Deviations from pertinent controls at a given rate ordinarily result in misstatements at a lower rate.\n(C) When the degree of assurance desired in a sample is high the auditor should allow for a high level of sampling risk.\n(D) Increasing the number of items selected for the test of controls usually increases the tolerable rate of deviations.", "output": "(B)"}
{"input": "Which of the following situations would not impair objectivity, integrity, or independence with respect to an audit client?\n(A) An auditor takes the client’s audit committee to Las Vegas for the weekend.\n(B) An out-of-town client takes the audit engagement team out to dinner at a renowned local restaurant.\n(C) An auditor provides client management with box seats for the season at a major league baseball franchise.\n(D) A client takes the audit engagement team on a two-day ski trip after the audit team worked for two consecutive weekends.", "output": "(B)"}
{"input": "A company should recognize goodwill in its balance sheet at which of the following points?\n(A) Costs have been incurred in the development of goodwill.\n(B) Goodwill has been created in the purchase of a business.\n(C) The company expects a future benefit from the creation of goodwill.\n(D) The fair market value of the company’s assets exceeds the book value of the company’s assets.", "output": "(B)"}
{"input": "In searching for unrecorded liabilities an auditor most likely would examine the\n(A) Cutoff bank statement for deposits recorded in the books but not by the bank.\n(B) Details of accounts receivable confirmations that are classified as \"exceptions\".\n(C) Files of purchase requisitions for items ordered just before the year end.\n(D) Receiving reports for items received before year end but not yet recorded.", "output": "(D)"}
{"input": "For an individual business owner, which of the following would typically be classified as a capital asset for federal income tax purposes?\n(A) Accounts receivable\n(B) Marketable securities\n(C) Machinery and equipment used in a business\n(D) Inventory", "output": "(B)"}
{"input": "A company’s first IFRS reporting period is for the year ended December 31, year 2. While preparing the year 2 statement of financial position, management identified an error in which a $90,000 loss accrual was not recorded. $40,000 of the loss accrual related to a year 1 event and $50,000 related to a year 2 event. What amount of loss accrual should the company report in its December 31, year 1, IFRS statement of financial position?\n(A) $0\n(B) $40,000\n(C) $50,000\n(D) $90,000", "output": "(B)"}
{"input": "Which of the following circumstances generally will cause a discharge of contractual duties by operation of law?\n(A) Novation.\n(B) Accord and satisfaction.\n(C) Anticipatory repudiation.\n(D) Impossibility of performance.", "output": "(D)"}
{"input": "Long was a purchasing agent for Frost, a sole proprietor. Long had express authority to place purchase orders with Frost's suppliers. Long conducted business on the Internet and had little contact with Frost. After Frost was declared incompetent in a judicial proceeding, Long placed an order with Grant Corp. on Frost's behalf. Both Long and Grant were unaware of Frost's incompetence. Will Frost or Frost's legal representative be liable to Grant?\n(A) Yes, because Long's agency survived Frost's incompetence.\n(B) Yes, because the order was valid regardless of Frost's incompetence.\n(C) No, because Grant dealt only with Long.\n(D) No, because Long did not have authority to enter into the contract.", "output": "(D)"}
