{"input": "Interest groups representing businesspeople and investors are often among the most successful lobbying groups in Washington, D.C., for all of the following reasons EXCEPT\n(A) Such groups have the financial resources to mount sustained campaigns on their own behalf.\n(B) Many such groups have been in existence for several decades or more, allowing them to master the legislative system and to develop close ties with legislators.\n(C) In many districts, these groups' constituents make up the majority of voters.\n(D) These groups' constituents contribute heavily to many legislators' campaigns, and in doing so, gain greater access to legislators.", "output": "(C)"}
{"input": "The practice of drawing congressional district lines in an attempt to give one party a benefit over another is referred to as\n(A) front-loading\n(B) prior restraint\n(C) reapportionment\n(D) gerrymandering", "output": "(D)"}
{"input": "Federal election laws are designed to achieve all of the following EXCEPT\n(A) require disclosure of campaign donations\n(B) prevent campaigns from issuing \"attack\" ads\n(C) limit campaign contributions\n(D) require disclosure of campaign expenditures", "output": "(B)"}
{"input": "Which of the following accounts for the fact that the power and prestige of the presidency have grown since 1932? I. America's increased prominence in international affairs II. continually improved public confidence in the federal government III. the New Deal and other programs that have expanded federal responsibility IV. the president's increased visibility, due to the development of mass media\n(A) I only\n(B) I and IV only\n(C) I, III, and IV only\n(D) II and IV only", "output": "(C)"}
{"input": "How many votes in the Senate must a presidential nominee to the Supreme Court receive in order to be confirmed?\n(A) Forty percent\n(B) Fifty-one percent\n(C) Fifty-five percent\n(D) Sixty percent", "output": "(B)"}
{"input": "Voters in which of the following categories would be LEAST likely to vote?\n(A) Blue-collar workers who belong to a union\n(B) Professionals\n(C) Voters who are active in their political parties\n(D) Voters aged 18-29", "output": "(D)"}
{"input": "Which of the following best describes a block grant?\n(A) Money provided to individuals to fund research projects\n(B) Funds with few restrictions that are provided to state or local governments for general purpose use\n(C) Funds distributed among states according to a set formula\n(D) Money that can only be used for a specific purpose", "output": "(B)"}
{"input": "Politicians and political reporters are natural adversaries; the adversarial nature of their relationship, however, is tempered by the fact that\n(A) younger politicians who are more comfortable with the media are gradually displacing older politicians\n(B) government regulations on interaction between the two groups are very strict\n(C) each group is dependent on the other to perform its job effectively\n(D) very few media outlets will cover a story that is embarrassing to a political leader", "output": "(C)"}
{"input": "Which of the following categories of spending are paid without an appropriations bill?\n(A) Department of Education special acts and authorizations\n(B) Justice department budgets\n(C) Federal budget entitlements\n(D) Department of Defense funding", "output": "(C)"}
{"input": "A \"motion for cloture\" is used to\n(A) send a bill back to the House\n(B) override a presidential veto in the House\n(C) amend an appropriations bill in the House\n(D) end a filibuster and force a vote on a bill in the Senate", "output": "(D)"}
{"input": "Which of the following plays the most significant role in forming a child's political views?\n(A) The geographical area in which the child grows up\n(B) The child's family\n(C) The media to which the child is exposed\n(D) The child's religion", "output": "(B)"}
{"input": "Which principle was established by the Supreme Court's decision in Marbury v. Madison?\n(A) One man, one vote\n(B) Separate but equal\n(C) Judicial review\n(D) Right to privacy", "output": "(C)"}
{"input": "When an appeal is made to the Supreme Court, the court usually\n(A) refuses to hear the appeal\n(B) declares a mistrial\n(C) orders the lower court to retry the case\n(D) rules in favor of the defendant", "output": "(A)"}
{"input": "In which of the following cases did the Supreme Court decision establish the \"separate but equal\" doctrine of state-sponsored racial segregation?\n(A) Plessy v. Ferguson\n(B) McCulloch v. Maryland\n(C) Gibbons v. Ogden\n(D) Brown v. Board of Education", "output": "(A)"}
{"input": "Among the executive branch's checks on the legislative branch is the president's power to\n(A) call special sessions of Congress\n(B) introduce bills to the floor of Congress\n(C) address Congress during its debate on bills\n(D) vote on acts of Congress", "output": "(A)"}
{"input": "The Framers of the Constitution sought to insulate the Senate from public opinion by\n(A) restricting Senate membership to those who previously served in the House of Representatives\n(B) delegating the responsibility for electing senators to the state legislatures\n(C) requiring all spending bills to originate in the House of Representatives\n(D) empowering the Senate to provide advice and consent to the executive branch", "output": "(B)"}
{"input": "Which of the following is true of the Supreme Court?\n(A) Every case appealed to the Supreme Court is ruled upon by the court.\n(B) The court helps set the public agenda by deciding which appeals to hear.\n(C) The court hears all cases when two or more justices agree that the case has merit.\n(D) In deciding cases, the chief justice's vote counts as two votes.", "output": "(B)"}
{"input": "The principles of freedom-\"we hold these truths to be self-evident, that all men are created equal\"- stated in the Declaration of Independence were influenced by the beliefs of political philosopher\n(A) Thomas Hobbes\n(B) Niccolo Macchiavelli\n(C) Jonathan Edwards\n(D) John Locke", "output": "(D)"}
{"input": "Which of the following CANNOT limit the influence of the federal courts?\n(A) A constitutional amendment to the contrary of a court decision\n(B) The impeachment of a federal judge\n(C) A governor's failure to enforce a court decision\n(D) A national election recalling an unpopular judge", "output": "(D)"}
{"input": "Which of the following statements is LEAST true of voters in federal, state, and local elections?\n(A) Voter turnout is lower in midterm elections than it is in presidential elections.\n(B) Voters lacking party affiliation tend to vote less regularly than those with strong party affiliation.\n(C) Young adults are less likely to vote than senior citizens.\n(D) Individuals are more likely to vote when they believe they know which candidate will win an election.", "output": "(D)"}
