{"input": "Which statement is NOT true of a crisis management team?\n(A) All members should be trained in media relations.\n(B) A member of senior management should be included in the team.\n(C) A lawyer should be included in the team.\n(D) All members should be trained in group decision making.", "output": "(C)"}
{"input": "Where was the first British newspaper printed?\n(A) London\n(B) Oxford\n(C) Manchester\n(D) Edinburgh", "output": "(B)"}
{"input": "What is the primary public relations activity in financial relations?\n(A) Measuring investor opinions toward the company\n(B) Producing the annual report\n(C) Making arrangements and preparing materials for financial meetings\n(D) Writing and disseminating financial news releases", "output": "(B)"}
{"input": "To celebrate its 100th anniversary, your company wants to publish a coffee-table book of photos depicting the company's history. You dig through the files and old annual reports and find many photos, some of which have never been published. Some of the unpublished photos are dated and stamped on the back with the name of a photography studio that has been out of business for 20 years. When you consult with your publisher about the most effective way to reproduce these particular prints, the publisher says they cannot reprint them without the original photographer's permission. You are unable to find the original contract between the company and the photographer. Can you reprint the photos without the original photographer's permission?\n(A) Yes, if you pay the publisher a fee to reproduce the photos.\n(B) Yes, the company paid for the photography and therefore owns the prints.\n(C) Yes, you can reproduce the photos if you give proper credit to the photographer.\n(D) No, the photographer or heirs own the copyright and must grant permission to reproduce the unpublished photographs.", "output": "(D)"}
{"input": "Which of these is NOT a type of research that could be used for the purposes of evaluation?\n(A) Media content analysis\n(B) Survey\n(C) Behaviour study\n(D) Media release", "output": "(C)"}
