{"input": "A book launch would be what kind of common tactic?\n(A) Competition\n(B) Event\n(C) Award\n(D) Sponsorship", "output": "(B)"}
{"input": "Which of the following is NOT one of the four categories of persuasive crisis communication strategies identified by W. Timothy Coombs?\n(A) ingratiation\n(B) downplaying\n(C) distancing\n(D) nonexistence", "output": "(B)"}
{"input": "Your client has asked you to develop a public relations campaign to promote a college tuition savings program using new technologies. What is the most appropriate first step?\n(A) Research pricing and development costs for different services.\n(B) Develop a survey to discover which factors impact families' savings.\n(C) Conduct a situation analysis to gain a better understanding of the issue.\n(D) Hold a focus group to determine which messages are most effective for the program.", "output": "(C)"}
{"input": "Early theories of mass communication suggested that audiences were passive recipients of media messages and thus vulnerable to manipulation. Which of the following best describes current thinking?\n(A) Audiences are more vulnerable and passive than ever before.\n(B) Television viewing, in particular, creates increased activity in the right hemisphere of the brain.\n(C) Active receivers are not uniformly affected by mass communication messages.\n(D) Technology has led to increasingly passive recipients at the ends of message transmission systems.", "output": "(C)"}
{"input": "________ is most common to political campaigns because it focuses on raising the public's awareness about a particular person in hopes they will either support or not support the person.\n(A) Product-oriented advertising\n(B) Idea-oriented advertising\n(C) Person-oriented advertising\n(D) Platform-oriented advertising", "output": "(C)"}
{"input": "Which guerrilla marketing technique involves the spreading of a message about a product issue or service through online peer-to peer communication?\n(A) Fan pages\n(B) Street activities\n(C) Grassroots marketing\n(D) Viral campaigns", "output": "(D)"}
{"input": "You seek the counsel of one of your peers who designed and implemented a communication program that resulted in the successful permitting of an automotive recycling center, despite strong opposition from community organizations. You have to design a program to win approval for a similar project proposed by your company. Your peer gives you a brief piece of advice that succinctly describes the foundation of his successful program. What is most likely your peer's advice for a successful communication program?\n(A) Solve their problems\n(B) Kill them with kindness\n(C) Expose them to ridicule\n(D) Overwhelm them with facts", "output": "(A)"}
{"input": "Which of these phrases refers specifically to a crisis, rather than an issue?\n(A) A gap between corporate and stakeholder expectations.\n(B) When an organization's trading is interrupted.\n(C) Can be avoided with constant monitoring and relationship building.\n(D) It happens suddenly.", "output": "(D)"}
{"input": "According to Esman (1972), which publics are related to the organisation through shared industrial interests?\n(A) Enabling\n(B) Functional\n(C) Normative\n(D) Diffused", "output": "(C)"}
{"input": "Where was the first British newspaper printed?\n(A) London\n(B) Oxford\n(C) Manchester\n(D) Edinburgh", "output": "(B)"}
{"input": "There are three basic types of persuasive advertising campaigns. Which of the following is NOT one of them?\n(A) Product-oriented\n(B) Person-oriented\n(C) Idea-oriented\n(D) Result-oriented", "output": "(D)"}
{"input": "In recent research, the 14,000 stories that could be accessed on Google News' front page in a day pertained to how many actual news events?\n(A) 18\n(B) 24\n(C) 326\n(D) 9,574", "output": "(B)"}
{"input": "________ advertising campaigns are focused on gathering support for a particular message or cause.\n(A) Product-oriented\n(B) Person-oriented\n(C) Idea-oriented\n(D) Message-oriented", "output": "(C)"}
{"input": "Which statement describes an idea from utilitarianism?\n(A) What is right and what is wrong are predetermined.\n(B) People should be treated as an end, not a means to an end.\n(C) The greatest good for the greatest number.\n(D) Those better off should give to people who are not as well off.", "output": "(C)"}
{"input": "What two elements do the planning models of Hendrix (2002), Kendall (1999), Merston (1963) and Parkinson and Ekachai (2006) have in common?\n(A) Research and evaluation\n(B) Strategy and evaluation\n(C) Strategy and implementation\n(D) Objectives and implementation", "output": "(A)"}
{"input": "Which phase of public relations audience research is associated with summative evaluation?\n(A) Implementation\n(B) Impact\n(C) Attitude change\n(D) Preparation", "output": "(B)"}
{"input": "Which statement describes an idea from Kantian ethics?\n(A) What is right and what is wrong are predetermined.\n(B) People should be treated as an end, not a means to an end.\n(C) The greatest good for the greatest number.\n(D) Those better off should give to people who are not as well off.", "output": "(B)"}
{"input": "Which of these adjectives does NOT describe business writing?\n(A) Formal\n(B) Abstract\n(C) Personal\n(D) Objective", "output": "(C)"}
{"input": "In the public relations field, what is the most common threat to a client-firm relationship?\n(A) Clients' questions about costs\n(B) Resistance to outside advice\n(C) Superficial grasp of the client's unique problems\n(D) Personality conflicts", "output": "(A)"}
{"input": "When an attitude is communicated, what does it become?\n(A) An opinion\n(B) A belief\n(C) A behaviour\n(D) A point of view", "output": "(A)"}
