{"input": "What is the work involved if a gas in a 2.0-liter container at 2.4 atmospheres pressure is allowed to expand against a pressure of 0.80 atmosphere?\n(A) -3.2 L atm\n(B) -9.62 L atm\n(C) -4.8 L atm\n(D) +14.4 L atm", "output": "(A)"}
{"input": "A sample of liquid NH3 is brought to its boiling point. Which of the following occurs during the boiling process?\n(A) The N-H bonds within the NH3 molecules break apart.\n(B) The overall temperature of the solution rises as the NH3 molecules speed up.\n(C) The amount of energy within the system remains constant.\n(D) The hydrogen bonds holding separate NH3 molecules together break apart.", "output": "(D)"}
{"input": "Changing which of the following will change the numerical value of the equilibrium constant?\n(A) The pressure of reactants\n(B) The pressure of products\n(C) The temperature\n(D) The total mass of the chemicals present", "output": "(C)"}
{"input": "Under which conditions will a real gas most closely behave as an ideal gas?\n(A) High temperature and high pressure\n(B) High temperature and low pressure\n(C) High volume and high temperature\n(D) Low temperature and low pressure", "output": "(B)"}
{"input": "An experiment was performed to determine the moles of carbon dioxide gas formed (collected over water) when an acid reacts with limestone. To do this, a piece of dry limestone was weighed. Then carbon dioxide was collected until the limestone disappeared. The atmospheric pressure was measured at 0.965 atm. The temperature was 295 K. The volume of CO2 was measured to the nearest mL and corrected for the vapor pressure of water. The student continuously got low results from what was expected. Can you suggest why?\n(A) Limestone is never pure CaCO3.\n(B) Limestone is Ca(HCO3)2.\n(C) Carbon dioxide is rather soluble in water.\n(D) Perhaps there was not enough acid to dissolve all the limestone.", "output": "(C)"}
{"input": "Which of the following is a balanced chemical reaction?\n(A) Na2SO4 + Ba(NO3)2 → BaSO4 + NaSO4\n(B) AgNO3 + K2CrO4 → Ag2CrO4 + 2 KNO3\n(C) 5 FeCl2 + 8 HCl + KMnO4 → 5 FeCl3 + MnCl2 + 4 H2O + KCl\n(D) Al(NO3)3 + 3 KOH → Al(OH)3 + KNO3", "output": "(C)"}
{"input": "SO2Cl2 → SO2(g) + Cl2(g) At 600 K, SO2Cl2 will decompose to form sulfur dioxide and chlorine gas via the above equation. If the reaction is found to be first order overall, which of the following will cause an increase in the half life of SO2Cl2?\n(A) Increasing the initial concentration of SO2Cl2\n(B) Increasing the temperature at which the reaction occurs\n(C) Decreasing the overall pressure in the container\n(D) None of these will increase the half life", "output": "(D)"}
{"input": "Which following pair of substances can be used to make a buffer solution?\n(A) NaCl and HCl\n(B) HC2H3O2 and KC2H3O2\n(C) NaBr and KBr\n(D) HIO3 and KClO3", "output": "(B)"}
{"input": "Less than 1/1000 of the mass of any atom is contributed by\n(A) the electrons\n(B) the electrons and neutrons\n(C) the electrons and protons\n(D) the protons and neutrons", "output": "(A)"}
{"input": "A 25 g sample of a solid was heated to 100 °C and then quickly transferred to an insulated container holding 100 g of water at 26 °C. The temperature of the mixture rose to reach a final temperature of 37 °C. Which of the following can be concluded?\n(A) The sample lost more thermal energy than the water gained because the sample temperature changed more than the water temperature did.\n(B) Even though the sample temperature changed more than the water temperature did, the sample lost the same amount of thermal energy as the water gained.\n(C) The sample temperature changed more than the water temperature did; therefore the heat capacity of the sample must be greater than the heat capacity of the water.\n(D) The final temperature is less than the average starting temperatures; therefore the equilibrium constant must be less than 1.", "output": "(B)"}
{"input": "Which of the following is the correct order of increasing acid strength?\n(A) H2SeO3 < H2SO3 < HClO < HBrO\n(B) HClO < H2SeO3 < HBrO < H2SO3\n(C) HBrO < HClO < H2SeO3 < H2SO3\n(D) H2SO3 < H2SeO3 < HClO < HBrO", "output": "(C)"}
{"input": "The dimerization of NO2(g) to N2O4(g) is an endothermic process. Which of the following will, according to Le Châtelier's principle, increase the amount of N2O4 in a reaction vessel?\n(A) Decreasing the temperature\n(B) Increasing the size of the reaction vessel\n(C) Adding a selective catalyst\n(D) Making the reaction vessel smaller", "output": "(D)"}
{"input": "Which of the following is incorrectly named?\n(A) CaCl2   calcium chloride\n(B) Fe(NO3)3   iron(III) nitrate\n(C) AlBr3   aluminum tribromide\n(D) K2Cr2O7   potassium dichromate", "output": "(C)"}
{"input": "Which of the following can form hydrogen bonds?\n(A) CH3OCH2CH3\n(B) HCN\n(C) CH3OCH2Br\n(D) CH3NH2", "output": "(D)"}
{"input": "All of the following ions have the same electron configuration except\n(A) Rb+\n(B) Se2-\n(C) As5+\n(D) Sr2+", "output": "(C)"}
{"input": "When will Kp and Kc have the same numerical value?\n(A) At absolute zero for all reactions\n(B) When the concentrations are at standard state\n(C) When the concentrations are all 1.00 molar\n(D) When the reaction exhibits no change in pressure at constant volume", "output": "(D)"}
{"input": "A certain radioactive material has a half-life of 36 minutes. Starting with 10.00 grams of this material, how many grams will be left after 2 hours?\n(A) 1.00 grams\n(B) 1.5 × 10^-4 grams\n(C) 3.33 grams\n(D) 0.25 gram", "output": "(A)"}
{"input": "Joseph Priestly discovered oxygen gas by the decomposition of solid mercury(II) oxide, HgO, to oxygen gas, O2, and liquid mercury metal, Hg. How many moles of oxygen gas will form when 4.32 g of solid mercury(II) oxide decomposes? The formula mass of mercury(II) oxide is 216 g mol^-1.\n(A) 0.100 mol\n(B) 0.0100 mol\n(C) 0.0200 mol\n(D) 0.0150 mol", "output": "(B)"}
{"input": "Which of the following is expected to have the largest bond polarity?\n(A) S–O\n(B) P–F\n(C) C–B\n(D) C–N", "output": "(B)"}
{"input": "How many electrons, neutrons, and protons are in an atom of 52Cr?\n(A) 24 electrons, 24 protons, 24 neutrons\n(B) 27 electrons, 27 protons, 24 neutrons\n(C) 24 electrons, 28 protons, 24 neutrons\n(D) 24 electrons, 24 protons, 28 neutrons", "output": "(D)"}
