{"input": "According to the Ethnocultural Communities Facing AIDS study, single _________ men are more likely than single _________ to report having had more than one sexual partner in the previous year.\n(A) Chinese; North African Muslim\n(B) South Asian; English-speaking Caribbean\n(C) South Asian; Chinese\n(D) North African Muslim; Latin American", "output": "(B)"}
{"input": "For purposes of conception, the best position for intercourse is:\n(A) woman-on-top\n(B) man-on-top\n(C) rear entry\n(D) side-to-side", "output": "(B)"}
{"input": "Which of the following is TRUE of the duration of the refractory period experienced by men?\n(A) it is consistent across men and lasts 20 minutes\n(B) it varies across men lasting from a few minutes to 24 hours\n(C) it tends to be shorter with alcohol consumption\n(D) it tends to be longer in younger men", "output": "(B)"}
{"input": "We are attracted to a person who is similar to us in attitudes because:\n(A) we get positive reinforcement from that person agreeing with us\n(B) the other person's agreement bolsters our sense of rightness\n(C) we anticipate positive interactions with that person\n(D) all of the above", "output": "(D)"}
{"input": "When a woman thinks that she probably is a lesbian, she is at the:\n(A) pride stage\n(B) tolerance stage\n(C) acceptance stage\n(D) confusion stage", "output": "(B)"}
{"input": "Research on the effects of sexually explicit material using material that the viewer finds acceptable has shown that:\n(A) erotica has no effect on sexual behavior\n(B) erotica may lead to increases in sexual arousal for men and women\n(C) nonaggressive erotica leads to massive increases in aggressive behavior\n(D) erotica decreases sexual arousal and sexual interest", "output": "(B)"}
{"input": "The environment for sperm passage is most hospitable just at\n(A) preovulation\n(B) proliferation\n(C) ovulation\n(D) menstruation", "output": "(C)"}
{"input": "Female sterilization inhibits _________ production.\n(A) egg\n(B) estrogen\n(C) progesterone\n(D) none of the above", "output": "(D)"}
{"input": "A person with a rating of 4 on the Kinsey scale would be classified as:\n(A) mostly heterosexual with incidental homosexual experience\n(B) heterosexual with substantial homosexual experience\n(C) homosexual with substantial heterosexual experience\n(D) mostly homosexual with incidental heterosexual experience", "output": "(C)"}
{"input": "What sexual act is prohibited in most societies?\n(A) masturbation\n(B) incest\n(C) sex during menstruation\n(D) sex with a non-spouse if the person is married.", "output": "(B)"}
{"input": "Hillary just found out that she is pregnant but she suspects that her husband has been fooling around. It is important that she be tested for chlamydia because chlamydia can cause which of the following complications?\n(A) tubal pregnancies\n(B) premature delivery\n(C) spontaneous abortion\n(D) all of the above", "output": "(D)"}
{"input": "Which of the following approaches to psychotherapy focuses only the problem behaviour and how to modify it?\n(A) Behaviour modification\n(B) psychoanalytic\n(C) sociological\n(D) evolutionary", "output": "(A)"}
{"input": "At about _________ months after conception, the gender of the fetus is clear from the appearance of external genitals.\n(A) 2\n(B) 4\n(C) 6\n(D) 8", "output": "(B)"}
{"input": "If a woman or man repeatedly experiences pain during intercourse, she will probably want to have intercourse infrequently or not all. In this situation, __________ would likely classify the pain as a punishment.\n(A) Sigmund Freud\n(B) John Money\n(C) B. F. Skinner\n(D) Havelock Ellis", "output": "(C)"}
{"input": "Miss Jones has been concerned about her health lately. She has noticed some itching and skin irritation around her genitals. Given her promiscuous sexual history she suspects that she has contracted:\n(A) chlamydia\n(B) genital warts\n(C) gonorrhea\n(D) pubic lice", "output": "(D)"}
{"input": "Which of the following is removed when a male is circumcised?\n(A) sunna\n(B) corpus spongiosum\n(C) septum\n(D) prepuce", "output": "(D)"}
{"input": "Romulo is on a crowded bus and he sees a woman near the door. Feeling a little saucy Romulo proceeds to rub up against the woman and is immediately aroused. Romulo's inappropriate behavior would be characterized as:\n(A) Frotteurism\n(B) Exhibitionism\n(C) Voyeurism\n(D) Sadomasochism", "output": "(A)"}
{"input": "The endometrium grows and thickens during:\n(A) menstruation\n(B) the follicular phase\n(C) the luteal phase\n(D) ovulation", "output": "(B)"}
{"input": "Avalon had a wild time during spring break. Unfortunately the guy she hooked up with in Palm Beach had genital herpes. Which of the following is true about genital herpes?\n(A) Avalon could not contract genital herpes from performing fellatio (oral-genital sex) on the guy.\n(B) If Avalon contracted genital herpes she can be cured with antibiotics if administered immediately after the first occurrence.\n(C) If Avalon contracted genital herpes she will only be contagious when she has a break out.\n(D) none of the above", "output": "(D)"}
{"input": "Which of the following have menstrual cycles?\n(A) some monkey species\n(B) some ape species\n(C) some breeds of dogs\n(D) a and b only", "output": "(D)"}
