{"input": "Let f(X) = if x = 1 then 0 else [x * f(x - 1) + x**2]. The value of f(4) is\n(A) 53\n(B) 29\n(C) 50\n(D) 100", "output": "(D)"}
{"input": "Suppose there is an open (external) hash table with four buckets, numbered 0,1,2,3, and integers are hashed into these buckets using hash function h(x) = x mod 4. If the sequence of perfect squares 1,4,9, ... , i^2, ... is hashed into the table, then, as the total number of entries in the table grows, what will happen?\n(A) Two of the buckets will each get approximately half the entries, and the other two will remain empty.\n(B) All buckets will receive approximately the same number of entries.\n(C) All entries will go into one particular bucket.\n(D) All buckets will receive entries, but the difference between the buckets with smallest and largest number of entries will grow.", "output": "(A)"}
{"input": "Consider the following possible data structures for a set of n distinct integers.\nI. A min-heap\nII. An array of length n sorted in increasing order\nIII. A balanced binary search tree\nFor which of these data structures is the number of steps needed to find and remove the 7th largest element O(log n) in the worst case?\n(A) I only\n(B) II only\n(C) I and II\n(D) II and III", "output": "(D)"}
{"input": "Which of the following statements is FALSE about memory reclamation based on reference counting?\n(A) Reference counting is well suited for reclaiming cyclic structures.\n(B) Reference counting incurs additional space overhead for each memory cell.\n(C) Reference counting is an alternative to mark-and-sweep garbage collection.\n(D) Reference counting need not keep track of which cells point to other cells.", "output": "(A)"}
{"input": "The main difference between a network operating system and a distributed operating system is that\n(A) A network operating system hides the existence of many machines from the user, but a distributed operating system makes the existence of many machines visible\n(B) A distributed operating system hides the existence of many machines from the user, but a network operating system makes the existence of many machines visible\n(C) A network operating system uses a local-area network, while a distributed operating system uses a wide-area network\n(D) A distributed operating system uses a local-area network, while a network operating system uses a wide-area network", "output": "(B)"}
