{"input": "The language {ww | w in (0 + 1)*} is\n(A) not accepted by any Turing machine\n(B) accepted by some Turing machine, but by no pushdown automaton\n(C) accepted by some pushdown automaton, but not context-free\n(D) context-free, but not regular", "output": "(B)"}
{"input": "Which of the following characteristics of a programming language is best specified using a context-free grammar?\n(A) Identifier length\n(B) Maximum level of nesting\n(C) Operator precedence\n(D) Type compatibility", "output": "(C)"}
{"input": "Which of the following conditions can be expressed by a Boolean formula in the Boolean variables p_1, p_2, p_3, p_4 and the connectives ∧,∨ (without ¬)?\nI. At least three of p_1, p_2, p_3, p_4 are true.\nII. Exactly three of p_1, p_2, p_3, p_4 are true.\nIII. An even number of p_1, p_2, p_3, p_4 are true.\n(A) I only\n(B) II only\n(C) III only\n(D) I and III", "output": "(A)"}
{"input": "Let A and B be two sets of words (strings) from Σ*, for some alphabet of symbols Σ. Suppose that B is a subset of A. Which of the following statements must always be true of A and B ?\nI. If A is finite, then B is finite.\nII. If A is regular, then B is regular.\nIII. If A is context-free, then B is context-free.\n(A) I only\n(B) II only\n(C) III only\n(D) I and II only", "output": "(A)"}
{"input": "Array A contains 256 elements of 4 bytes each. Its first element is stored at physical address 4,096.\nArray B contains 512 elements of 4 bytes each. Its first element is stored at physical address 8,192.\nAssume that only arrays A and B can be cached in an initially empty, physically addressed, physically tagged, direct-mapped, 2K-byte cache with an 8-byte block size. The following loop is then executed.\nfor (i = 0; i < 256; i++)\n        A[i] = A[i] + B[2*i];\nDuring the execution of the loop, how many bytes will be written to memory if the cache has a write-through policy?\n(A) 0\n(B) 256\n(C) 1024\n(D) 2048", "output": "(C)"}
{"input": "Two processors, M-5 and M-7, implement the same instruction set. Processor M-5 uses a 5-stage pipeline and a clock cycle of 10 nanoseconds. Processor M-7 uses a 7-stage pipeline and a clock cycle of 7.5 nanoseconds. Which of the following is (are) true?\nI. M-7’s pipeline has better maximum throughput than M-5’s pipeline.\nII. The latency of a single instruction is shorter on M-7’s pipeline than on M-5’s pipeline.\nIII. Programs executing on M-7 will always run faster than programs executing on M-5.\n(A) I only\n(B) II only\n(C) I and III\n(D) II and III", "output": "(A)"}
{"input": "Of the following, which gives the best upper bound for the value of f(N) where f is a solution to the recurrence f(2N + 1) = f(2N) = f(N) + log N for N >= 1, with f(1) = 0?\n(A) O(log N)\n(B) O(N log N)\n(C) O(log N) + 0(1)\n(D) O((log N)^2)", "output": "(D)"}
{"input": "In multiprogrammed systems it is advantageous if some programs such as editors and compilers can be shared by several users. Which of the following must be true of multiprogrammed systems in order that a single copy of a program can be shared by several users?\nI. The program is a macro.\nII. The program is recursive.\nIII. The program is reentrant.\n(A) I only\n(B) II only\n(C) III only\n(D) II and III only", "output": "(C)"}
{"input": "\"Magic memory\"' has two operations: Read and Clear. Both are indivisible and mutually exclusive. Clear sets the magic memory to zero. Read returns a value that represents the number of Read operations since the last Clear operation. Which of the following is (are) true of \"Magic memory\"?\nI. It can provide the functionality of an atomic Test-and-Set.\nII. It can be used to coordinate processes running on a shared-memory multiprocessor.\nIII. It is only useful on a multiprocessor.\n(A) I only\n(B) II only\n(C) III only\n(D) I and II", "output": "(D)"}
{"input": "If a malicious process is granted temporary administrator-level access to a system\n(A) the threat is over as soon as the process is killed\n(B) the threat is over after the operating system is rebooted\n(C) the thread is over after rebooting the machine and replacing files that show a virus infection\n(D) the threat is often permanent until the entire disk is wiped clean", "output": "(D)"}
{"input": "Which of the following language features requires that stack-based storage allocation be used rather than static allocation?\n(A) Recursive procedures\n(B) Arbitrary goto's\n(C) Two-dimensional arrays\n(D) Integer-valued functions", "output": "(A)"}
{"input": "For all strings x, the function x^M is defined recursively as follows.\ne^M= e, and\nif w is a string and a is a string with length 1, then\n(aw)^M = aw^Ma.\nLet a be a string with length 1, and let x and y be arbitrary strings. Which of the following is true?\n(A) a^M = a\n(B) (ax)^M = (xa)^M\n(C) (xy)^M = y^Mx^M\n(D) None of the above", "output": "(D)"}
{"input": "Which of the following statements about floating-point arithmetic is NOT true?\n(A) It is inherently nonassociative because some numbers have no exact representation.\n(B) It is inherently nonassociative because there have to be upper and lower bounds on the size of numbers.\n(C) Associativity can be achieved with appropriate roundoff conventions.\n(D) Some rational numbers have no exact representation.", "output": "(C)"}
{"input": "A particular disk unit uses a bit string to record the occupancy or vacancy of its tracks, with O denoting vacant and 1 denoting occupied. A 32-bit segment of this string has the hexadecimal value D4FE2003. The percentage of occupied tracks for the corresponding part of the disk, to the nearest percent, is\n(A) 12%\n(B) 25%\n(C) 38%\n(D) 44%", "output": "(D)"}
{"input": "Let T be a depth-first search tree of a connected undirected graph G. For each vertex v of T, let pre(v) be the number of nodes visited up to and including v during a preorder traversal of T, and post(v) be the number of nodes visited up to and including v during a postorder traversal of T. The lowest common ancestor of vertices u and v in T is a vertex w of T such that w is an ancestor of both u and v, and no child of w is an ancestor of both u and v. Let (u, v) be an edge in G that is not in T, such that pre(u) < pre(v). Which of the following statements about u and v must be true?\nI. post(u) < post(v)\nII. u is an ancestor of v in T.\nIII. If w is the lowest common ancestor of u and v in T, then w = u.\n(A) I only\n(B) II only\n(C) III only\n(D) II and III", "output": "(D)"}
{"input": "For a connected, undirected graph G = (V, E), which of the following must be true?\nI. Σ_{v∈V} degree(v) is even.\nII. |E| ≥ |V| − 1\nIII. G has at least one vertex with degree 1.\n(A) I only\n(B) II only\n(C) III only\n(D) I and II", "output": "(D)"}
{"input": "Which of the following is NOT a reasonable justification for choosing to busy-wait on an asynchronous event?\n(A) The wait is expected to be short.\n(B) A busy-wait loop is easier to code than an interrupt handler.\n(C) There is no other work for the processor to do.\n(D) The program executes on a time-sharing system.", "output": "(D)"}
{"input": "One approach to handling fuzzy logic data might be to design a computer using ternary (base-3) logic so that data could be stored as “true,” “false,” and “unknown.” If each ternary logic element is called a flit, how many flits are required to represent at least 256 different values?\n(A) 4\n(B) 5\n(C) 6\n(D) 7", "output": "(C)"}
{"input": "Let G = (V, E) be a connected, undirected graph, and let a and b be two distinct vertices in V. Let P_1 be the problem of finding a shortest simple path between a and b, and let P_2 be the problem of finding a longest simple path between a and b. Which of the following statements about P_1 and P_2 is true?\n(A) Both P_1 and P_2 can be solved in polynomial time.\n(B) P_1 can be solved in polynomial time but P_2 is not known to be solvable in polynomial time.\n(C) P_1 is not known to be solvable in polynomial time but P_2 can be solved in polynomial time.\n(D) It is not known whether either P_1 or P_2 can be solved in polynomial time.", "output": "(B)"}
{"input": "An Euler circuit of an undirected graph is a circuit in which each edge of the graph appears exactly once. Which of the following undirected graphs must have an Euler circuit?\nI. A complete graph with 12 vertices\nII. A complete graph with 13 vertices\nIII. A tree with 13 vertices\n(A) I only\n(B) II only\n(C) III only\n(D) I and II", "output": "(B)"}
